[
  {
    "case_number": "Case 58-1",
    "title": "I.4.",
    "year": 1958,
    "date": "April 05, 2025",
    "full_text": "Engineer D, a licensed professional engineer, works as the City Engineer in a mid-sized municipality that has been experiencing rapid growth along with rapid infrastructure growth. Engineer D has been one of the City's main points of contact for AE firms and contractors in the area, both with respect to contract negotiation and award (consultant and construction) and senior-level review of major project issues that arise from time to time.Engineer D announces plans to step down as the City Engineer and indicates that they accepted a position at an unnamed engineering firm in the City. Of significance is that the City does not include “revolving door” provisions in employment contracts for its senior-level employees.Shortly after Engineer D's announcement, Firm AE&R announces Engineer D as a newly hired associate.  AE&R completed many projects for the City during Engineer D's tenure as City Engineer, and the firm plans to continue submitting proposals and performing consulting work for the City.\n\nIs it ethical for Engineer D to accept employment with AE&R?Is it ethical for Engineer D to be immediately, directly involved with AE&R's projects with the City?\n\nIs it ethical for Engineer D to accept employment with AE&R?\n\nIs it ethical for Engineer D to be immediately, directly involved with AE&R's projects with the City?\n\nThis case has to do with what are commonly called “revolving door” constraints governing the ethics of high-level government employees (federal, state, municipal) who leave public employment to enter the private sector. Such persons are – or can be – viewed as being in a position to unfairly profit from or otherwise trade upon the contacts, associations, influence, and special knowledge they acquired during their tenure as public servants. Practices of concern include but are not limited to involvement in the solicitation of continuing contracts, assuming the management and oversight for active projects, participating in the solicitation of new work for which the employee had been directly involved as a public-sector employee, and related professional matters.\n\nWe start the discussion by reviewing the first case the Board of Ethical Review published, BER Case 58-1. In that case a foreign government agency invited proposals to complete a design and supervise construction of a hydroelectric project. The basic plans for the project were in place and were prepared by a team of engineers working for a US government agency. Several of those engineers negotiated with at least two AE firms with the intent of taking part in the design and supervision of the work. The engineers formed a corporation to be part of a joint venture to design the hydroelectric project. At about the time the various contract negotiations were wrapping up, the engineers resigned from their US government positions and entered into a contract with the foreign government to work on the hydroelectric project. The Board was asked, “Was it a violation of the Canons of Ethics or the Rules of Professional Conduct for employees of the US Government, while still employed, to organize a new private company and negotiate a contract to take part in the design of a project for which they had prepared preliminary plans as employees of the Government?”\n\nIn BER Case 58-1, the Board began by noting “there can be no question of the basic right of an American citizen to resign from one position and accept another or initiate a business of his own.” The Board noted that they were not able to call witnesses to understand the exact circumstances of the case, but they pointed out, “It seems axiomatic that the personal and intimate knowledge of the project which the employees gained from their work on the preliminary design of the project and the acquaintance they made with the representatives of the owner of the project gave them many distinct advantages over any other firms who may have considered the offering of their services to the owner. The crucial question is, therefore, ‘Were these advantages used unfairly?’” Said the Board:\n\n…They (the advantages) might have been used and in any case the possibility of the existence of one or more of these facets raises a cloud of doubt as to the purity of the enterprise. It becomes a matter which might be considered under Section 19 of the Canons, which states: \"The engineer will endeavor to protect the engineering profession collectively and individually from misrepresentation and misunderstanding.\"\n\nThe Board concluded, “The… [engineers] in question have violated the spirit of the Canons and Rules, although the evidence does not prove them to be in violation of specific paragraph (sic), as now worded.” They went on to state, “it tends to bring dishonor to the profession of engineering if the [engineer] devotes his energies, while still employed, to promote his future practice or employment on the basis of having inside information which would lead to greater profits, if he can secure a position or enter into contract to work on further details of the identical project.”\n\nBER Case 58-1 included a dissent:\n\nThe guiding principle behind the phrasing of the \"Rules\" is that the words mean exactly what they say-that there is no concealed, hidden, or obscure \"intent.\" In my opinion the \"Conclusion\" of the report should be, \"The Board believes that the [engineers] in question have not violated the Canons or Rules as they currently exist.\" This could be followed by a \"Recommendation\" that the Ethical Practices Committee be instructed to consider the desirability of adding another Rule… to make unethical a situation similar to the one considered, as well as for a situation where the employees were other than Government.\n\nSince that first case, the Board has considered multiple situations where a professional engineer in private practice or an engineering firm also serves as a city, town, or county engineer. While such cases are more directly concerned with dual employment, the situations are pertinent relative to many ethical considerations of transitional employment. Three cases are illustrative.\n\nIn BER Case 63-5, a small community retained a professional engineer, Engineer B, on a part-time basis to serve as city engineer. Engineer B was engaged in full-time private practice and treated his part-time service to the community as a public service. In addition to general advisory services to the city, Engineer B was selected by the city council for the preparation of plans and specifications for a city project. In such cases, Engineer B was compensated on a normal professional fee basis over and above his monthly retainer. The Board ruled that it is ethical for a professional engineer retained by a community on a part-time basis as a city engineer to prepare plans and specifications for a project for the same community, but in so acting the engineer must be scrupulously careful that his advice is not influenced by his secondary interest as the engineer likely to be retained for the design of the project. The Board noted that “it is axiomatic that a professional person may not take action or make decisions which would divide his loyalties or interests from those of his employer or client.” Among the issues the Board considered in BER Case No. 63-5 was the practical question of the engineer passing on the adequacy of his own plans in his capacity as city engineer. The Board noted that there is no requirement in the NSPE Code that an engineer’s plans for a client must be reviewed by an engineer employed or retained by the client. The Board noted that the client had the right of review by its own engineer, but it may waive its right, as it did in BER Case 63-5, and under those circumstances, the engineer was acting in a dual capacity but not a divided one.\n\nIn BER Case 74-2, the Board considered a case involving a state law that required that every municipality have a municipal engineer whose duties and compensation were to be fixed by a municipal ordinance. But many of the smaller communities in the state did not have and could not afford full-time municipal engineers or supporting staff personnel for a full-time office. In such instances the smaller communities retained the services of a consulting firm in private practice and appointed a principal of the firm as the municipal engineer. Such a municipal engineer was paid either on a cost-plus basis or a flat monthly retainer—usually a relatively low amount. The municipal engineer’s firm was thereafter usually retained for engineering services for capital improvement projects needed by the municipality. In deciding that it was ethical for the engineer – who was not a municipal employee, but whose compensation was paid on a retainer or fee basis -- to serve as municipal engineer and participate in a consulting firm providing engineering services to the same municipality under the stated conditions, the Board determined that the public interest was best served by providing the small municipalities with the most competent engineering services which they can acquire. It was assumed by the Board that the state law was intended to achieve this end.\n\nMore recently, BER Case 11-12 considered the situation of Engineer A, who served as the part-time town engineer for Smithtown and also had a consulting engineering practice. With Engineer A's advice and concurrence, Smithtown selected Engineer B to provide design services for a local road project. Following the selection and after Engineer B began to perform preliminary design services, Engineer A, in his role as town engineer, reviewed Engineer B’s preliminary work and became convinced Engineer B’s performance on the contract did not meet the standards as outlined in Engineer B’s contract. Following the termination of Engineer B under the terms and conditions of his contract with the town, Engineer A offered, and Smithtown agreed, that Engineer A's firm should perform the design work for the local road project for Smithtown. In determining it would not be ethical for Engineer A to offer and agree to perform the work for Smithtown, the Board observed that serious ethical constraints would preclude the selection of Engineer A by the town to perform the road design work. Because Engineer A was an officer or principal of his engineering firm, according to NSPE Code of Ethics Section II.4.e, Engineer A was not eligible to provide engineering services to Smithtown for the local road project. This conclusion is based upon the language of Code Section II.4.e and is irrespective of whether the town’s procurement laws were scrupulously followed. The Board further opined that the disclosure of any further circumstances would not be sufficient to avoid a conflict of interest or the appearance of a conflict of interest.\n\nConflicts of interest feature prominently in transitional employment situations. BER Case 14-8 for example – which is in many ways the converse of the situation Engineer D faces in the present case – describes how Engineer A worked for a private company and stamped a water rights analysis for a client, and that analysis was working its way through the court system. During the legal review, Engineer A resigned from their firm and went to work for the State – the State being an objector to the analysis Engineer A prepared. The Board was asked to weigh in on Engineer A’s ethical obligations. The case discussion noted Engineer A’s ongoing duty both to their former employer and the private client. Engineer A could not have disclosed, participated in or represented the State's interest in connection with this proceeding unless Engineer A first obtained the permission/consent of Engineer A's former private firm employer and also the client. The BER discussion and conclusion recommended:\n\nEngineer A should be assigned other duties by the State, remain isolated from the State's water rights case involving Engineer A's former employer and its client—and the State should recognize and respect Engineer A's ethical obligations in this matter. Any involvement by Engineer A in the State's case could potentially compromise the interests of all parties—the former employer, the private client, and the State—as Engineer A's dual role and his professional opinion/judgment—as an employee of the private firm and now as a State employee—could be called into question—by one of the parties, the public, or the media.\n\nAs a final example, BER Case 15-8 offers direct guidance on the ethics of transitional employment. Engineer P is a “top” official in State X highway department who would like to leave and become an executive in an architecture/engineering (AE) firm. Engineer P requested permission from the State X highway department to accept the new position; however, the State X highway department refused to grant permission, noting that, in accepting the position, Engineer P would be in violation of the state law that requires top State X highway officials to wait a year after leaving the highway department before accepting positions with firms with which the department does business. In response, Engineer P left the State X highway department and joined the AE firm not as an “employee” but as an “independent contractor.”  The board was asked if it was ethical for Engineer P to leave the State X highway department and join the AE firm in this way.\n\nThe BER pointed out a potential conflict of interest existed between Engineer P’s obligations to his former employer—the State X highway department—and the party with which Engineer P was now contracting, the AE firm. They also noted that while disclosure of a desired new employment relationship had been made, disclosure alone was not sufficient. The BER stated, “the agreement for a one-year hiatus after leaving government service before accepting related employment is not supported by disguising the employment as ‘independent contracting’.” The BER concluded:\n\nThe fact that Engineer P proceeded to join the architecture/engineering firm as an “independent contractor” instead of as an “executive employee” was an apparent way of circumventing state law. The Board of Ethical Review believes that Engineer P’s actions were unethical.\n\nWe now turn to the present case, the situation of Engineer D who resigned the position as City Engineer in a mid-sized municipality, and shortly thereafter accepted the position of “associate” at Firm AE&R, a consultant with whom Engineer D would have regularly interacted during tenure with the City. The facts of the case specifically note Engineer A's employment contract with the City did not include a revolving door prohibition such as Engineer P faced in BER Case 15-8. Thus, on the face of the matter, it would seem there is no legal barrier to Engineer A accepting employment with Firm AE&R. BER Case 58-1 and other cases since then support the engineer’s right of employment. But that does not mean such employment would exempt Engineer A from the ethical requirements and obligations of the NSPE Code of Ethics.\n\nWhat are some of these ethical requirements and obligations? Among the most obvious are Code Sections II.4.c and III.6 which prohibit engineers from advancing their professional careers by any improper or questionable method. Likewise, Code Section II.5.b would prohibit the principals of Firm AE&R from inducing Engineer A to join the firm as a way of influencing the awarding of city contracts for improper reasons not related to Engineer A’s qualifications and experience.  The facts of the case are silent on these matters, and the Board takes this to mean no violation occurred.\n\nSome might assert that because Engineer A's employment contract with the City did not include a revolving door prohibition, nothing more needs to be said. But the BER does not hold this perspective. BER Case 58-1 speaks of the “purity of the enterprise”, of avoiding “dishonor to the profession,” and how engineers must consider not only the letter but the spirit of the ethics code. Consistent with Fundamental Canon 1.6, such values form the context of an engineer’s professional relationships and apply in this case.\n\nThough revolving door prohibitions are not specifically in effect, the spirit of such provisions can guide multiple aspects of Engineer D’s employment activities. For example, the BER believes Engineer D’s prior responsibilities with the City for projects currently under contract by D’s new employer would raise concerns about objectivity and fairness if Firm AE&R directly placed Engineer D in responsible charge of those projects as a consultant. In this situation, disclosure by Engineer D and acceptance by the City may cure the matter. Alternatively, Engineer D can follow the recommendations in BER Case 14-8 and remain isolated from former projects until those contracts lapse.\n\nConfidentiality is another ethical obligation that continues after one severs employment (Code Section III.4). Engineer D should not use or disclose confidential information acquired during the course of or by reason of duties or employment with the City. That is, Engineer D should not be allowed to breach confidentiality for personal gain.\n\nThird, as a public official who transitions to private practice, Engineer D should not unfairly profit from or otherwise trade upon the contacts, associations, and special knowledge she acquired during tenure as a public servant. In particular this would apply to direct procurement activities.  But does this mean Engineer D is automatically precluded from using D’s professional knowledge and expertise to serve the City in a consulting role? The Board sees room for accommodation.\n\nPast BER cases affirm that full disclosure by the engineer (i.e., Engineer D) coupled with careful and thoughtful acceptance by the client (i.e., the City) can be sufficient to cure “known or potential conflicts of interest that could influence or appear to influence the engineer’s judgment or the quality of their services” (II.4.a). In evaluating disclosed information, important factors include avoiding divided interests by the engineer, advancing the best interests of the client, and complying with procurement requirements. While approval through disclosure is not automatic, ample precedent has shown that within many contexts the parties directly involved are in the best position to serve the public interest by providing the most competent engineering services available.\n\nWhat about marginal situations, or conditions where a known or potential conflict would be prohibitive or too complex to set aside? Here, as was done in BER Case 15-8, an embargo or \"cooling off\" period, often one-year duration, can ameliorate such concerns. That is, as appropriate and prudent, Engineer D could voluntarily abstain from participation in procurement matters before the City, or before any other agency for which the City is or was the approving authority, for an agreed period of say, one year after she leaves the public job.\n\nThese transitional employment practices, in the spirit of NSPE Code of Ethics, are intended to help Engineer D engage only in conduct that is honorable, responsible, ethical, and lawful so as to enhance the honor, reputation, and usefulness of the engineering profession.\n\nI.4.\n\nAct for each employer or client as faithful agents or trustees.\n\nI.6.\n\nConduct themselves honorably, responsibly, ethically, and lawfully so as to enhance the honor, reputation, and usefulness of the profession.\n\nII.4.a.\n\nEngineers shall disclose all known or potential conflicts of interest that could influence or appear to influence their judgment or the quality of their services.\n\nII.4.c.\n\nEngineers shall not solicit or accept financial or other valuable consideration, directly or indirectly, from outside agents in connection with the work for which they are responsible.\n\nII.4.e.\n\nEngineers shall not solicit or accept a contract from a governmental body on which a principal or officer of their organization serves as a member.\n\nII.5.b.\n\nEngineers shall not offer, give, solicit, or receive, either directly or indirectly, any contribution to influence the award of a contract by public authority, or which may be reasonably construed by the public as having the effect or intent of influencing the awarding of a contract. They shall not offer any gift or other valuable consideration in order to secure work. They shall not pay a commission, percentage, or brokerage fee in order to secure work, except to a bona fide employee or bona fide established commercial or marketing agencies retained by them.\n\nIII.4.\n\nEngineers shall not disclose, without consent, confidential information concerning the business affairs or technical processes of any present or former client or employer, or public body on which they serve.\n\nIII.4.a.\n\nEngineers shall not, without the consent of all interested parties, promote or arrange for new employment or practice in connection with a specific project for which the engineer has gained particular and specialized knowledge.\n\nIII.6.\n\nEngineers shall not attempt to obtain employment or advancement or professional engagements by untruthfully criticizing other engineers, or by other improper or questionable methods.\n\nInasmuch as no “revolving door” contractual (i.e., legal) prohibition exists to private employment, it would be ethical for Engineer D to accept employment with firm AE&R.  This finding is consistent with a long history of NSPE cases; engineers are free to move and work where they would like.As to whether it would be ethical for Engineer D to be immediately, directly involved with AE&R's projects with the City, the answer is mixed as multiple considerations and details will affect the outcome. For example, participation in ongoing projects for which Engineer D has particular specialized knowledge may be ethical with disclosure and consent. Likewise, situations such as negotiating change orders (potential conflict of interest) might also be cured by disclosure and consent. However, for complex situations (e.g., perception of influence relative to solicitation of a contract) or prohibitive situations (e.g., divulging confidential information) a voluntary embargo by Engineer D for a specified period of time may be efficacious. In positive ways, such practices facilitate conduct which is honorable, responsible, ethical and lawful so as to enhance the honor, reputation and usefulness of the engineering profession.\n\nInasmuch as no “revolving door” contractual (i.e., legal) prohibition exists to private employment, it would be ethical for Engineer D to accept employment with firm AE&R.  This finding is consistent with a long history of NSPE cases; engineers are free to move and work where they would like.\n\nAs to whether it would be ethical for Engineer D to be immediately, directly involved with AE&R's projects with the City, the answer is mixed as multiple considerations and details will affect the outcome. For example, participation in ongoing projects for which Engineer D has particular specialized knowledge may be ethical with disclosure and consent. Likewise, situations such as negotiating change orders (potential conflict of interest) might also be cured by disclosure and consent. However, for complex situations (e.g., perception of influence relative to solicitation of a contract) or prohibitive situations (e.g., divulging confidential information) a voluntary embargo by Engineer D for a specified period of time may be efficacious. In positive ways, such practices facilitate conduct which is honorable, responsible, ethical and lawful so as to enhance the honor, reputation and usefulness of the engineering profession.",
    "url": "https://www.nspe.org/career-resources/ethics/post-public-employment-city-engineer-transitioning-consultant",
    "pdf_url": null,
    "scraped_at": "2025-04-05T17:10:46.719865",
    "metadata": {
      "related_cases": [
        "Case 14-8",
        "Case 11-12",
        "Case 63-5",
        "Case 15-8",
        "Case 74-2",
        "Case 58-1"
      ],
      "codes_cited": [
        "Code II.4.a",
        "Code II.4.c",
        "Code I.6",
        "Code III.4.a",
        "Code II.5.b",
        "Code I.4",
        "Code III.4",
        "Code II.4.e",
        "Code III.6"
      ],
      "principles": [
        "objectivity",
        "honesty",
        "professional conduct",
        "conflicts of interest",
        "confidentiality",
        "professional responsibility",
        "disclosure",
        "competency"
      ],
      "outcome": "unethical",
      "operationalization_techniques": [
        "Principle Instantiation",
        "Case Instantiation",
        "Conflicting Principles Resolution"
      ],
      "board_analysis": "ltant. In this situation, disclosure by Engineer D and acceptance by the City may cure the matter. Alternatively, Engineer D can follow the recommendations in BER Case 14-8 and remain isolated from former projects until those contracts lapse.\n\nConfidentiality is another ethical obligation that continues after one severs employment (Code Section III.4). Engineer D should not use or disclose confidential information acquired during the course of or by reason of duties or employment with the City. That is, Engineer D should not be allowed to breach confidentiality for personal gain.\n\nThird, as a public official who transitions to private practice, Engineer D should not unfairly profit from or otherwise trade upon the contacts, associations, and special knowledge she acquired during tenure as a public servant. In particular this would apply to direct procurement activities.  But does this mean Engineer D is automatically precluded from using D’s professional knowledge and expertise to serv\n[content truncated]",
      "ethical_questions": [
        "Is it ethical for Engineer D to accept employment with AE&R?",
        "Is it ethical for Engineer D to be immediately, directly involved with AE&R's projects with the City?",
        "Is it ethical for Engineer D to accept employment with AE&R?",
        "Is it ethical for Engineer D to be immediately, directly involved with AE&R's projects with the City?",
        "What are some of these ethical requirements and obligations?"
      ]
    }
  },
  {
    "case_number": "Case 14-8",
    "title": "I.1.",
    "year": 2014,
    "date": "April 05, 2025",
    "full_text": "A new subdivision is planned in City C, located in State Q. Developer G retains Firm BWJ (an engineering and surveying firm), under the direction of Principal Engineer R, to develop plans for the subdivision.  The plans were administratively reviewed for conformance with City C policy and approved by City Engineer J and are released for bidding and construction. City Engineer J was formerly a principal at Firm BWJ.City C’s subdivision regulations require that post-development 25-year recurrence interval peak stormwater flows must be equal to or less than pre-development conditions.After the subdivision is completed, properties in the vicinity of the subdivision experience flooding.  Property owners complain that the flooding damage caused water damage to their homes, and because of these complaints, City C engaged a third-party engineering firm (IBM) to review the subdivision design.  Property owners also complain that City Engineer J is ethically compromised because of his former employment with Firm BWJ.After performing independent modeling and analysis, Firm IBM found storm runoff flows to be substantially larger for the 25-year, two-hour storm event after the subdivision was completed. One of the complaining property owner's driveway culverts was determined to have insufficient capacity for a 25-year storm event. Construction of extensive paved areas and a large outbuilding by one of the property owners was also determined to have exacerbated flooding potential.\n\nWas it ethical for City Engineer J to review and approve plans prepared by Firm BWJ, given that City Engineer J formerly worked for Firm BWJ?What are Principal Engineer R's ethical responsibilities under the facts?\n\nWas it ethical for City Engineer J to review and approve plans prepared by Firm BWJ, given that City Engineer J formerly worked for Firm BWJ?\n\nWhat are Principal Engineer R's ethical responsibilities under the facts?\n\nThis case presents the Board of Ethical Review with two matters for review. First, members of the public perceive the City Engineer J’ former employment with the BWJ presents a conflict of interest, and they make their concerns broadly known through the community. The Board is asked to decide if City Engineer J is ethically compromised. The second issue involves apparent design errors by Principal Engineer R. Prior to construction, adjacent property has not flooded, and an independent analysis of the design seems to show stormwater runoff flows are larger after construction (in conflict with the City’s requirements for peak flows being less than or equal to pre-development conditions).\n\nThe first ethical issue has to do with whether City Engineer J can ethically review and approve design documents submitted to the City by the former employer, Firm BWJ. BER Case 14-8 provides a backdrop to consider City Engineer J’s situation. In BER Case 14-8, Engineer A worked for a private company and stamped a water rights analysis for a client, and that analysis was working its way through the court system. During the legal review, Engineer A resigned from the firm and went to work for the State – the State was an objector to the analysis A prepared. The Board was asked to weigh in on A’s ethical obligations. The BER case discussion noted Engineer A’s ongoing duty both to the former employer and the private client. Engineer A would not have been able to disclose, participate or represent the state's interest in connection with this proceeding unless Engineer A first obtains the permission/consent of Engineer A's former private firm employer and the client.\n\nThis discussion reveals a significant question for the present case, namely, when Engineer J left Firm BWJ and joined the City C. Unlike BER Case 14-8 where the transition literally happened in the midst of the project for which the Board was rendering an opinion, in the present case the transition is implied to have been earlier, possibly many years ago. If so, the Board finds no issue with Engineer J having worked for Firm BWJ back in the day. However, if Engineer J’s transition from BWJ to City C was recent (i.e., less than one year ago), ethical questions may arise. The BER will assume Engineer J left Firm BWJ at least a year before the subdivision work was under contract.\n\nThe second ethical issue has to do with Principal Engineer R’s actions in view of the assertion of an error in the stormwater flow calculations by Firm IBM. We turn to BER Case 16-7 for guidance; the case discusses Engineer A’s work providing forensic engineering services for attorneys in connection with pending litigation. Before a legal settlement is reached and while negotiations are underway, Engineer A discovers that data their report was based on is inaccurate and that if more accurate data had been used, Engineer A's conclusions would be different. The Board reviewed these facts, and used them, in conjunction with a similar fact set in BER Case 95-5 to conclude that once Engineer A discovered that the data upon which the report was based was inaccurate, there is an affirmative obligation to step forward and advise their client about the inaccurate data and the new conclusions.\n\nPrincipal Engineer R should consider obligation III.1a and acknowledge the runoff problem – actual flooding experience and IBM’s modeling show the subdivision created an issue. Professional obligation III.8 affirms that professionals are responsible for their professional activities, professional obligation III.1.a affirms that professional engineers must acknowledge errors.\n\nAlthough dealing with unethical use of an overbroad indemnification clause, BER Case 93-8 provides context for addressing errors:\n\nA basic tenet of ethical conduct relates to the obligation of the engineer to accept responsibility for professional services that the engineer renders. This tenet is based upon the view that as a member of a learned profession, an engineer possesses skill, knowledge and expertise and is expected to use those attributes for the betterment of mankind.\n\nIn the present case, both actual flood damage and IBM’s modeling suggests that the subdivision design failed to comply with City C’s regulatory requirement that post-development runoff not exceed pre-development runoff.\n\nAfter reviewing and verifying IBM’s analysis and checking that analysis against R’s own work, Engineer R of BWJ should consider obligations III.1.a and III.8, acknowledge the runoff problem, and bring the BWJ risk management team together to address the runoff flow problem. There may be a determination / allocation of fault by all parties involved. Ultimately a workable design must be identified, designed, and constructed that serves the citizens of City C.\n\nI.1.\n\nHold paramount the safety, health, and welfare of the public.\n\nI.4.\n\nAct for each employer or client as faithful agents or trustees.\n\nI.6.\n\nConduct themselves honorably, responsibly, ethically, and lawfully so as to enhance the honor, reputation, and usefulness of the profession.\n\nII.4.a.\n\nEngineers shall disclose all known or potential conflicts of interest that could influence or appear to influence their judgment or the quality of their services.\n\nIII.1.a.\n\nEngineers shall acknowledge their errors and shall not distort or alter the facts.\n\nIII.2.d.\n\nEngineers are encouraged to adhere to the principles of sustainable development1 in order to protect the environment for future generations.\n\tFootnote 1 \"Sustainable development\" is the challenge of meeting human needs for natural resources, industrial products, energy, food, transportation, shelter, and effective waste management while conserving and protecting environmental quality and the natural resource base essential for future development.\n\nIII.8.\n\nEngineers shall accept personal responsibility for their professional activities, provided, however, that engineers may seek indemnification for services arising out of their practice for other than gross negligence, where the engineer's interests cannot otherwise be protected.\n\nGiven the facts, the Board interprets that Engineer J’s transition from the private sector to the public sector was not recent and there does not appear to be a conflict between J’s former work at BWJ and their current work for City C.Although flood damage and independent consultant Firm IBM’s analysis show larger flows, Principal Engineer R and Principal Engineers R’s firm should confirm whether an error exists – essentially, they should re-review Firm IBM’s analysis.  If Firm BWJ determines they made a mistake, Principal Engineer R is responsible to acknowledge errors.\n\nGiven the facts, the Board interprets that Engineer J’s transition from the private sector to the public sector was not recent and there does not appear to be a conflict between J’s former work at BWJ and their current work for City C.\n\nAlthough flood damage and independent consultant Firm IBM’s analysis show larger flows, Principal Engineer R and Principal Engineers R’s firm should confirm whether an error exists – essentially, they should re-review Firm IBM’s analysis.  If Firm BWJ determines they made a mistake, Principal Engineer R is responsible to acknowledge errors.",
    "url": "https://www.nspe.org/career-resources/ethics/excess-stormwater-runoff",
    "pdf_url": null,
    "scraped_at": "2025-04-05T17:10:48.430487",
    "metadata": {
      "related_cases": [
        "Case 16-7",
        "Case 95-5",
        "Case 14-8",
        "Case 93-8"
      ],
      "codes_cited": [
        "Code II.4.a",
        "Code I.6",
        "Code III.1.a",
        "Code III.8",
        "Code I.1",
        "Code I.4",
        "Code III.1",
        "Code III.2.d"
      ],
      "principles": [
        "public safety",
        "safety",
        "professional conduct",
        "welfare",
        "conflicts of interest",
        "professional responsibility",
        "health",
        "disclosure",
        "competency"
      ],
      "outcome": "unethical",
      "operationalization_techniques": [
        "Principle Instantiation",
        "Case Instantiation",
        "Conflicting Principles Resolution"
      ],
      "board_analysis": "dge the runoff problem, and bring the BWJ risk management team together to address the runoff flow problem. There may be a determination / allocation of fault by all parties involved. Ultimately a workable design must be identified, designed, and constructed that serves the citizens of City C.\n\nI.1.\n\nHold paramount the safety, health, and welfare of the public.\n\nI.4.\n\nAct for each employer or client as faithful agents or trustees.\n\nI.6.\n\nConduct themselves honorably, responsibly, ethically, and lawfully so as to enhance the honor, reputation, and usefulness of the profession.\n\nII.4.a.\n\nEngineers shall disclose all known or potential conflicts of interest that could influence or appear to influence their judgment or the quality of their services.\n\nIII.1.a.\n\nEngineers shall acknowledge their errors and shall not distort or alter the facts.\n\nIII.2.d.\n\nEngineers are encouraged to adhere to the principles of sustainable development1 in order to protect the environment for future generations\n[content truncated]",
      "ethical_questions": [
        "Was it ethical for City Engineer J to review and approve plans prepared by Firm BWJ, given that City Engineer J formerly worked for Firm BWJ?",
        "What are Principal Engineer R's ethical responsibilities under the facts?",
        "Was it ethical for City Engineer J to review and approve plans prepared by Firm BWJ, given that City Engineer J formerly worked for Firm BWJ?",
        "What are Principal Engineer R's ethical responsibilities under the facts?"
      ]
    }
  },
  {
    "case_number": "Case 02-5",
    "title": "I.2.",
    "year": 2002,
    "date": "April 05, 2025",
    "full_text": "County A was expecting a significant amount of rural roadway construction in the upcoming construction season. County A did not have enough engineering staff to handle the design effort required for the expected workload. Therefore, the County decided to advertise for consulting services to accomplish the needed design. It had been a policy of the County to utilize local design services whenever possible in these cases. Subsequently, the advertisement was published only locally.All local engineering firms responded to the advertisement. There was enough design work available that each of the local firms could receive one or more design projects. One local engineering firm owner, Engineer B (an experienced water and wastewater engineer) was experiencing a downturn in committed work which would have affected the bottom line of the firm and could have resulted in layoffs of its staff. While not experienced in rural roadway design, Engineer B gave assurances to the County that they could perform the services adequately. They also lobbied the County Commission in their favor. Engineer B received an award from the County for a single roadway design project. Engineer B completed the design project, the County bid the project and then proceeded into construction. The County, in this case, decided to utilize their own staff for construction period services. During the construction phase, problems and issues began occurring immediately. A significant number of field revisions were necessary and estimated quantities of work had been miscalculated, resulting in excessive time and effort for the County to resolve. The County grew increasingly frustrated with the quality of work provided by Engineer B. Through the efforts of the County staff, the project was able to remain within its budget.\n\nDuring a meeting with the County as these problems occurred, Engineer B did admit that the problems encountered were outside the firm’s understanding of proper design. If understood by Engineer B, the issues could have been avoided.\n\nWas it ethical for Engineer B to accept the rural roadway design contract under these circumstances?\n\nThe Code of Ethics specifically states Engineers shall not affix their signature to any plans dealing with subject matter in which they lack competence. The Board of Ethical Review has reviewed this requirement in past cases.\n\nIn BER Case 02-5, the Board studied a situation in which a structural engineer, competent in severe weather structural engineering, designed a building that had a structural failure from a severe weather condition. This failure could have been avoided if the engineer had incorporated design parameters suggested in recent technical literature with which the engineer was not familiar. The Board concluded that it was not unethical for the engineer to fail to follow the most recent design parameters for structural design in severe weather areas published in the most recent technical literature, because those recently proposed design parameters had not yet become standards. In BER Case 02-5, the engineer was considered competent in all other respects, it was just that the engineer was not familiar with the recently proposed design parameters. In the present case, the question is whether Engineer B is competent.\n\nIn BER Case 98-8, a professional engineer in civil engineering was asked to certify certain arms storage rooms and racks for the Army. This engineer had no significant training or knowledge in that area, although the engineer was considered a qualified engineer. The Board concluded that, because the engineer lacked competence in the specific area, it would not be ethical for the engineer to certify the arms storage rooms and arms storage racks. That case is analogous to the present case. In both instances, while competent in some areas, the engineer in question may not have been competent in the specific areas of practice in question, in which case, the engineer acted unethically.\n\nBER Case 94-8 provided an extreme example of incompetence. In that case, a professional engineer with a degree and background in chemical engineering was asked to provide a foundation design for an industrial facility. The Board determined that it would be unethical for the engineer to perform the design of the structural footings as part of the facility.\n\nThe Code of Ethics provides guidance when evaluating competence. II.2.a. states that “Engineers shall undertake assignments only when qualified by education or experience in the specific technical fields involved.” However, does education or experience alone provide one with competence? Education provides scientific and technical knowledge which are a necessary foundation for professional competence, but it is also the experiences of working within the technical fields that build competence.\n\nII.2.a., alone does not settle the ethical questions of this case since it allows for the undertaking of assignments when engineers are qualified by education “or” experience.  II.2.b. indicates further that Engineers shall not affix their signatures to any plans or documents dealing with subject matter in which they lack competence. In this case, it is clear that Engineer B, as a water and wastewater engineer without identified significant roadway design skills, did not possess the competence to perform the rural highway design services. The problems that occurred during construction would have been avoided if the design met standards.\n\nFinally, I.6 indicates that engineers shall conduct themselves in a way so to enhance the honor, reputation, and usefulness of the profession. Engineer B did not meet this standard when bidding and accepting a contract involving work for which the firm did not have adequate competence.\n\nI.2.\n\nPerform services only in areas of their competence.\n\nI.6.\n\nConduct themselves honorably, responsibly, ethically, and lawfully so as to enhance the honor, reputation, and usefulness of the profession.\n\nII.1.b.\n\nEngineers shall approve only those engineering documents that are in conformity with applicable standards.\n\nII.2.\n\nEngineers shall perform services only in the areas of their competence.\n\nII.5.a.\n\nEngineers shall not falsify their qualifications or permit misrepresentation of their or their associates' qualifications. They shall not misrepresent or exaggerate their responsibility in or for the subject matter of prior assignments. Brochures or other presentations incident to the solicitation of employment shall not misrepresent pertinent facts concerning employers, employees, associates, joint venturers, or past accomplishments.\n\nIt was unethical for Engineer B to accept the rural roadway design contract under these circumstances.\n\nThis case addresses the ethical obligation to practice within one’s area of competence. This obligation is critically important in engineering practice, requiring engineers to know what they know and know what they don’t know. It requires diligence to differentiate between what they know and can do competently and what is beyond their capabilities. However, most engineers, after an engineering education and initial experience, don’t do the same type of design projects, in the same way, year after year until it’s time to retire. For most, it is a career-long progression of stretching one’s capabilities with different types of projects, very similar or not, learning and applying new technologies and practices, and, in some cases, solving engineering problems by going back to first principles of mathematics and science. That type of career evolution is what we are educated to do, what our long term career development progressively teaches us, and what makes most engineering careers fascinating. So, the challenge is to appropriately stretch our capabilities, while ensuring appropriate protection of public health, safety and welfare.\n\nCase 23-1 presents a “water and wastewater engineer” offering to perform design services for a rural roadway design project. The facts presented are sparse, as is common in these cases. Many or most “water and wastewater engineers” regularly design urban roadway reconstruction on utility projects, and historically many have baccalaureate degrees in civil engineering. Rural roadway design presents similar engineering issues compared to urban utility/roadway projects, although some design details vary and specification formats (i.e. DOT specifications) and methods of measurement and payment are often different. In this case, the engineer may have decided to undertake the project for the wrong reasons, perhaps solely because workload was slow, and the county may have made a poor decision in not seeking additional design firms from a wider geographical area. But does this rise to unethical behavior based on the facts presented?  Had the facts of the case indicated more information on the qualifications of the water and wastewater engineer, perhaps one who was solely experienced in water and wastewater treatment design, or if the construction project had experienced problems with constructability or avoidable change orders due to design inexperience that increased project cost, then a conclusion that this was unethical behavior would be warranted.   However, in this case, design and construction issues appear to have been successfully resolved in the field without impact.\n\nWith the case as presented, the reader might interpret that the case is concluding that it is unethical for an engineer experienced in urban utility projects to design rural roadway reconstruction.  Such a narrow interpretation would have a chilling effect on the development of engineering careers if “staying in one’s lane” were commonly interpreted so narrowly. In the view of this dissenting opinion and on the basis of the limited facts presented, this was not, on the face of it, unethical behavior.",
    "url": "https://www.nspe.org/career-resources/ethics/competence-design-services",
    "pdf_url": null,
    "scraped_at": "2025-04-05T17:10:50.144682",
    "metadata": {
      "related_cases": [
        "Case 98-8",
        "Case 02-5",
        "Case 23-1",
        "Case 94-8"
      ],
      "codes_cited": [
        "Code II.2",
        "Code I.2",
        "Code I.6",
        "Code II.1.b",
        "Code II.2.a",
        "Code II.2.b",
        "Code II.5.a"
      ],
      "principles": [
        "public safety",
        "safety",
        "welfare",
        "health",
        "public health",
        "competency"
      ],
      "outcome": "unethical",
      "operationalization_techniques": [
        "Principle Instantiation",
        "Case Instantiation",
        "Conflicting Principles Resolution"
      ],
      "board_analysis": "hat they know and know what they don’t know. It requires diligence to differentiate between what they know and can do competently and what is beyond their capabilities. However, most engineers, after an engineering education and initial experience, don’t do the same type of design projects, in the same way, year after year until it’s time to retire. For most, it is a career-long progression of stretching one’s capabilities with different types of projects, very similar or not, learning and applying new technologies and practices, and, in some cases, solving engineering problems by going back to first principles of mathematics and science. That type of career evolution is what we are educated to do, what our long term career development progressively teaches us, and what makes most engineering careers fascinating. So, the challenge is to appropriately stretch our capabilities, while ensuring appropriate protection of public health, safety and welfare.\n\nCase 23-1 presents a “water and wa\n[content truncated]",
      "ethical_questions": [
        "Was it ethical for Engineer B to accept the rural roadway design contract under these circumstances?",
        "But does this rise to unethical behavior based on the facts presented?"
      ]
    }
  },
  {
    "case_number": "Case 95-5",
    "title": "II.3.",
    "year": 1995,
    "date": "April 05, 2025",
    "full_text": "Engineer A provides construction services in the community of City B and is a licensed professional engineer in State C where City B is located. City B is a large metropolitan area and all forms of contracting are available. Engineer A currently has no contractual relationship with City B. City B’s City Administrator asked Engineer A for a recommendation on project delivery methods for their upcoming wastewater system improvements project using a specific funding source. City Administrator is not a licensed professional engineer.\n\nUnder the proposed funding source, there are four approved project delivery methods: Design-Bid-Build, Construction-Management-at-Risk, Fixed-Price-Design-Build, and Progressive-Design-Build. Additionally, if Construction Manager at Risk is selected by the owner, City B, the funding agency requires the Construction Manager at Risk firm and the Engineer of Record be two distinct entities.\n\nEngineer A is qualified to provide construction services under Progressive-Design-Build and Construc\u0002tion-Manager-at-Risk delivery methods Engineer A prepared a summary memo to City B Administrator and only identified Design-Bid-Build and Progressive-Design-Build as viable project delivery options.\n\nEngineer A recommended Progressive Design Build. Accompanying the recommendation, Engineer A provided a summary of the firm’s experience with Progressive-Design-Build projects and references from past projects\n\nWas it ethical for Engineer A to provide a recommendation on project delivery methods that only included two of the possible methods, without providing the complete analysis and the reasoning behind recommending the two selected methods over others?\n\n\t\tWas it ethical for Engineer A to recommend the method for which they could provide services?\n\n\t\tWas it ethical for Engineer A to include project summaries and references to encourage selection of their firm for the recommended method for project delivery?\n\nWas it ethical for Engineer A to provide a recommendation on project delivery methods that only included two of the possible methods, without providing the complete analysis and the reasoning behind recommending the two selected methods over others?\n\nWas it ethical for Engineer A to recommend the method for which they could provide services?\n\nWas it ethical for Engineer A to include project summaries and references to encourage selection of their firm for the recommended method for project delivery?\n\nBy their very words, the cited sections of the NSPE Code of Ethics provide appropriate guidance: “objective and truthful,” “include all relevant and pertinent information,” “not offer any gift or other valuable consideration in order to secure work.”\n\nBER Case 95-5 addressed integrity and completeness in preparing reports. The engineer in question rendered an opinion that, based upon test pile, the project’s installed piles did not meet the design safety factor. However, the engineer failed to include in the report that the initial log indicated that several of the piles were driven to essential refusal (intentional disregard of other information); that the test equipment had failed (selective use of information); that the test piles were not driven to the same depth as the installed piles, that a different installation technique was used, that following cure, the test hammer was dropped several times before the count began (all failure to investigate), or that the predicted increase in strength after cure was confirmed. (In that case, the engineer in question also engaged in misrepresentation and potential perjury, but that’s not at issue in the present case.)\n\nBER Case 99-8 was relatively analogous. Engineer A bid and won a design contract to provide a complete set of plans and specifications. However, Engineer A submitted plans that were lacking much of the design detail in both drawings and specifications. Not only did Engineer A acknowledge that fact, but even acknowledged that certain parts of the project were arguably unbuildable. Furthermore, Engineer A did not inform anyone as to the incompleteness at the time of submission. Engineer A had a clear obligation to provide a complete set of design drawings and specifications on the project in which Engineer A was engaged, and the incomplete submission was clearly unethical. (In that case, the engineer in question also expressed an intent to defraud, but that’s not at issue in the present case.)\n\nIn the present case, City Administrator solicited services from Engineer A. It is not clear whether City Administrator knowingly solicited a donation of services. Engineer A had several options. Engineer A could have referred City Administrator to resources (whether library, free, or subscription) that provided complete analyses of the various methodologies. That would be a completely ethical informal response to an informal solicitation, involving no provision of engineering services. Alternatively, Engineer A could have provided a complete analysis of the four methodologies, with all the pros and cons by compiling properly referenced resources from others, involving no provision of engineering services and thus not unethical. However, by providing only a partial, comparative engineering evaluation with no analysis and a recommendation to Engineer A’s benefit, the conduct constituted both incomplete and self-serving information (as in 95-5 and 99-8) and the extension of free services. Both aspects of the conduct were unethical in the view of the BER.\n\nII.3.\n\nEngineers shall issue public statements only in an objective and truthful manner.\n\nII.3.a.\n\nEngineers shall be objective and truthful in professional reports, statements, or testimony. They shall include all relevant and pertinent information in such reports, statements, or testimony, which should bear the date indicating when it was current.\n\nII.5.b.\n\nEngineers shall not offer, give, solicit, or receive, either directly or indirectly, any contribution to influence the award of a contract by public authority, or which may be reasonably construed by the public as having the effect or intent of influencing the awarding of a contract. They shall not offer any gift or other valuable consideration in order to secure work. They shall not pay a commission, percentage, or brokerage fee in order to secure work, except to a bona fide employee or bona fide established commercial or marketing agencies retained by them.\n\nIt was unethical for Engineer A to leave out relevant and pertinent information from the analysis/ recommendation. Engineer A should have included evaluation of all available delivery methods rather than including only two, including one that A’s firm could provide. Engineer A could also have referred City Administrator to 3rd-party resources.\n\n\t\tIt was ethical for Engineer A to recommend progressive design build is the best choice, as long as reasons are objective, described, valid, and compared against all available and appropriate delivery methods. Unfortunately, Engineer A did not provide objective support for the recommendation. Consequently, Engineer A’s conduct was unethical.\n\n\t\tIt was not unethical to include marketing materials that display Engineer A’s firm’s qualifications.\n\nIt was unethical for Engineer A to leave out relevant and pertinent information from the analysis/ recommendation. Engineer A should have included evaluation of all available delivery methods rather than including only two, including one that A’s firm could provide. Engineer A could also have referred City Administrator to 3rd-party resources.\n\nIt was ethical for Engineer A to recommend progressive design build is the best choice, as long as reasons are objective, described, valid, and compared against all available and appropriate delivery methods. Unfortunately, Engineer A did not provide objective support for the recommendation. Consequently, Engineer A’s conduct was unethical.\n\nIt was not unethical to include marketing materials that display Engineer A’s firm’s qualifications.",
    "url": "https://www.nspe.org/career-resources/ethics/providing-incomplete-self-serving-advice",
    "pdf_url": null,
    "scraped_at": "2025-04-05T17:10:51.898765",
    "metadata": {
      "related_cases": [
        "Case 99-8",
        "Case 95-5"
      ],
      "codes_cited": [
        "Code II.5.b",
        "Code II.3",
        "Code II.3.a"
      ],
      "principles": [
        "objectivity",
        "public safety",
        "safety",
        "honesty",
        "welfare",
        "competency"
      ],
      "outcome": "unethical",
      "operationalization_techniques": [
        "Principle Instantiation",
        "Case Instantiation",
        "Conflicting Principles Resolution"
      ],
      "board_analysis": "shall be objective and truthful in professional reports, statements, or testimony. They shall include all relevant and pertinent information in such reports, statements, or testimony, which should bear the date indicating when it was current.\n\nII.5.b.\n\nEngineers shall not offer, give, solicit, or receive, either directly or indirectly, any contribution to influence the award of a contract by public authority, or which may be reasonably construed by the public as having the effect or intent of influencing the awarding of a contract. They shall not offer any gift or other valuable consideration in order to secure work. They shall not pay a commission, percentage, or brokerage fee in order to secure work, except to a bona fide employee or bona fide established commercial or marketing agencies retained by them.\n\nIt was unethical for Engineer A to leave out relevant and pertinent information from the analysis/ recommendation. Engineer A should have included evaluation of all available deliv\n[content truncated]",
      "ethical_questions": [
        "Accompanying the recommendation, Engineer A provided a summary of the firm’s experience with Progressive-Design-Build projects and references from past projects\n\nWas it ethical for Engineer A to provide a recommendation on project delivery methods that only included two of the possible methods, without providing the complete analysis and the reasoning behind recommending the two selected methods over others?",
        "Was it ethical for Engineer A to recommend the method for which they could provide services?",
        "Was it ethical for Engineer A to include project summaries and references to encourage selection of their firm for the recommended method for project delivery?",
        "Was it ethical for Engineer A to provide a recommendation on project delivery methods that only included two of the possible methods, without providing the complete analysis and the reasoning behind recommending the two selected methods over others?",
        "Was it ethical for Engineer A to recommend the method for which they could provide services?",
        "Was it ethical for Engineer A to include project summaries and references to encourage selection of their firm for the recommended method for project delivery?"
      ]
    }
  },
  {
    "case_number": "Case 18-10",
    "title": "I.1.",
    "year": 2018,
    "date": "April 05, 2025",
    "full_text": "wner is developing a site with two mirror-image towers to be built two years apart. As the first tower is built, several significant design errors are discovered in the plans and design of Engineer A. Owner decides to obtain a peer review of the plans and design of Engineer A for the second tower and retains Engineer B. Owner instructs Engineer B to conduct the peer review without letting Engineer A know. Engineer B objects to conducting the peer review without advising Engineer A. When Owner reluctantly consents to notifying Engineer A, Engineer A objects and refused to consent to the peer review.\n\nIs Engineer B ethically required to make certain that Engineer A is advised of the planned peer review?\n\n\t\tIs Engineer A ethically required to cooperate with the peer review of Engineer B?\n\nIs Engineer B ethically required to make certain that Engineer A is advised of the planned peer review?\n\nIs Engineer A ethically required to cooperate with the peer review of Engineer B?\n\nPeer review issues are arising with increasing frequency. In many cases, the possibility that the client will obtain a peer review is specified in design-build bid or contract documents to the effect that any party who bids or contracts with the client has, by participating, consented to the peer review. Frequently that disclosure is accompanied by an agreement that the client will require the peer reviewer to keep the results of the peer review confidential or, at the very least, the original designer will be provided with an opportunity to explain (and defend) the design decisions. Such confidentiality agreements encourage the firm being reviewed to cooperate fully, build trust, and support a collegial atmosphere. However, that is not always the case and it is not the case here.\n\nIt is helpful to consider how the BER has addressed peer review issues in the past. For example, in BER Case 18-10, Engineer A was the lead engineer on an independent external review of an agency-prepared project. The review’s scope was limited to clarifications and refinements, and there was no confidentiality agreement. (Of course, as a public project, there would not be.) About a year later, Engineer A’s firm is invited to be part of a joint venture responding to a design-build RFP for the project. In BER Case 18-10, the Board concluded that, so long as the agency approves and the work complies with applicable state laws and regulations regarding conflicts of interest, it would not be unethical for Engineer A’s firm to participate in a de\u0002sign-build joint venture submitting a proposal for the project.\n\nIn BER Case 96-8, Engineer A was a peer reviewer serving as part of an organized peer-review program. When selected as a reviewer for the program, Engineer A contractually agreed not to disclose confidential information acquired in the review. Engineer A was assigned to review the design work of Engineer B’s firm on several projects. In the course of the review, Engineer A determined that Engineer B’s work may be in violation of state and local safety code requirements, placing the public health, safety, and welfare at risk. The BER concluded that Engineer A had an obligation to immediately discuss these issues with Engineer B in order to seek clarification and resolution. That could range from a joint determination that there no violation of code requirements, that the violations were de minimis and did not threaten public health, safety, and welfare, or that there were violations and that the violations did threaten public, health, safety, and welfare but that Engineer B refused to make adjustments. And, if Engineers A and B were unable to successfully resolve Engineer A’s concerns, Engineer A had an obligation to first advise Engineer B that Engineer A had an obligation to inform the appropriate authorities, and then to so inform the appropriate authorities.\n\nIn the present case, Professional Obligation III.7.a. is very clear: “Engineers in private practice shall not review the work of another engineer for the same client, except with the knowledge of such engineer, or unless the connection of such engineer with the work has been terminated.” Accordingly, Engineer B was completely correct in declining an assignment to conduct a peer review of Engineer A’s work subject to an instruction not to disclose the peer review to Engineer A. Owner reluctantly agreed to advise Engineer A of the planned peer review. [93-3 discussed a situation in which the Owner refused to advise the engineer of the planned peer review.] While Professional Obligation III.7.a. does not require the consent of the engineer whose work is being reviewed, it will likely be a fruitless exercise to attempt to conduct a peer review without Engineer A’s cooperation.) If Engineer A refused to consent and cooperate, Owner would be then face with three options: to move forward with the peer review conducted under difficult and limiting circumstances, to move forward without the peer review . . . or to move forward without Engineer A.\n\nUnder the facts, the Board concludes that it would be unethical for Engineer A to fail to cooperate. Engineers must take responsibility for their actions, must acknowledge their errors, must act in the best interests of their clients, and must at all times hold paramount the health, welfare, and safety of the public. Each of those requirements strongly indicates that Engineer A should participate fully and cooperatively in Engineer B’s peer review. The known design defects in the first tower simply makes each of those requirements more urgent.\n\nI.1.\n\nHold paramount the safety, health, and welfare of the public.\n\nI.4.\n\nAct for each employer or client as faithful agents or trustees.\n\nI.6.\n\nConduct themselves honorably, responsibly, ethically, and lawfully so as to enhance the honor, reputation, and usefulness of the profession.\n\nII.1.c.\n\nEngineers shall not reveal facts, data, or information without the prior consent of the client or employer except as authorized or required by law or this Code.\n\nIII.1.a.\n\nEngineers shall acknowledge their errors and shall not distort or alter the facts.\n\nIII.1.f.\n\nEngineers shall treat all persons with dignity, respect, fairness and without discrimination.\n\nIII.4.\n\nEngineers shall not disclose, without consent, confidential information concerning the business affairs or technical processes of any present or former client or employer, or public body on which they serve.\n\nIII.7.a.\n\nEngineers in private practice shall not review the work of another engineer for the same client, except with the knowledge of such engineer, or unless the connection of such engineer with the work has been terminated.\n\nEngineer B is ethically required to make certain that Engineer A is advised of the planned peer review. It is not necessary for Engineer B to provide that notice personally, but Engineer B must know either that Engineer A has been advised or that Engineer A has been terminated from the project.\n\n\t\tOwner and Engineer B are not required to obtain Engineer A’s consent to the peer review, merely to assure that Engineer A has been informed of the peer review. Especially in the face of known design defects in the first tower, Engineer A may not ethically object to the peer review.\n\nEngineer B is ethically required to make certain that Engineer A is advised of the planned peer review. It is not necessary for Engineer B to provide that notice personally, but Engineer B must know either that Engineer A has been advised or that Engineer A has been terminated from the project.\n\nOwner and Engineer B are not required to obtain Engineer A’s consent to the peer review, merely to assure that Engineer A has been informed of the peer review. Especially in the face of known design defects in the first tower, Engineer A may not ethically object to the peer review.",
    "url": "https://www.nspe.org/career-resources/ethics/independence-peer-reviewer",
    "pdf_url": null,
    "scraped_at": "2025-04-05T17:10:53.674678",
    "metadata": {
      "related_cases": [
        "Case 96-8",
        "Case 18-10"
      ],
      "codes_cited": [
        "Code I.6",
        "Code III.1.f",
        "Code III.1.a",
        "Code I.1",
        "Code II.1.c",
        "Code I.4",
        "Code III.4",
        "Code III.7.a"
      ],
      "principles": [
        "public safety",
        "safety",
        "welfare",
        "confidentiality",
        "professional responsibility",
        "health",
        "public health",
        "disclosure"
      ],
      "outcome": "unethical",
      "operationalization_techniques": [
        "Principle Instantiation",
        "Case Instantiation",
        "Conflicting Principles Resolution"
      ],
      "board_analysis": "n design defects in the first tower simply makes each of those requirements more urgent.\n\nI.1.\n\nHold paramount the safety, health, and welfare of the public.\n\nI.4.\n\nAct for each employer or client as faithful agents or trustees.\n\nI.6.\n\nConduct themselves honorably, responsibly, ethically, and lawfully so as to enhance the honor, reputation, and usefulness of the profession.\n\nII.1.c.\n\nEngineers shall not reveal facts, data, or information without the prior consent of the client or employer except as authorized or required by law or this Code.\n\nIII.1.a.\n\nEngineers shall acknowledge their errors and shall not distort or alter the facts.\n\nIII.1.f.\n\nEngineers shall treat all persons with dignity, respect, fairness and without discrimination.\n\nIII.4.\n\nEngineers shall not disclose, without consent, confidential information concerning the business affairs or technical processes of any present or former client or employer, or public body on which they serve.\n\nIII.7.a.\n\nEngineers in private prac\n[content truncated]",
      "ethical_questions": [
        "Is Engineer B ethically required to make certain that Engineer A is advised of the planned peer review?",
        "Is Engineer A ethically required to cooperate with the peer review of Engineer B?",
        "Is Engineer B ethically required to make certain that Engineer A is advised of the planned peer review?",
        "Is Engineer A ethically required to cooperate with the peer review of Engineer B?"
      ]
    }
  },
  {
    "case_number": "Case 15-2",
    "title": "I.1.",
    "year": 2015,
    "date": "April 05, 2025",
    "full_text": "Test case Summary\n\nEngineer A owns a consulting engineering firm specializing in civil engineering and surveying services associated with land development. Business has been very successful, so much so that Engineer A has taken steps to expand the business. Among other things, Engineer A purchased land for a new office building, he retained an architect, and he retained Engineer B, his friend and a structural engineer consultant, to perform the structural design.\n\nConstruction drawings were completed, permits were issued, a contract was let, and the contractor began construction of the new office building – which included a basement. However, early during the process of constructing the basement there was a significant structural failure. While observing the failed system, Engineer A noticed what he believed was “odd” structural bracing and other questionable structural details. To obtain a second opinion about the failure, Engineer A retained a well-respected structural engineer, Engineer R, to perform an independent review of the structural drawings and the failed basement structure.\n\nEngineer R’s review revealed a surprising number of serious structural design errors, omissions, and faulty details, not only for the failed basement, but also for the portions of the structure that had not been built yet. Engineer A retained Engineer R to completely redesign the structure.\n\nAs a professional courtesy, and because he considered Engineer B a personal friend, Engineer A met privately with Engineer B and confronted him with the faulty design, including Engineer R’s report. At this meeting, Engineer B divulged he had suffered a stroke a few months prior. Being the only licensed professional engineer in his firm, for financial and other reasons, Engineer B felt he could not afford to suspend work or close his office. Rather, Engineer B’s wife took over management of the business, and Engineer B delegated practically all design work to Engineer Intern C, a graduate engineer employee with about two years’ experience. The way they operated was, Engineer Intern C (who was fully aware of Engineer B’s impaired condition) would perform the structural design and develop the construction drawings, and Engineer B would sign and seal the drawings with little to no review. Ultimately, this process led to the failure of Engineer A’s building.\n\nBecause of their long friendship and consideration of Engineer B’s impairment, Engineer A did not report Engineer B to the State Board.\n\nWas it ethical for Engineer A to not report Engineer B?\nWere Engineer B’s actions ethical?\nWere Engineer Intern C’s actions ethical?\nWhat are Engineer A’s further ethical obligations under these circumstances?\nWhat are Engineer R’s ethical obligations?\n\nWas it ethical for Engineer A to not report Engineer B?\n\nWere Engineer B’s actions ethical?\n\nWere Engineer Intern C’s actions ethical?\n\nWhat are Engineer A’s further ethical obligations under these circumstances?\n\nWhat are Engineer R’s ethical obligations?\n\nThe primary issues of this case are the competency and professional actions of Engineer B, Engineer Intern C’s apparent complicity in the matter, the “compassion” of Engineer A and any subsequent actions by Engineer A, and the ethical obligations of Engineer R. The critical assessment of Engineer B’s competency and professional actions is overriding and will lead to other required determinations. The evaluation of this issue can be determined by separate facts.\n\nThe facts are that Engineer B suffered a stroke and was unable to adequately direct and review engineering designs and drawings being prepared under his signature and seal. While suffering a stroke by itself was not an ethical problem, the fact that Engineer B chose to sign and seal design drawings without proper review while impaired by this stroke was a problem. The BER has not previously examined competence as it relates to mental health; however, the facts in this case make the determination of [non]competence straightforward. Engineer B violated Section II. 2. of the code because he affixed his signature and seal to documents prepared without his direction or control. This also shows Engineer B was practicing in violation of the state licensure law (Section III.8.a).\n\nThe Board further notes that Engineer B’s actions were in violation of NSPE’s Position Statement No. 10-1778: Responsible Charge which states: “The professional engineer in Responsible Charge is actively engaged in the engineering process, from conception to completion. Engineering decisions must be personally made by the professional engineer or by others over which the professional engineer provides supervisory direction and control authority. Reviewing drawings or documents after preparation without involvement in the design and development process does not satisfy the definition of Responsible Charge.”\n\nThe actions of Engineer Intern C should be evaluated as well. Granted, Engineer Intern C is not yet a licensed professional engineer but an intern, and thus is working within the safety net of Engineer B’s guidance and direct supervision. While this might keep Engineer Intern C from legal censure per the State Engineering Practice Act, it does not absolve Engineer Intern C of ethical responsibility. The facts suggest Engineer Intern C, a subordinate of Engineer B, was fully aware of Engineer B’s impaired condition. Further, it appears Engineer Intern C cooperated with Engineer B in their arrangement to continue to deliver engineering design services as soon as it was realized Engineer B was unable to provide guidance, direct supervision or review. A similar ethical violation is discussed in BER Case 15-2, in which an engineering report was revised after the report was signed and sealed inappropriately. The BER determined that the Engineer had an obligation to seek an immediate correction by contacting appropriate authorities, including the state engineering licensure board and other enforcement officials as appropriate. In summary, Engineer Intern C is ethically culpable through violation of Section II.1.e, Section II.1.f, and Section III.8.a of the Code of Ethics.\n\nWhat about Engineer A’s actions? Reference is made to Section I.1 of the Code, engineers shall hold para\u0002mount the safety, health, and welfare of the public and, more specifically, Section II.1.e, engineers shall not aid or abet the unlawful practice of engineering by a person or firm and Section II.1.f, engineers having knowledge of any alleged violation of this Code shall report thereon to appropriate professional bodies and, when relevant, also to public authorities, and cooperate with the proper authorities in furnishing such information or assistance as may be required. The BER has almost always taken the position that whenever any violation of the Code or issues of public health, safety, and welfare are uncovered, the proper authorities should be notified. In BER Case 17-7, the BER determined that an Engineer had an obligation to further report the situation to the appropriate the local, state, and/or federal authorities to ensure that relevant engineering standards were consistent with the public health, safety, and welfare. This was a case where a proposed change to an ordinance was contrary to established engineering standards.\n\nEven though Engineer A was a friend of Engineer B, their friendship was not an ethical justification for Engineer A to ignore or conceal Engineer B’s violations. Code Section III.7, engineers who believe others are guilty of unethical or illegal practice shall present such information to the proper authority for action, unambiguously requires that such violations be reported to the appropriate professional body, in this case the State Board. This determination is also strengthened by Section III.8.a, engineers shall conform with state licensure law.\n\nThat being said, the friendship between Engineer A and Engineer B warrants consideration. Hypothetically, what might an engineer do that would have been both ethical and would also have respected the friendship? Section III.7 of the Code says engineers “shall not attempt to injure, maliciously or falsely, directly or indirectly, the professional reputation, prospects, practice, or employment of other engineers.” By this view and with Engineer B’s knowledge and approval, Engineer A could have privately discussed the matter with proper authorities at the State Board. Working together, the parties might cooperatively identify a practice alternative consistent with ethical and legal engineering consulting work, say, hiring a qualified temporary engineer – possibly Engineer R – until Engineer B was able to return to full duty. Further, under such a scenario, the Board might exercise discretion relative to formal sanction (or not) of Engineer B. Other approaches are also possible. But any of them must begin with the conviction that the ethics code does not permit engineers to turn a blind eye to the unethical practice of engineering.\n\nFinally, what are Engineer R’s ethical obligations? The facts reveal it was Engineer R who technically uncovered the incompetent nature of Engineer B’s design and construction documents. Further, in the aftermath of Engineer R’s discovery, it is reasonable to think Engineer R was informed of Engineer B’s impairment due to a stroke, and also the series of actions by Engineer B and Engineer Intern C that followed. Since Engineer A was the person who got Engineer R involved in the first place, if Engineer A took the lead in reporting the matter, the report could be styled to note Engineer R’s concurrence. Otherwise, Engineer R would be obligated to report Engineer B to the State Board (Section II.1.f).\n\nI.1.\n\nHold paramount the safety, health, and welfare of the public.\n\nII.1.e.\n\nEngineers shall not aid or abet the unlawful practice of engineering by a person or firm.\n\nII.1.f.\n\nEngineers having knowledge of any alleged violation of this Code shall report thereon to appropriate professional bodies and, when relevant, also to public authorities, and cooperate with the proper authorities in furnishing such information or assistance as may be required.\n\nII.2.\n\nEngineers shall perform services only in the areas of their competence.\n\nII.2.b.\n\nEngineers shall not affix their signatures to any plans or documents dealing with subject matter in which they lack competence, nor to any plan or document not prepared under their direction and control.\n\nIII.7.\n\nEngineers shall not attempt to injure, maliciously or falsely, directly or indirectly, the professional reputation, prospects, practice, or employment of other engineers. Engineers who believe others are guilty of unethical or illegal practice shall present such information to the proper authority for action.\n\nIII.8.a.\n\nEngineers shall conform with state registration laws in the practice of engineering.\n\nIt was unethical for Engineer A to not report Engineer B, in spite of the fact that Engineer A and Engineer B were friends.\nIt was unethical for Engineer B to continue work in an impaired state in which he could not competently perform engineering design, could not guide and direct his subordinates, or properly review their designs or drawings.\nEngineer Intern C’s complicity in helping Engineer B to continue work was unethical.\nEngineer A was obligated to report Engineer B to the proper authority, in this case the State Board. As Engineer B’s friend and with Engineer B’s approval, once the matter was reported to the Board, it would have been permissible for Engineer A to help cooperatively identify a temporary practice management alternative that supported the professional and ethical practice of engineering work in Engineer B’s business, until Engineer B returned to full duty.\nGiven his direct knowledge of the situation, Engineer R, like Engineer A, was obligated to report Engineer B to the proper authority, in this case the State Board. If Engineer A did the reporting as noted above, Engineer A’s report could be styled to indicate Engineer R’s concurrence.\n\nIt was unethical for Engineer A to not report Engineer B, in spite of the fact that Engineer A and Engineer B were friends.\n\nIt was unethical for Engineer B to continue work in an impaired state in which he could not competently perform engineering design, could not guide and direct his subordinates, or properly review their designs or drawings.\n\nEngineer Intern C’s complicity in helping Engineer B to continue work was unethical.\n\nEngineer A was obligated to report Engineer B to the proper authority, in this case the State Board. As Engineer B’s friend and with Engineer B’s approval, once the matter was reported to the Board, it would have been permissible for Engineer A to help cooperatively identify a temporary practice management alternative that supported the professional and ethical practice of engineering work in Engineer B’s business, until Engineer B returned to full duty.\n\nGiven his direct knowledge of the situation, Engineer R, like Engineer A, was obligated to report Engineer B to the proper authority, in this case the State Board. If Engineer A did the reporting as noted above, Engineer A’s report could be styled to indicate Engineer R’s concurrence.",
    "url": "https://www.nspe.org/career-resources/ethics/impaired-engineering",
    "pdf_url": null,
    "scraped_at": "2025-04-05T17:10:55.373198",
    "metadata": {
      "related_cases": [
        "Case 15-2",
        "Case 17-7"
      ],
      "codes_cited": [
        "Code III.8.a",
        "Code II.1.f",
        "Code II.1.e",
        "Code III.7",
        "Code II.2",
        "Code I.1",
        "Code II.2.b"
      ],
      "principles": [
        "public safety",
        "safety",
        "welfare",
        "professional responsibility",
        "health",
        "public health",
        "disclosure",
        "competency"
      ],
      "outcome": "unethical",
      "operationalization_techniques": [
        "Principle Instantiation",
        "Case Instantiation",
        "Conflicting Principles Resolution"
      ],
      "board_analysis": "le to think Engineer R was informed of Engineer B’s impairment due to a stroke, and also the series of actions by Engineer B and Engineer Intern C that followed. Since Engineer A was the person who got Engineer R involved in the first place, if Engineer A took the lead in reporting the matter, the report could be styled to note Engineer R’s concurrence. Otherwise, Engineer R would be obligated to report Engineer B to the State Board (Section II.1.f).\n\nI.1.\n\nHold paramount the safety, health, and welfare of the public.\n\nII.1.e.\n\nEngineers shall not aid or abet the unlawful practice of engineering by a person or firm.\n\nII.1.f.\n\nEngineers having knowledge of any alleged violation of this Code shall report thereon to appropriate professional bodies and, when relevant, also to public authorities, and cooperate with the proper authorities in furnishing such information or assistance as may be required.\n\nII.2.\n\nEngineers shall perform services only in the areas of their competence.\n\nII.2.b.\n\n\n[content truncated]",
      "ethical_questions": [
        "Was it ethical for Engineer A to not report Engineer B?",
        "Were Engineer B’s actions ethical?",
        "Were Engineer Intern C’s actions ethical?",
        "What are Engineer A’s further ethical obligations under these circumstances?",
        "What are Engineer R’s ethical obligations?",
        "Was it ethical for Engineer A to not report Engineer B?",
        "Were Engineer B’s actions ethical?",
        "Were Engineer Intern C’s actions ethical?",
        "What are Engineer A’s further ethical obligations under these circumstances?",
        "What are Engineer R’s ethical obligations?",
        "Hypothetically, what might an engineer do that would have been both ethical and would also have respected the friendship?",
        "Finally, what are Engineer R’s ethical obligations?"
      ]
    }
  },
  {
    "case_number": "Case 76-4",
    "title": "II.1.",
    "year": 1976,
    "date": "April 05, 2025",
    "full_text": "Engineer B, a resident of City M and a consulting engineer with ABC Engineers, was retained to evaluate changing the Metropolitan Water Commission’s (MWC) public water source serving City M from remote reservoirs located in another regional authority to using the local river. The purpose of the contemplated change in water source would be to reduce expenses. City M is a major client of ABC Engineers, through the MWC on water supply projects, and on other public works projects through other commissions and departments.\n\nEngineer B’s report recommended to the MWC the need for appropriate water treatment prior to making the change in water source to ensure that sufficient corrosion control is provided so that old service pipes in the MWC service area don’t leach lead in excess of drinking water standards. The report clearly outlined the risk of even short-term exposure of adults, and particularly children, to elevated lead levels if appropriate treatment was not provided concurrent with the change in water source. The MWC met and decided to proceed with the change in water source but to construct water treatment improvements at a later date. Engineer B pointed out at a public meeting with the Water Commissioners that public health and safety would be at risk. Following the meeting, Engineer B provided the Water Commissioners with a letter detailing the risk to public health and safety. Engineer B subsequently sent the original report with a letter to the water supply division of the State Department of the Environment.\n\nThe MWC discharged Engineer B and ABC Engineers from project involvement in the water source change, and retained XYZ Consultants to assist with implementation. XYZ Consultants provided a report to the Water Commission indicating that insufficient information was available to predict the severity of any potential public health and safety risk.\n\nSeveral months later, Engineer B read in the local newspaper that the professional engineer in charge of the water supply division of the State Department of the Environment had approved the change of water source, with a five-year implementation plan to provide updated water treatment. Engineer B continued to be concerned that public health and safety would be at risk and considered whether there were continuing ethical obligations, and if so, what alternative courses of action as an engineer and/or as a citizen of City M might merit consideration.\n\nEngineer B ethically obligated to take further action to protect public health, safety and welfare?\nIf Engineer B wishes to take further action to continue to correspond with the MWC or the regulatory agency regarding the public health and safety risk, or to notify the public, what are the ethical considerations in doing so?\n\nEngineer B ethically obligated to take further action to protect public health, safety and welfare?\n\nIf Engineer B wishes to take further action to continue to correspond with the MWC or the regulatory agency regarding the public health and safety risk, or to notify the public, what are the ethical considerations in doing so?\n\nThis case focuses on the engineer’s duty to hold paramount the public health, safety and welfare while also balancing how far an engineer should go in pursuing an issue involving protection of the public beyond reporting to appropriate authorities.\n\nBER Case 76-4 addressed the duty to report likely environmental damage to appropriate regulatory authorities. Engineer Doe was retained by an industry to evaluate whether a proposed change in their manufacturing process would result in meeting minimum water quality standards. Doe concluded that the change would not meet minimum standards and apprised the client of that decision. The client severed Doe’s contract and asked DOE not to write a report. Subsequently, another engineer unaware of factors that Doe had recognized, presented the view at a public hearing that the industry would meet minimum standards. The BER concluded that Doe had an obligation to report the observations to the applicable regulatory authority.\n\nIn BER Case 89-7, a structural engineer inspected a building that was about to be sold, and was apprised confidentially by the owner that, although the building was structurally sound, there were mechanical and electrical code violations that had not been addressed and that were required to be rectified prior to sale of the building and use by the public. The structural engineer was not qualified to address mechanical and electrical engineering issues, but was aware that the code violations could constitute a safety violation. The structural engineer made only brief mention of the potential mechanical and electrical violations in the project report, and did not report the potential violations to any third party. The BER concluded that the engineer had a duty to report the potential code violations to the appropriate authority.\n\nBER Case 20-4 is directly related to the current case. In Case 20-4, Engineer B, the same Engineer B identified in this current case, was a consulting engineer to the MWC. Engineer B had provided reports and testimony at public meetings to the effect that changes in water treatment were necessary prior to changing the water source in order to protect public health and safety. Despite those recommendations, the MWC decided to make the change in water source, but delay the construction of water treatment improvements. The BER concluded that Engineer B had an ethical obligation to report the risk to public health and safety to the appropriate regulatory authority, regardless of whether the MWC consented to or opposed such a report. The facts of the present case show Engineer B did report the matter to the regulatory authority; namely, the Water Commission (both verbally and in writing) and to the water supply division of the State Department of the Environment (in writing).\n\nEach of the above cases refer to what is clearly established in the NSPE Code of Ethics: there is an obligation to report public health and safety risks to “appropriate authorities”. The current case goes beyond that, posing the question as to what an engineer’s ethical obligations are if the “appropriate authority” fails to act to adequately protect public health and safety in the opinion of the engineer.\n\nTurning to the facts of the current case, Engineer B has indeed reported the health and safety risk to the client, and to the “appropriate authority”. Engineer B should carefully assess whether verbal and written reports to the Water Commission and the written report to the water supply division of the Department of the Environment were sufficiently clear so that there was no misunderstanding of the technical documentation. And Engineer B should consider whether the health and safety risk might reasonably be interpreted otherwise by another engineer. Is this a disagreement of professional opinions, or is it a misunderstanding of the facts or the technical considerations? If Engineer B has clearly communicated the public health and safety risks both to the client and the regulatory agency, the BER concludes that Engineer B has fulfilled the Code’s ethical and professional obligations since Engineer B and ABC Engineers are no longer representing the MWC.\n\nWhether Engineer B wishes to consider additional alternative courses of action on a personal basis raises other ethical considerations. In the project described in this case, such other actions might include additional communication with the MWC, with other levels of management of the Department of the Environment, communication with other political bodies beyond the MWC, or communication with the public. All of these potential actions beyond Engineer B’s professional obligations would be as a concerned citizen. In considering such actions, Engineer B would need to consider the interests of his employer, ABC Engineers. Any such steps should only be taken with full knowledge and concurrence of the employer, since Engineer B has an ethical obligation to act as a faithful agent of the employer, while recognizing that the obligation to protect public health and safety is paramount in comparison to other ethical obligations. ABC Engineers likely has a need to evaluate both the business impacts and legal liabilities of such additional steps. If Engineer B is no longer employed by ABC Engineers, those considerations may be moot and not a constraint.\n\nNothing herein should be construed as a constraint to any engineer functioning as a “Whistleblower” in an event where public health and safety is at risk. The BER concludes that clear notification of public health and safety risk to appropriate authorities satisfies an engineer’s ethical obligation, and that subsequent steps are a personal, rather than a professional choice, and should be taken in consideration of the many stakeholders affected by the matter and the engineer’s continuing ethical obligations where pertinent.\n\nII.1.\n\nEngineers shall hold paramount the safety, health, and welfare of the public.\n\nII.1.a.\n\nIf engineers' judgment is overruled under circumstances that endanger life or property, they shall notify their employer or client and such other authority as may be appropriate.\n\nII.4.\n\nEngineers shall act for each employer or client as faithful agents or trustees.\n\nClear reporting of unresolved public health and safety risks to “appropriate authorities” satisfies Engineer B’s obligation to protect public health, safety and welfare.\nAny additional steps taken beyond the notification of appropriate authorities are not an obligation of Engineer B but rather a personal choice as a citizen, and should be taken with due consideration of the multiple stakeholders in this matter and the engineer’s many ethical obligations.\n\nClear reporting of unresolved public health and safety risks to “appropriate authorities” satisfies Engineer B’s obligation to protect public health, safety and welfare.\n\nAny additional steps taken beyond the notification of appropriate authorities are not an obligation of Engineer B but rather a personal choice as a citizen, and should be taken with due consideration of the multiple stakeholders in this matter and the engineer’s many ethical obligations.",
    "url": "https://www.nspe.org/career-resources/ethics/professional-responsibility-if-appropriate-authority-fails-act",
    "pdf_url": null,
    "scraped_at": "2025-04-05T17:10:57.107056",
    "metadata": {
      "related_cases": [
        "Case 20-4",
        "Case 76-4",
        "Case 89-7"
      ],
      "codes_cited": [
        "Code II.1.a",
        "Code II.4",
        "Code II.1"
      ],
      "principles": [
        "public safety",
        "safety",
        "welfare",
        "confidentiality",
        "professional responsibility",
        "health",
        "public health",
        "whistleblowing",
        "competency"
      ],
      "outcome": "outcome not specified",
      "operationalization_techniques": [
        "Principle Instantiation",
        "Case Instantiation",
        "Conflicting Principles Resolution"
      ],
      "board_analysis": "al and professional obligations since Engineer B and ABC Engineers are no longer representing the MWC.\n\nWhether Engineer B wishes to consider additional alternative courses of action on a personal basis raises other ethical considerations. In the project described in this case, such other actions might include additional communication with the MWC, with other levels of management of the Department of the Environment, communication with other political bodies beyond the MWC, or communication with the public. All of these potential actions beyond Engineer B’s professional obligations would be as a concerned citizen. In considering such actions, Engineer B would need to consider the interests of his employer, ABC Engineers. Any such steps should only be taken with full knowledge and concurrence of the employer, since Engineer B has an ethical obligation to act as a faithful agent of the employer, while recognizing that the obligation to protect public health and safety is paramount in com\n[content truncated]",
      "ethical_questions": [
        "Engineer B ethically obligated to take further action to protect public health, safety and welfare?",
        "If Engineer B wishes to take further action to continue to correspond with the MWC or the regulatory agency regarding the public health and safety risk, or to notify the public, what are the ethical considerations in doing so?",
        "Engineer B ethically obligated to take further action to protect public health, safety and welfare?",
        "If Engineer B wishes to take further action to continue to correspond with the MWC or the regulatory agency regarding the public health and safety risk, or to notify the public, what are the ethical considerations in doing so?"
      ]
    }
  },
  {
    "case_number": "Case 93-3",
    "title": "III.6.",
    "year": 1993,
    "date": "April 05, 2025",
    "full_text": "Client A is a city which receives consulting engineering services from a selected private firm. The contract runs for 3 years. Engineer B is currently hired under these contract terms and is in the final year of the 3-year contract. The City Administrator leads the effort for the city to coordinate the work of Engineer B. The City Administrator will also be heavily involved in the effort to select the consulting firm for the next 3-year contract. The City Administrator has questioned the judgment of Engineer B on several occasions during the contract period. The City Administrator also has previous experiences with a competing firm, Engineer C. The City Administrator contacts Engineer C to question him on specific issues Engineer B has worked on for the City. Engineer C fully realizes that answering these questions in a certain perspective would be a pretext to gaining an advantage in the competition for the next 3-year contract. Engineer C answers the City Administrator’s questions on the specific issues and is critical of Engineer B’s decisions.\n\nIs Engineer C’s answering of the City Administrator’s questions and his criticism of Engineer B ethical?\n\nCompetition for engineering work by private consulting firms can be quite intense. Selection of a winning proposal may be made on razor-thin margins. Competitive edges are sought to win work over other firms. The potential benefit of stretching ethical bounds to achieve a competitive edge may seem to merit consideration.\n\nIn this case, Engineer C has criticized the work of another engineer, Engineer B. Further, Engineer C voiced this criticism while Engineer B was still under contract with Client A, and Engineer C may not have known all the circumstances under which Engineer B performed his work as Engineer C was not involved in Engineer B’s decision-making process.\n\nNSPE Code of Ethics Section III.6 states that Engineers shall not attempt to obtain employment or advancement or professional engagements by untruthfully criticizing other engineers, or by other improper or questionable methods. Engineer C could be truthful, as far as C is aware, in this conversation. However, Engineer C’s statements may not be accurate since C might not know all the circumstances. As such, Engineer C’s conversation with Client A could easily be seen as improper and questionable since, during the conversation with the City Administrator, Engineer C was not fully cognizant of Engineer B’s situation.\n\nIn BER Case 93-3, Engineer A was retained by a major franchiser to provide engineering design services for a chain of stores throughout the United States. After several years, the franchiser decided to terminate its relationship with Engineer A and provided Engineer A of notice of its intent not to renew its contract with Engineer A’s firm. In order to maintain continuity and before the contract expired, the franchiser began discussions with Engineer B and retained Engineer B to provide immediate review of design concerns. Prior to the review, franchiser specifically told Engineer B not to disclose to Engineer A, Engineer B’s relationship with franchiser. Nevertheless, Engineer B notified Engineer A of his relationship with franchiser and the preliminary results of his review. The BER in this case determined that Engineer B’s act of notifying Engineer A of his relationship with franchiser was not consistent with the Code stating that Engineer B had an obligation as “faithful agent and trustee” to not to tell Engineer A of his relationship with the client. Case 93-3 differs from the current case as Engineer C in the present case is not under contract with Client A.\n\nIn BER Case 01-1, the BER reviewed a situation where Engineer A left Firm X to start a new Firm Y. Engineer A also contacted another engineer from Firm X, Engineer C, to convince them to join Firm Y. Thereafter, Engineer A contacted clients of Firm X to convince them to contract with the new firm since the old firm would be “hard-pressed” to continue to perform services adequately without Engineers A and C. The BER found that it was not ethical for Engineer A to make such representations as these methods were questionable and improper. Section III.7 states that Engineers shall not attempt to injure, maliciously or falsely, directly or indirectly, the professional reputation, prospects, practice, or employment of other engineers. For this reason, in the present case, using the situation to Engineer C’s advantage could be perceived the same way.\n\nIn the present case, Engineer C has been put in a difficult position by Client A. Engineer C has been asked to evaluate another engineer’s work, which in turn could give Engineer C a significant advantage in securing future work. Two sections of the Code of Ethics provide guidance for Engineer C’s response: 1) Engineers shall not attempt to obtain advancement or professional engagements by untruthfully criticizing other engineers, or by other improper or questionable methods, and 2) Engineers shall not attempt to injure, maliciously or falsely, directly or indirectly, the professional practice of other engineers. Not being fully aware of the circumstances of Engineer B’s decisions could result in Engineer C giving an opinion that is not accurate, even though C feels that the opinion is truthful. Engineer C should have refrained from any criticism. While Engineer C could answer Client A’s questions in a very general sense, C should have avoided commenting on specific issues.\n\nFurther, the Code states engineers in private practice shall not review the work of another engineer for the ame client, except with the knowledge of such engineer, or unless the connection of such engineer with the work has been terminated. In the present case, Engineer B had no knowledge of Client A’s conversation with Engineer C. Additionally, Engineer B is still under contract with Client A; the contract has not been terminated.\n\nIII.6.\n\nEngineers shall not attempt to obtain employment or advancement or professional engagements by untruthfully criticizing other engineers, or by other improper or questionable methods.\n\nIII.7.\n\nEngineers shall not attempt to injure, maliciously or falsely, directly or indirectly, the professional reputation, prospects, practice, or employment of other engineers. Engineers who believe others are guilty of unethical or illegal practice shall present such information to the proper authority for action.\n\nIII.7.a.\n\nEngineers in private practice shall not review the work of another engineer for the same client, except with the knowledge of such engineer, or unless the connection of such engineer with the work has been terminated.\n\nIn answering the City Administrator’s specific questions and by criticizing the work of Engineer B, Engineer C’s action were unethical.",
    "url": "https://www.nspe.org/career-resources/ethics/review-other-engineer-s-work",
    "pdf_url": null,
    "scraped_at": "2025-04-05T17:10:58.795428",
    "metadata": {
      "related_cases": [
        "Case 93-3",
        "Case 01-1"
      ],
      "codes_cited": [
        "Code III.7",
        "Code III.7.a",
        "Code III.6"
      ],
      "principles": [
        "honesty",
        "welfare",
        "disclosure"
      ],
      "outcome": "unethical",
      "operationalization_techniques": [
        "Principle Instantiation",
        "Case Instantiation",
        "Conflicting Principles Resolution"
      ],
      "board_analysis": "thics provide guidance for Engineer C’s response: 1) Engineers shall not attempt to obtain advancement or professional engagements by untruthfully criticizing other engineers, or by other improper or questionable methods, and 2) Engineers shall not attempt to injure, maliciously or falsely, directly or indirectly, the professional practice of other engineers. Not being fully aware of the circumstances of Engineer B’s decisions could result in Engineer C giving an opinion that is not accurate, even though C feels that the opinion is truthful. Engineer C should have refrained from any criticism. While Engineer C could answer Client A’s questions in a very general sense, C should have avoided commenting on specific issues.\n\nFurther, the Code states engineers in private practice shall not review the work of another engineer for the ame client, except with the knowledge of such engineer, or unless the connection of such engineer with the work has been terminated. In the present case, Engine\n[content truncated]",
      "ethical_questions": [
        "Is Engineer C’s answering of the City Administrator’s questions and his criticism of Engineer B ethical?"
      ]
    }
  },
  {
    "case_number": "Case 82-2",
    "title": "I.4.",
    "year": 1982,
    "date": "April 05, 2025",
    "full_text": "Engineer D is a fire protection engineer in the public sector and works for a state agency. The agency advertises for bids on major building renovation projects; the bid documents made no reference to existing as-builts or drawings for the bidders’ or awarded contractor’s use. After bids are opened and contracts are awarded, the successful sprinkler contractor asks Engineer D for as-built drawings of the existing sprinkler system. D provides the drawings. Over time, sprinkler contractors who received as-built drawings from Engineer D in the past begin to ask for these documents when projects are advertised, before bids are turned in.\n\nIs it ethical for Engineer D to provide access to as-builts after projects were awarded?\nIs it ethical for Engineer D to share as-builts with sprinkler contractors who ask for information during the bidding phase?\n\nIs it ethical for Engineer D to provide access to as-builts after projects were awarded?\n\nIs it ethical for Engineer D to share as-builts with sprinkler contractors who ask for information during the bidding phase?\n\nActing as a faithful agent or trustee for a client or employer is an obligation for any engineer and is one of the fundamental canons in NSPE’s code of ethics. Engineer D’s efforts to make as-built drawings available for reference appears to be acting in the employer’s best interest. Providing more information about existing conditions should help produce a better design. When D provides as-built drawings after bid openings, is employer information being shared without consent? In addition, if information is shared selectively with contractors before bids are opened; will D’s actions influence the award of a contract?\n\nBER Case 82-2 is a useful starting point in this discussion. In that case, an engineer offers a service providing inspection of residences to prospective homeowners. For the situation in question, the engineer produced a report for their client and provided a copy to the real estate firm handling the home sale. The client complained the engineer acted unethically by providing a copy to the real estate firm and caused harm by lessening their bargaining position with the owners of the residence.\n\nCase discussion notes there was no transmission of the client’s confidential information by the engineer (presumably the real estate firm could have had the home inspected and gained the same knowledge). The BER states “we read into this case an assumption that Engineer A acted without thought or consideration of any ulterior motive; that he, as a matter of course, considered it right and proper to make his findings known to all interested parties …” The board exonerated the engineer of substantial or deliberate wrongdoing, but determined it was incorrect to not recognize the confidentiality of a client relationship. The engineer acted unethically in submitting a copy of the home inspection report to the real estate agent.\n\nBER Case 15-7 involves the ubiquitous Engineer A working for Firm X. A’s firm is retained by a municipality to design a water treatment facility. A believes the project can benefit from a discussion of constructability issues, and is tempted to begin a discussion with local Contractor B. A is concerned that potential discussions with B will provide an unfair advantage. The board advised that “rather than consulting solely with Contractor B, Engineer A could have conducted a publically (sic) advertised constructability meeting, inviting all interested contractors to provide Engineer A with the input necessary to achieve a better design and construction outcome. Such a process would avoid any appearance of favoritism toward one particular contractor, serve the client’s interests, and gain the benefit of broader input to improve the design and construction process.”\n\nThe above summary of case history focused on engineers providing or being in position to have access to information not generally available to others. BER Case 16-3 involves Engineer A who receives a submittal by a highly qualified engineering firm (Firm B) a few hours after a well-publicized deadline. In 16-3, “the Board is concerned that allowing Firm B’s submittal to be considered would open the procurement to challenge or at the very least create a climate in which non-adherence to public procurement rules and policies are tolerated. Such a situation would not reflect well on that process, the city, or the engineering profession.” The conclusion was that A should return the submittal to firm B, unopened and explain that the bid/submittal was received late.\n\nReturning to the case at hand, Engineer D seems to be acting without what was termed in case 82-2, an ulterior motive - D’s desire is to make information available to improve designs. Even so, informally sharing as-built information is troubling. Working through informal mechanisms on public projects can give the appearance of impropriety or favoritism. Engineer D can advise that as-built drawings are available, but D should direct subcontractors to request them as part of the standard project process. D should not share documents on their own initiative or without formal permission. Because as-builts are useful and can help improve designs, Engineer D should initiate a process to include as-built drawings, when available, on projects going forward. It would be unethical for D to share as-builts with selected contractors pre-bid.\n\nI.4.\n\nAct for each employer or client as faithful agents or trustees.\n\nI.6.\n\nConduct themselves honorably, responsibly, ethically, and lawfully so as to enhance the honor, reputation, and usefulness of the profession.\n\nII.1.c.\n\nEngineers shall not reveal facts, data, or information without the prior consent of the client or employer except as authorized or required by law or this Code.\n\nII.5.b.\n\nEngineers shall not offer, give, solicit, or receive, either directly or indirectly, any contribution to influence the award of a contract by public authority, or which may be reasonably construed by the public as having the effect or intent of influencing the awarding of a contract. They shall not offer any gift or other valuable consideration in order to secure work. They shall not pay a commission, percentage, or brokerage fee in order to secure work, except to a bona fide employee or bona fide established commercial or marketing agencies retained by them.\n\nIII.1.\n\nEngineers shall be guided in all their relations by the highest standards of honesty and integrity.\n\nIII.4.\n\nEngineers shall not disclose, without consent, confidential information concerning the business affairs or technical processes of any present or former client or employer, or public body on which they serve.\n\nIt is ethical for Engineer D to make it known that as-built drawings are available; but they should be readily available to contractors as part of the standard project delivery process to assure that all contractors have equal access to the information.\nIt is unethical for Engineer D to share as-built documents selectively pre-bid. D should work to make as-built documents available for all bidders as part of contract documents.\n\nIt is ethical for Engineer D to make it known that as-built drawings are available; but they should be readily available to contractors as part of the standard project delivery process to assure that all contractors have equal access to the information.\n\nIt is unethical for Engineer D to share as-built documents selectively pre-bid. D should work to make as-built documents available for all bidders as part of contract documents.",
    "url": "https://www.nspe.org/career-resources/ethics/sharing-built-drawings",
    "pdf_url": null,
    "scraped_at": "2025-04-05T17:11:00.526245",
    "metadata": {
      "related_cases": [
        "Case 16-3",
        "Case 82-2",
        "Case 15-7"
      ],
      "codes_cited": [
        "Code I.6",
        "Code II.5.b",
        "Code II.1.c",
        "Code I.4",
        "Code III.1",
        "Code III.4"
      ],
      "principles": [
        "honesty",
        "welfare",
        "confidentiality",
        "disclosure",
        "competency"
      ],
      "outcome": "unethical",
      "operationalization_techniques": [
        "Principle Instantiation",
        "Case Instantiation",
        "Conflicting Principles Resolution"
      ],
      "board_analysis": "ailable, on projects going forward. It would be unethical for D to share as-builts with selected contractors pre-bid.\n\nI.4.\n\nAct for each employer or client as faithful agents or trustees.\n\nI.6.\n\nConduct themselves honorably, responsibly, ethically, and lawfully so as to enhance the honor, reputation, and usefulness of the profession.\n\nII.1.c.\n\nEngineers shall not reveal facts, data, or information without the prior consent of the client or employer except as authorized or required by law or this Code.\n\nII.5.b.\n\nEngineers shall not offer, give, solicit, or receive, either directly or indirectly, any contribution to influence the award of a contract by public authority, or which may be reasonably construed by the public as having the effect or intent of influencing the awarding of a contract. They shall not offer any gift or other valuable consideration in order to secure work. They shall not pay a commission, percentage, or brokerage fee in order to secure work, except to a bona fide e\n[content truncated]",
      "ethical_questions": [
        "Is it ethical for Engineer D to provide access to as-builts after projects were awarded?",
        "Is it ethical for Engineer D to share as-builts with sprinkler contractors who ask for information during the bidding phase?",
        "Is it ethical for Engineer D to provide access to as-builts after projects were awarded?",
        "Is it ethical for Engineer D to share as-builts with sprinkler contractors who ask for information during the bidding phase?"
      ]
    }
  },
  {
    "case_number": "Case 92-2",
    "title": "Preamble",
    "year": 1992,
    "date": "April 05, 2025",
    "full_text": "Engineer A, a consulting engineer, presents signed and sealed design contract documents to the State Agency manager, “Transportation Engineer” B, who personally reviews those documents for final approval, makes comments, and directs changes – all of which under the laws of the state constitutes the practice of engineering. Engineer A learns that “Transportation Engineer” B is neither a licensed engineer nor even a degreed engineer. Engineer A is concerned that the State Agency has given staff in management positions the title of “Engineer” when they are not qualified to review and approve consulting engineers’ design documents.\n\nIs it ethical for “Transportation Engineer” B to engage in the practice of engineering when “Trans\u0002portation Engineer” B is not qualified for licensure based on education, examination, and experience?\nIf “Transportation Engineer” B is practicing engineering, does Engineer A have an obligation to re\u0002port “Transportation Engineer” B for the unlicensed practice?\n\nIs it ethical for “Transportation Engineer” B to engage in the practice of engineering when “Trans\u0002portation Engineer” B is not qualified for licensure based on education, examination, and experience?\n\nIf “Transportation Engineer” B is practicing engineering, does Engineer A have an obligation to re\u0002port “Transportation Engineer” B for the unlicensed practice?\n\nLicensing requirements are imposed upon highly skilled professional occupations such as medicine, law, and engineering. These requirements protect the public interest by ensuring members of the profession have demonstrated acceptable levels of competence and expertise and by excluding unqualified individuals who might misrepresent their skills and abilities to take advantage of the unsuspecting public.\n\nThere are ethical concerns when unqualified individuals engage in the practice of engineering. Performance of engineering services by unqualified individuals is detrimental to public safety and to the integrity of the engineering profession at large. Use of the title, “engineer,” conveys substantial education, examination, and experience, and, in many states, a license to practice. “Engineer” titles used by individuals working for state agencies tends to convey the impression that they are licensed professional engineers, which may cause confusion among the public. Use of creative titles such as “Associate Engineer,” “Building Engineer,” “Forest Practices Engineer” and “Sanitation Engineer” misrepresents qualifications. Unqualified individuals providing these services when they are not under the direct personal supervision of a licensed professional engineer have caused harm to the public health, safety, and welfare.\n\nThe Board of Ethical Review has had the opportunity to review similar cases. In BER Case 92-2, an engineer intern (EI) observed that the firm’s advertising documents listed him as a PE. The EI reported this misrepresentation to the marketing department, but after six months, the documents had not been corrected. The BER noted that the EI took the appropriate step by alerting the marketing director of the error and concluded that “[w]hile there is no indication that what has occurred under these facts is anything other than a negligent oversight, continued inaction by the firm in light of actual knowledge of the error could easily raise questions of improper and unethical conduct.”\n\nBER Case 95-10 considered an engineering firm, ENGCO, that listed key personnel who did not hold engineering degrees with titles including “Engineer” and “Design Engineer.” The case discussion indicated that “Although the industry and governmental agencies sometimes use the term indiscriminently [sic], we in the profession must not.” This case also suggested that most states have in their state licensing act how and when the word “engineer” can be used in a title, usually requiring a college degree and/or meeting licensing requirements, but it went on to point out that when “non-degreed personnel have fulfilled the state requirements to be licensed, they may use the term regardless of their formal education.” It should be noted that in the present case, NSPE Code of Ethics Section II.5.a. is very clear: “Engineers shall not falsify their qualifications or permit misrepresentation of their or their associates’ qualifications. They shall not misrepresent or exaggerate their responsibility in or for the subject matter of prior assignments.” In light of the fact that Engineer A has been directed to revise his “signed and sealed contract documents” based on [non] Engineer B’s review, Engineer A is working in association with B. Per Section II.1.e, Engineer A “shall not aid or abet the unlawful practice of engineering…” and is obligated to report Engineer B’s violation to appropriate professional bodies (Section II.1.f). Professional engineers owe ethical duties to the public that unlicensed individuals merely holding the title of “Engineer” do not owe. Professional engineers are personally and legally responsible for their services and must comply with a professional code of ethics. Allowing unlicensed individuals to hold themselves out as “Engineers” with none of the associated ethical or legal obligations diminishes the profession and endangers the public by posing a significant threat to public health and safety. This clearly undermines both the public’s confidence in the profession and the intent of licensure that professional engineers adhere to minimum standards and technical competence obtained through significant education and practical experience as evidenced by successful completion of a rigorous examination.\n\nPreamble\n\nEngineering is an important and learned profession. As members of this profession, engineers are expected to exhibit the highest standards of honesty and integrity. Engineering has a direct and vital impact on the quality of life for all people. Accordingly, the services provided by engineers require honesty, impartiality, fairness, and equity, and must be dedicated to the protection of the public health, safety, and welfare. Engineers must perform under a standard of professional behavior that requires adherence to the highest principles of ethical conduct.\n\nI.1.\n\nHold paramount the safety, health, and welfare of the public.\n\nII.1.e.\n\nEngineers shall not aid or abet the unlawful practice of engineering by a person or firm.\n\nII.1.f.\n\nEngineers having knowledge of any alleged violation of this Code shall report thereon to appropriate professional bodies and, when relevant, also to public authorities, and cooperate with the proper authorities in furnishing such information or assistance as may be required.\n\nII.5.a.\n\nEngineers shall not falsify their qualifications or permit misrepresentation of their or their associates' qualifications. They shall not misrepresent or exaggerate their responsibility in or for the subject matter of prior assignments. Brochures or other presentations incident to the solicitation of employment shall not misrepresent pertinent facts concerning employers, employees, associates, joint venturers, or past accomplishments.\n\nIII.8.a.\n\nEngineers shall conform with state registration laws in the practice of engineering.\n\nIt is unlawful and therefore not ethical for “Transportation Engineer” B to engage in the practice of engineering without having fulfilled the requirements for licensure: adequate education, rigorous examination, and substantial experience.\nSince “Transportation Engineer” B is practicing engineering (as defined by the state in question), Engineer A has an obligation to report “Transportation Engineer” B for unlicensed practice.\n\nIt is unlawful and therefore not ethical for “Transportation Engineer” B to engage in the practice of engineering without having fulfilled the requirements for licensure: adequate education, rigorous examination, and substantial experience.\n\nSince “Transportation Engineer” B is practicing engineering (as defined by the state in question), Engineer A has an obligation to report “Transportation Engineer” B for unlicensed practice.",
    "url": "https://www.nspe.org/career-resources/ethics/unlicensed-practice-nonengineers-engineer-job-titles",
    "pdf_url": null,
    "scraped_at": "2025-04-05T17:11:02.192739",
    "metadata": {
      "related_cases": [
        "Case 95-10",
        "Case 92-2"
      ],
      "codes_cited": [
        "Code III.8.a",
        "Code II.1.f",
        "Code II.1.e",
        "Code I.1",
        "Code II.5.a"
      ],
      "principles": [
        "objectivity",
        "public safety",
        "safety",
        "honesty",
        "professional conduct",
        "welfare",
        "health",
        "public health",
        "competency"
      ],
      "outcome": "unethical",
      "operationalization_techniques": [
        "Principle Instantiation",
        "Case Instantiation",
        "Conflicting Principles Resolution"
      ],
      "board_analysis": "neering is an important and learned profession. As members of this profession, engineers are expected to exhibit the highest standards of honesty and integrity. Engineering has a direct and vital impact on the quality of life for all people. Accordingly, the services provided by engineers require honesty, impartiality, fairness, and equity, and must be dedicated to the protection of the public health, safety, and welfare. Engineers must perform under a standard of professional behavior that requires adherence to the highest principles of ethical conduct.\n\nI.1.\n\nHold paramount the safety, health, and welfare of the public.\n\nII.1.e.\n\nEngineers shall not aid or abet the unlawful practice of engineering by a person or firm.\n\nII.1.f.\n\nEngineers having knowledge of any alleged violation of this Code shall report thereon to appropriate professional bodies and, when relevant, also to public authorities, and cooperate with the proper authorities in furnishing such information or assistance as m\n[content truncated]",
      "ethical_questions": [
        "Is it ethical for “Transportation Engineer” B to engage in the practice of engineering when “Trans\u0002portation Engineer” B is not qualified for licensure based on education, examination, and experience?",
        "Is it ethical for “Transportation Engineer” B to engage in the practice of engineering when “Trans\u0002portation Engineer” B is not qualified for licensure based on education, examination, and experience?"
      ]
    }
  },
  {
    "case_number": "Case 98-5",
    "title": "I.3.",
    "year": 1998,
    "date": "April 05, 2025",
    "full_text": "A consultant recently determined the existing water main in Shadyvale is generally in good condition but extremely old. Further, the water main is no longer large enough for all the properties served. The cost to replace is an unaffordable $750,000.\n\nThe State DOT is planning a highway reconstruction project in Shadyvale. Engineer W is the senior DOT engineer responsible for this project Engineer W delegates the project to Engineer Intern D, who is about to sit for the PE exam. State DOT policy unambiguously requires that only unavoidable utility conflicts will be paid for as part of highway projects, and that other utility work is to be considered as a betterment that must be paid for by the local municipality. Engineer Intern D initiates the design layout for the Shadyvale DOT project to avoid conflicts with the existing utilities, including separation of a new closed drainage system from the old water main.\n\nDuring design development review, Engineer W conveys to Engineer Intern D in an indirect way that the design should be revised so that the old water main is impacted. In that case, the cost to Shadyvale would be only the difference in price between the existing size of the water main and the proposed larger size, rather than the entire water main replacement cost. As a result, Shadyvale would pay an affordable $50,000 for the water main upgrade, an amount they can afford. Engineer W tells Engineer Intern D, “I’ll sign off on it.”\n\nWould it be ethical for Engineer Intern D to revise the design so that the old water main is impacted by the DOT project?\n\n\t\tWould it be unethical for Engineer W to sign off on the design where the old water main is impacted by the DOT project?\n\nWould it be ethical for Engineer Intern D to revise the design so that the old water main is impacted by the DOT project?\n\nWould it be unethical for Engineer W to sign off on the design where the old water main is impacted by the DOT project?\n\nEngineer Intern D’s adherence to DOT policy (avoiding the old water main) is in accord with the Canon 3 requirements of objectivity and truthfulness. Engineer W’s willingness to overlook DOT policy is inconsistent with Canon 4, the engineer’s obligation to act as faithful agent or trustee of one’s employer and with Canon 5, to avoid deception, which, of course, challenges Canon 6, protecting the honor, reputation, and usefulness of the profession.\n\nOf course, situations like this have happened before. In BER Case 98-5, Engineer Charlie served as director of a building department in a major city where, as a result of a series of budget cutbacks and more rigid code enforcement requirements, he became concerned that his staff would be unable to perform adequate and timely building inspections. Engineer Charlie met with the chairman of the local city council to discuss his concerns. The chairman indicated that he would be willing to issue an order to permit the hiring of additional code officials for the building department. However, the chairman sought Engineer Charlie’s concurrence on a city ordinance that would permit certain specified buildings under construction to be “grandfathered” under the older existing enforcement requirements and not the newer, more rigid requirements now in effect. Engineer Charlie agreed.\n\nThe Board acknowledged that Engineer Charlie might interpret the situation as one involving “trade-offs” in which one must weigh one “public good” (a better building inspection process) against a competing or concurrent ”public good” (a consistent code enforcement process). In such a situation, the engineer could arguably rationalize a decision to compromise, something frequently done in the political arena. However, the Board rejected the logic of compromise for BER Case 98-5, concluding that Engineer Charlie had a responsibility to make it plain and clear to the chairman that “righting a wrong with another wrong,” increases risk of grave damage to the public health and safety. As regards the present case, clearly the situation with the State DOT and Shadyvale is a political one, but the ethical value directly at risk is not the public safety, health and welfare, but rather, the truth.\n\nThe Board consistently upholds objectivity and truthfulness as a core ethical value of the engineering profession. BER Case 05-5 relates how Engineer Adam, while acting as the chief negotiator in the sale of a small engineering subsidiary to Engineer Baker, wanted to move the negotiations forward to finalize the deal, but Engineer Baker was stalling. Engineer Mary had expressed some initial interest in buying the subsidiary, but after further consideration, Engineer Mary decided she was definitely not interested in purchasing the subsidiary. In an effort to move the negotiations off “dead center,” and referring to Engineer Mary’s earlier interest, Engineer Adam told Engineer Baker, “Another company has expressed an interest in buying our subsidiary, so you had better move quickly if you are interested.”\n\nIn deciding that Engineer Adam’s negotiation approach merited the Board’s rebuke, the Board found Engineer Adam’s words “artfully misleading” or, in the words of prior BER Case 86-6, “intentionally designed to mislead… by obscuring the truth.” Had Engineer Adam disclosed the full circumstances relating to his conversation with Engineer Mary, the Board’s conclusion for Engineer Adam would have been different. “This Board strongly believes that honesty and truthfulness are hallmark qualities of a practicing engineer.” Whereas BER Case 05-5 identifies Engineer Adam seeking his own interests, for this present case, it is appropriate to ask, “Whose interests is the engineer (Engineer W) serving? Is it the interests of the travelling public? Or is it the residents of Shadyvale interest in their water system? Or perhaps it is the engineer’s own interests?\n\nIn the present case, clearly Engineer W is a DOT engineer and does not have a contractual relationship with Shadyvale. However, Engineer W’s direction to Engineer Intern D has placed the interests of Shadyvale above the interests of the DOT in violation of the clear policy of the DOT. If Engineer Intern D decides to cooperate with Engineer W, it is likely that no one else would ever know that $700,000 of DOT money had been diverted for the benefit of Shadyvale. All four of Canons 3, 4, 5, and 6 have been attacked.\n\nThe facts of the present case do not indicate Engineer W will personally profit by helping the residents of Shadyvale upgrade their water main. If anything, the facts imply both practical awareness of project efficiencies and a strongly altruistic motivation to do all the good he can do. However, benevolent motives do not make unethical conduct ethical.\n\nIn the present case, the Board is not concerned about Engineer W’s competence, his intention, or his motivation; these appear meritorious and praiseworthy. While Engineer W’s direct solution in Shadyvale may well be efficient and optimal, helping the residents of Shadyvale cannot be accomplished at the expense of the truth. The matter is particularly poignant when it is realized how formational the lesson will be to Engineer Intern D, a young engineer about to begin a professional career. Is secretly diverting $700,000 of state DOT funds to benefit an impoverished village the best version of how projects are done? No. Were Engineer W willing to try an open and transparent way, an ethical way, to help the residents of Shadyvale, this Board would offer our support, not our censure. Better approaches are available. For example, Engineer W could request a joint meeting to discuss the situation. Or Engineer W could run this up the chain of command with the State DOT. Perhaps Shadyvale could be allowed to benefit from construction activities the DOT was already undertaking. Perhaps that efficiency would sufficiently decrease the scope of Shadyvale’s work to make it affordable. Perhaps the DOT could assist Shadyvale with grant applications so that Shadyvale would be prepared to take advantage of the on-going DOT work. However, secretly diverting $700,000 of state DOT funds is not an ethical solution.\n\nI.3.\n\nIssue public statements only in an objective and truthful manner.\n\nI.4.\n\nAct for each employer or client as faithful agents or trustees.\n\nI.5.\n\nAvoid deceptive acts.\n\nI.6.\n\nConduct themselves honorably, responsibly, ethically, and lawfully so as to enhance the honor, reputation, and usefulness of the profession.\n\nIt would not be ethical for Engineer Intern D to accede to Engineer W’s veiled directive to revise the design so that the old water main is impacted by the DOT project.\n\n\t\tIt would not be ethical for Engineer W to sign off on a design altered so that the old water main is impacted by the DOT project. Engineer W would not be acting as a faithful agent of the DOT.\n\nIt would not be ethical for Engineer Intern D to accede to Engineer W’s veiled directive to revise the design so that the old water main is impacted by the DOT project.\n\nIt would not be ethical for Engineer W to sign off on a design altered so that the old water main is impacted by the DOT project. Engineer W would not be acting as a faithful agent of the DOT.",
    "url": "https://www.nspe.org/career-resources/ethics/public-welfare-what-cost",
    "pdf_url": null,
    "scraped_at": "2025-04-05T17:11:03.911021",
    "metadata": {
      "related_cases": [
        "Case 05-5",
        "Case 86-6",
        "Case 98-5"
      ],
      "codes_cited": [
        "Code I.5",
        "Code I.4",
        "Code I.3",
        "Code I.6"
      ],
      "principles": [
        "objectivity",
        "public safety",
        "safety",
        "honesty",
        "professional conduct",
        "welfare",
        "health",
        "public health",
        "disclosure",
        "competency"
      ],
      "outcome": "unethical",
      "operationalization_techniques": [
        "Principle Instantiation",
        "Case Instantiation",
        "Conflicting Principles Resolution"
      ],
      "board_analysis": "ll personally profit by helping the residents of Shadyvale upgrade their water main. If anything, the facts imply both practical awareness of project efficiencies and a strongly altruistic motivation to do all the good he can do. However, benevolent motives do not make unethical conduct ethical.\n\nIn the present case, the Board is not concerned about Engineer W’s competence, his intention, or his motivation; these appear meritorious and praiseworthy. While Engineer W’s direct solution in Shadyvale may well be efficient and optimal, helping the residents of Shadyvale cannot be accomplished at the expense of the truth. The matter is particularly poignant when it is realized how formational the lesson will be to Engineer Intern D, a young engineer about to begin a professional career. Is secretly diverting $700,000 of state DOT funds to benefit an impoverished village the best version of how projects are done? No. Were Engineer W willing to try an open and transparent way, an ethical way, \n[content truncated]",
      "ethical_questions": [
        "Would it be ethical for Engineer Intern D to revise the design so that the old water main is impacted by the DOT project?",
        "Would it be unethical for Engineer W to sign off on the design where the old water main is impacted by the DOT project?",
        "Would it be ethical for Engineer Intern D to revise the design so that the old water main is impacted by the DOT project?",
        "Would it be unethical for Engineer W to sign off on the design where the old water main is impacted by the DOT project?"
      ]
    }
  },
  {
    "case_number": "Case 95-10",
    "title": "Preamble",
    "year": 1995,
    "date": "April 05, 2025",
    "full_text": "Engineer A is a licensed Professional Engineer in three states (C, D, and E) and is a Board-certified Diplomate in Forensic Engineering. Attorney X contacts Engineer A, seeking the services of a non-engineering expert to provide testimony in State M. Engineer A agrees to evaluate the case, prepare an expert opinion, and provide testimony. The licensing statute in State M specifies that any engineer providing expert testimony in a State M court must be licensed in State M. Engineer A signs the report as “Consultant A, Board-certified Diplomate in Forensic Engineering,” making no reference whatsoever to licensure status.\n\nWas Engineer A’s self-description in the expert re\u0002port ethical?\n\nIssues of identification as an engineer, achievement of a professional engineer’s license, and duties of disclosure have come to the Board of Ethical Review with some regularity. For example, in BER Case 95-10, ENGCO referred in sale materials to key personnel as “Engineer” and “Design Engineer,” when those personnel were not licensed, did not have engineering degrees, and, in fact, did not have college degrees of any sort. ENGCO’s references were consistent with federal agency contracts that referred to inspection personnel as “Engineers.” However, ENGCO made inquiry of the BER because of concerns that these references violated the Code of Ethics. The BER agreed with ENGCO that these references likely violated the Code’s requirements that public statements be truthful, that engineers are to avoid deceptive acts, and that engineers are not to falsify their qualifications or permit misrepresentations of their qualifications. [The BER noted that, in some jurisdictions (at some points in time), non-degreed individuals could qualify for licensure and could legitimately use the title.] Thus, using a title to which one is not entitled is unethical.\n\nSimilarly, in BER Case 04-11, four different self-designation situations were evaluated, but only the first three are of interest here. (1) Engineer is licensed in States B, C, and D, but hands out business cards at a business meeting in State E. The business card states NO physical address. The BER found this to be unacceptable, because, although handing out a business card is an expression of accepted business etiquette and does not automatically become an offer to do work, the absence of a physical address creates confusion and the appearance of deception about licensure.\n\nIn the second situation (2), Engineer’s business card clearly identifies the states in which a license is held and that Engineer’s business address is in another state, one in which no license is held. The BER noted a conventional assumption that, absent other information, an Engineer with a “P.E.” designation is licensed in the state of the specified address. However, in this case, Engineer clearly did not list the address state as a state in which a license was held. Clarity was provided and ethical conformity was preserved.\n\nLikewise, in the third situation (3), Engineer’s business card has an address in State B, but states that Engineer is licensed only in State C. Engineer performs engineering work in State C and non-engineering consulting in State B. As in the second situation, clarity was provided and ethical conformity was preserved.\n\nIn BER Case 19-3, Engineer A, a forensic mechanical engineer, chairs a boiler code standards and safety committee within an engineering society, while Engineer B, also a forensic mechanical engineer, is a member of one of the technical subcommittees. Engineer B is retained as an expert by Plaintiff’s attorney in a boiler explosion case. Engineer A is approached by Defendant’s attorney to serve as an expert in the case. The BER held as follows: “Engineer A is serving as a volunteer to a technical society standards-setting committee to develop fact-based objective technical codes and standards for the benefit of the public. It would appear that Engineer A would be offering opinions as a mechanical engineer with expertise in safety engineering independent of any role as the safety codes and standards chair. While Engineer A’s opinion may be informed somewhat by [the] experience in working with safety codes and standards, presumably Engineer A will exercise independent judgment and discretion in rendering his opinion. . . . [T]here does not appear to be any conflict. . . . At the same time, Engineer A should be mindful of certain critical obligations clearly required under the facts. First, Engineer A has an obligation to (1) fully disclose to Attorney X his role as the chairman of the boiler code standards and safety committee within an engineering society and (2) advise [Defendant’s attorney] that Engineer B serves as a member of one of the technical subcommittees within the boiler code standards and safety committee. In addition, Engineer A also has an obligation to “. . . not engage in any written or verbal exchanges with Engineer B regarding the pending litigation without direction from legal counsel.”\n\nFinally, in BER Case 20-1, Engineer Intern explained to a prospective employer the intention to take the PE exam in the coming weeks, but was not asked and did not disclose two previous failures to pass the PE exam. The question was whether the failure to disclose constituted the omission of a material fact. In light of the employer’s decision to offer employment with the full knowledge that the Engineer Intern had not passed the PE exam, the BER concluded that the omission was not material and, therefore, not unethical.\n\nTurning to the facts of the present situation, there are two questions. First, was it ethical for Engineer A to provide expert services in State M, a state in which Engineer A is not licensed? Second, was it ethical for Engineer A to sign the report as “Consultant A, Board-certified Diplomate in Forensic Engineering.”\n\nIt should be noted that Engineer A was retained to provide non-engineering expert services. So long as Engineer A was qualified as an expert without relying on engineering qualifications (education, experience, and examination), Engineer A is not precluded or restricted by the NSPE Code of Ethics from providing those non-engineering expert services. However, Engineer A was clearly sensitive to the issue of State M licensing, because Engineer A was careful to exclude the P.E. designation from the signature block of the report. Unfortunately, by claiming the credential of Board-certified Diplomate of Forensic Engineering, Engineer A claimed the “E” word, “Engineer.” Furthermore, the most cursory inquiry would show that a Board-certified Diplomate in Forensic Engineering is required to be a licensed Professional Engineer. In accordance with the findings of BER Case 95-10, incorporating “Engineer” or “Engineering” into one’s title without actually having the credential, is unethical.\n\nFurthermore, incorporating “Engineer” or “Engineering” into Engineer A’s signature brought Engineer A under the purview of State M’s licensing law, with which Engineer A was not in compliance. That constitutes unlicensed practice, which is both unethical and unlawful.\n\nIt should be acknowledged that BER Case 04-11, situation (3) clearly contemplates that engineers who qualify as experts in non-engineering areas may provide those non-engineering services in jurisdictions in which they are not licensed. This presumes that the engineer is not offering opinions about science and/ or mathematics directly related to his/her engineering qualifications.\n\nPreamble\n\nEngineering is an important and learned profession. As members of this profession, engineers are expected to exhibit the highest standards of honesty and integrity. Engineering has a direct and vital impact on the quality of life for all people. Accordingly, the services provided by engineers require honesty, impartiality, fairness, and equity, and must be dedicated to the protection of the public health, safety, and welfare. Engineers must perform under a standard of professional behavior that requires adherence to the highest principles of ethical conduct.\n\nI.1.\n\nHold paramount the safety, health, and welfare of the public.\n\nII.5.a.\n\nEngineers shall not falsify their qualifications or permit misrepresentation of their or their associates' qualifications. They shall not misrepresent or exaggerate their responsibility in or for the subject matter of prior assignments. Brochures or other presentations incident to the solicitation of employment shall not misrepresent pertinent facts concerning employers, employees, associates, joint venturers, or past accomplishments.\n\nIII.1.d.\n\nEngineers shall not attempt to attract an engineer from another employer by false or misleading pretenses.\n\nIII.3.a.\n\nEngineers shall avoid the use of statements containing a material misrepresentation of fact or omitting a material fact.\n\nProvided that Engineer A qualified as an expert without relying on engineering qualifications, Engineer A’s self-presentation as a consultant-expert without identifying status as a licensed professional engineer was not unethical. However, when Engineer A claimed status as a Board-certified Diplomate in Forensic Engineering, Engineer A’s self-presentation became unethical.",
    "url": "https://www.nspe.org/career-resources/ethics/misrepresentation-qualifications",
    "pdf_url": null,
    "scraped_at": "2025-04-05T17:11:05.614112",
    "metadata": {
      "related_cases": [
        "Case 95-10",
        "Case 20-1",
        "Case 04-11",
        "Case 19-3"
      ],
      "codes_cited": [
        "Code III.3.a",
        "Code III.1.d",
        "Code II.5.a",
        "Code I.1"
      ],
      "principles": [
        "objectivity",
        "public safety",
        "safety",
        "honesty",
        "professional conduct",
        "welfare",
        "health",
        "public health",
        "disclosure",
        "competency"
      ],
      "outcome": "unethical",
      "operationalization_techniques": [
        "Principle Instantiation",
        "Case Instantiation",
        "Conflicting Principles Resolution"
      ],
      "board_analysis": "plomate of Forensic Engineering, Engineer A claimed the “E” word, “Engineer.” Furthermore, the most cursory inquiry would show that a Board-certified Diplomate in Forensic Engineering is required to be a licensed Professional Engineer. In accordance with the findings of BER Case 95-10, incorporating “Engineer” or “Engineering” into one’s title without actually having the credential, is unethical.\n\nFurthermore, incorporating “Engineer” or “Engineering” into Engineer A’s signature brought Engineer A under the purview of State M’s licensing law, with which Engineer A was not in compliance. That constitutes unlicensed practice, which is both unethical and unlawful.\n\nIt should be acknowledged that BER Case 04-11, situation (3) clearly contemplates that engineers who qualify as experts in non-engineering areas may provide those non-engineering services in jurisdictions in which they are not licensed. This presumes that the engineer is not offering opinions about science and/ or mathematics d\n[content truncated]",
      "ethical_questions": [
        "Was Engineer A’s self-description in the expert re\u0002port ethical?",
        "First, was it ethical for Engineer A to provide expert services in State M, a state in which Engineer A is not licensed?"
      ]
    }
  },
  {
    "case_number": "Case 96-12",
    "title": "I.6.",
    "year": 1996,
    "date": "April 05, 2025",
    "full_text": "Engineer A, a registered professional engineer in State Z, is discussing with colleague Engineer B a recently enacted law in their state that provides design professionals with immunity from liability when they volunteer during a natural or man-made disasters. Engineer B believes the new law significantly improves the ability of design professionals to assist communities in need during times of trouble; Engineer A feels that the new law does not change an engineer’s ethical obligations.\n\nIs Engineer A correct?\n\n\t\tIs Engineer B correct?\n\nIs Engineer A correct?\n\nIs Engineer B correct?\n\nEngineers, like other professionals, have a history of performing pro-bono work. As litigation has become more prevalent in our society, some engineers have become reluctant to lend their time and expertise to volunteer work. When a “Good Samaritan” Law1 was proposed in Ohio’s 2015 legislative biennium, NSPE indicated that professional engineers who voluntarily assist their communities, states, and the nation in times of crisis, when requested by the appropriate public official, should be protected from liability exposure when performing these duties.\n\nIn testimony to the Ohio Legislature regarding this bill, AIA Ohio’s immediate past president stated that architects are unable to volunteer in emergencies because of their status as licensed professionals - they risk losing their licenses if they offer opinions on damaged structures if contractual language is not in place.\n\nSimilarly, a February 2013 article about New York’s Volunteer Protection Act, the NYSPE stated:\n\nWe know that many of our members want to volunteer, but when doing so, please remember that volunteering is not without risk.\n\nThe Code of Ethics encourages engineers to contribute to their community; lending skills during a disaster is certainly work for the advancement of the safety, health, and well-being of their community. Note too that an engineer’s ethical obligations to their employer allow accepting outside work consistent with employer’s policies and prohibit use of the employer’s equipment for outside activities without the employer’s consent.\n\nProfessional obligation III.8 speaks directly to seeking indemnification for professional activities. BER Case 96-12 deals specifically with this section of the code of ethics (as does related BER Case 93-8). Both cases have similar language regarding accepting responsibility for professional services. Quoting from BER Case 93-8:\n\nA basic tenet of ethical conduct relates to the obligation of the engineer to accept responsibility for professional services that the engineer renders. This tenet is based upon the view that as a member of a learned profession, an engineer possesses skill, knowledge and expertise and is expected to use those attributes for the betterment of mankind. Engineers, through the enactment of engineering licensing laws and other legal restrictions, are granted the authority to practice their profession to the exclusion of others. As a result of this grant of authority, the law expects licensed engineers as they do other professions to perform professional services in a non-negligent manner. In addition, as with other professions, engineers are also expected to be personally liable for their acts, errors, or omissions in the performance of their professional services.\n\nBER Case 96-12 notes that “engineers typically address issues of liability through a variety of risk management techniques such as insurance, contract document language and other professional practice considerations.” NSPE’s website includes an informative section discussing liability of employed engineers, but note that an engineer, volunteering during a disaster is likely not “employed.” The Good Samaritan Laws provide a crucial risk management tool for practicing engineers when their normal risk management techniques do not apply.\n\nWith or without indemnification, an engineer’s primary obligation is to the public health, safety, and welfare. Further, although an engineer may be held harmless before the law when making decisions during public emergencies, they are committed to practice only in areas of competence and must conduct themselves honorably. Good Samaritan laws do nothing to change these obligations, and in fact, taken to the extreme, they might lead an engineer without sharp ethical presence of mind to attempt a task they would ordinarily conclude they are not qualified to undertake. In the end, the BER concludes that although these Good Samaritan laws serve a tremendous practical benefit, they do not relieve engineers of ethical obligations.\n\nFootnote 1 Section 2305.2310 of the Revised Code of Ohio\n\nI.6.\n\nConduct themselves honorably, responsibly, ethically, and lawfully so as to enhance the honor, reputation, and usefulness of the profession.\n\nII.1.\n\nEngineers shall hold paramount the safety, health, and welfare of the public.\n\nII.2.\n\nEngineers shall perform services only in the areas of their competence.\n\nIII.2.a.\n\nEngineers are encouraged to participate in civic affairs; career guidance for youths; and work for the advancement of the safety, health, and well-being of their community.\n\nIII.6.b.\n\nEngineers in salaried positions shall accept part-time engineering work only to the extent consistent with policies of the employer and in accordance with ethical considerations.\n\nIII.6.c.\n\nEngineers shall not, without consent, use equipment, supplies, laboratory, or office facilities of an employer to carry on outside private practice.\n\nIII.8.\n\nEngineers shall accept personal responsibility for their professional activities, provided, however, that engineers may seek indemnification for services arising out of their practice for other than gross negligence, where the engineer's interests cannot otherwise be protected.\n\nBoth Engineer A and Engineer B are correct. Although Good Samaritan Laws may make it easier to volunteer during natural or man-made disasters, they do not change an engineer’s ethical obligations.",
    "url": "https://www.nspe.org/career-resources/ethics/good-samaritan-laws",
    "pdf_url": null,
    "scraped_at": "2025-04-05T17:11:07.291239",
    "metadata": {
      "related_cases": [
        "Case 96-12",
        "Case 93-8"
      ],
      "codes_cited": [
        "Code III.6.b",
        "Code II.2",
        "Code I.6",
        "Code III.6.c",
        "Code III.8",
        "Code III.2.a",
        "Code II.1"
      ],
      "principles": [
        "public safety",
        "safety",
        "professional conduct",
        "welfare",
        "professional responsibility",
        "health",
        "public health",
        "competency"
      ],
      "outcome": "outcome not specified",
      "operationalization_techniques": [
        "Principle Instantiation",
        "Case Instantiation",
        "Conflicting Principles Resolution"
      ],
      "board_analysis": ". Good Samaritan laws do nothing to change these obligations, and in fact, taken to the extreme, they might lead an engineer without sharp ethical presence of mind to attempt a task they would ordinarily conclude they are not qualified to undertake. In the end, the BER concludes that although these Good Samaritan laws serve a tremendous practical benefit, they do not relieve engineers of ethical obligations.\n\nFootnote 1 Section 2305.2310 of the Revised Code of Ohio\n\nI.6.\n\nConduct themselves honorably, responsibly, ethically, and lawfully so as to enhance the honor, reputation, and usefulness of the profession.\n\nII.1.\n\nEngineers shall hold paramount the safety, health, and welfare of the public.\n\nII.2.\n\nEngineers shall perform services only in the areas of their competence.\n\nIII.2.a.\n\nEngineers are encouraged to participate in civic affairs; career guidance for youths; and work for the advancement of the safety, health, and well-being of their community.\n\nIII.6.b.\n\nEngineers in salaried\n[content truncated]",
      "ethical_questions": [
        "Was the engineer's conduct regarding engineer a, a registered professional engineer in state z, is discussing with colleague engineer b a recently enacted law in their state that provides design professionals with immunity from liability when they volunteer during a natural or man-made disasters ethical?"
      ]
    }
  },
  {
    "case_number": "Case 98-5",
    "title": "I.1.",
    "year": 1998,
    "date": "April 05, 2025",
    "full_text": "Engineer A works for an organization that for years has operated a fossil-fueled co-generation facility primarily to supply thermal energy for process needs. The facility has the capability to produce electric energy when thermal energy needs are satisfied, in fact, there are times when a significant portion of the organization’s electric energy is supplied by the co-generation facility. The generator is approaching the end of its useful life and will require a substantial investment to remain operational.\n\nRecently, stakeholders have expressed interest in reducing the organization’s carbon footprint, and these stakeholders suggest that the facility eliminate the generator and replace it with solar panels. After careful study of the facility electric load profile and the capability of the proposed solar energy system, Engineer A is satisfied that under normal conditions, the system of solar panels can supply electric energy equivalent to that provided by the existing generator. Capital constraints prevent the organization from installing a system of batteries to store energy for use at night or in bad weather, but the cost of installing the solar panels is essentially the same as the cost to rebuild the gen\u0002erator.\n\nWhen discussing the analysis of the electric load profile with a representative of the local electric utility, Engineer A learns that the utility resource planners reviewed their current generation mix and believe that during extreme weather events, they may be forced to institute rolling outages to keep system generating facilities on-line.\n\nEngineer A is preparing a report that will be presented to the board to consider the new solar project, and is convinced that the solar project, when considered in isolation, is viable and will satisfy those stakeholders interested in reducing the organization’s carbon footprint. Engineer A also realizes that a move to solar production without storage may stress the local utility generation mix even more, increasing the likelihood of rolling blackouts.\n\nShould Engineer A include information about the utility generation mix and rolling blackouts in the report to the board?\n\n\t\tShould Engineer A include information about cost of battery storage and the potential consequences of not having battery storage?\n\nShould Engineer A include information about the utility generation mix and rolling blackouts in the report to the board?\n\nShould Engineer A include information about cost of battery storage and the potential consequences of not having battery storage?\n\nAs a registered professional, Engineer A is obliged to include relevant and pertinent information in a report to the board. A report that does not contain information about the reliability of the utility source will not help them make an informed decision.\n\nAn ethical corollary to the organization’s decision to replace an on-demand, fossil-fueled generator with solar production without storage is worthy of discussion. With the current co-generation facility and a like-in-kind replacement, a presumably large electric load served by the utility can either stand alone or be operated to greatly reduce the electric load on a power system that will be stressed during extreme weather events.\n\nIf the solar production without storage option moves forward, the organization will increase its green footprint and will support a laudable goal of increasing environmentally friendly energy production. But this option may also increase the likelihood of future rolling blackouts. It is not difficult to imagine, for example, the stress placed upon elderly or confined individuals as well as those with medical conditions if they are left without a comfortable environment during an extreme weather event such as California and Texas recently experienced - and which led to rolling blackouts. What guidance can Engineer A rely upon to address a potential conflict between competing public goods?\n\nBER Case 98-5 describes how Engineer Adam serves as director of a building department in a major city. Engineer Adam has been concerned that as a result of a series of budget cutbacks and more rigid code enforcement requirements, the city has been unable to provide a sufficient number of qualified individuals to perform adequate and timely building inspections. Each code official member of Engineer Adam’s staff is often required to make as many as 60 code inspections per day. Engineer Adam believes there is no way even the most conscientious code official can make 60 adequate, much less thorough, inspections in one day, particularly under the newer, more rigid code requirements for the city. These new code requirements greatly enhance and protect the public’s health and safety. The code officials are caught between the responsibility to be thorough in their inspections and the city’s desire to hold down costs and generate revenue from inspection fees. Engineer Adam is required to sign off on all final inspection reports. Engineer Adam meets with the chairman of the local city council to discuss his concerns. The chairman indicates that he is quite sympathetic to Engineer Adam’s concerns and would be willing to issue an order to permit the hiring of additional code officials for the building department. At the same time, the chairman notes that the city is seeking to encourage more businesses to relocate into the city in order to provide more jobs and a strengthened tax base. In this connection, the chairman seeks Engineer Adam’s concurrence on a city ordinance that would permit certain specified buildings under construction to be “grandfathered” under the older existing enforcement requirements and not the newer, more rigid requirements now in effect.\n\nIn finding that it was not ethical for Engineer Adam to concur with the chairman’s proposal – a politically-motivated ‘Faustian bargain’ to hire additional building code officials – the BER affirmed that engineers “must hold the public health and safety paramount.” Engineer Adam “had a responsibility to insist, however strongly and vociferously, that public officials and decision-makers take steps and corrective steps if necessary to see that this obligation is fulfilled.” The BER further noted “righting a wrong with another wrong” does grave damage to the public health and safety, and that long-term public welfare (a valid building code enforcement process) cannot be undermined for short-term gain (grandfathering specified buildings in the name of increased jobs and tax revenues).\n\nRecent BER Case 20-4 addressed a public board (a municipal water commission) choosing to change the source of their potable water system to reduce public expenditures despite the recommendations of two engineers that further study was needed to ensure public safety. The BER found that the engineers have an obligation to formally communicate their concerns to the water commission. The BER also found that given the gravity of the potential danger to public health and safety, the engineers have an obligation to formally report their concerns to the state regulatory agency.\n\nBER Case 16-5 is also instructive; it deals with an engineer working on a team developing a driverless/ autonomous vehicle operating system. The development team was tasked with considering outcomes to choose in the event of an unavoidable vehicle crash – does the system choose the option that reduces the harm to vehicle occupants only, or should the system operate in a way that will minimize the harm that is done to anyone involved in the accident? The conclusions in BER Case 16-5 suggest the engineer fully and actively participate as a member of the engineering risk management team and express clearly and unambiguously concerns regarding safety of the operating system. The BER also suggested that, if necessary, the engineer recommend further study before the operating system is utilized.\n\nThis discussion has so far not addressed the obligation of Engineer A in this case to act as a faithful agent or trustee for the employer. Given the facts presented in this case, the solar generation system without storage will provide energy generation equivalent to the existing fossil-fueled generator at a similar cost; the system also reduces the organization’s carbon footprint. At first glance, this finding in conjunction with the earlier conclusion that system reliability data be included in the report to board may seem to satisfy Engineer A’s obligations. Note that “equivalent” as used to this point in the discussion has not addressed reliability. The proposed solar generation system without storage may produce the same energy that the existing fossil-fueled generator does, but it will not be as reliable. Further, a system without energy storage decreases the reliability of the entire local electric power system. Installing a system without storage may result in rolling blackouts and facility interruptions and thus not be a success. Therefore, Engineer A has an obligation to present this information in a report to the board.\n\nThe board may choose to rebuild/refurbish the fossil-fueled generator because it provides function and reliability at a lower cost than a solar production system with storage.\n\nSome may argue that continuing to operate a fossil-fueled generator is inconsistent with public health, safety, and welfare, while others will point to the increased reliability of the fossil-fueled generator as a demonstration of greater concern for public welfare. The ethical objective is an informed policy and project decision-making process.\n\nI.1.\n\nHold paramount the safety, health, and welfare of the public.\n\nI.6.\n\nConduct themselves honorably, responsibly, ethically, and lawfully so as to enhance the honor, reputation, and usefulness of the profession.\n\nII.1.c.\n\nEngineers shall not reveal facts, data, or information without the prior consent of the client or employer except as authorized or required by law or this Code.\n\nII.3.a.\n\nEngineers shall be objective and truthful in professional reports, statements, or testimony. They shall include all relevant and pertinent information in such reports, statements, or testimony, which should bear the date indicating when it was current.\n\nII.3.b.\n\nEngineers may express publicly technical opinions that are founded upon knowledge of the facts and competence in the subject matter.\n\nII.4.\n\nEngineers shall act for each employer or client as faithful agents or trustees.\n\nIII.1.b.\n\nEngineers shall advise their clients or employers when they believe a project will not be successful.\n\nIII.2.d.\n\nEngineers are encouraged to adhere to the principles of sustainable development1 in order to protect the environment for future generations.\n\tFootnote 1 \"Sustainable development\" is the challenge of meeting human needs for natural resources, industrial products, energy, food, transportation, shelter, and effective waste management while conserving and protecting environmental quality and the natural resource base essential for future development.\n\nEngineer A has an ethical obligation to include information about the utility generation mix and potential rolling blackouts in a report to the organization’s board.\n\n\t\tEngineer A’s report should also include information about cost of battery storage and the potential consequences of not having battery storage on system reliability relative to public safety, health, and welfare.\n\nEngineer A has an ethical obligation to include information about the utility generation mix and potential rolling blackouts in a report to the organization’s board.\n\nEngineer A’s report should also include information about cost of battery storage and the potential consequences of not having battery storage on system reliability relative to public safety, health, and welfare.",
    "url": "https://www.nspe.org/career-resources/ethics/public-safety-health-welfare-avoiding-rolling-blackouts",
    "pdf_url": null,
    "scraped_at": "2025-04-05T17:11:08.994119",
    "metadata": {
      "related_cases": [
        "Case 20-4",
        "Case 16-5",
        "Case 98-5"
      ],
      "codes_cited": [
        "Code II.3.b",
        "Code II.4",
        "Code I.6",
        "Code II.3.a",
        "Code I.1",
        "Code II.1.c",
        "Code III.1.b",
        "Code III.2.d"
      ],
      "principles": [
        "objectivity",
        "public safety",
        "safety",
        "honesty",
        "welfare",
        "health",
        "public health",
        "disclosure",
        "competency"
      ],
      "outcome": "unethical",
      "operationalization_techniques": [
        "Principle Instantiation",
        "Case Instantiation",
        "Conflicting Principles Resolution"
      ],
      "board_analysis": "ization’s carbon footprint. At first glance, this finding in conjunction with the earlier conclusion that system reliability data be included in the report to board may seem to satisfy Engineer A’s obligations. Note that “equivalent” as used to this point in the discussion has not addressed reliability. The proposed solar generation system without storage may produce the same energy that the existing fossil-fueled generator does, but it will not be as reliable. Further, a system without energy storage decreases the reliability of the entire local electric power system. Installing a system without storage may result in rolling blackouts and facility interruptions and thus not be a success. Therefore, Engineer A has an obligation to present this information in a report to the board.\n\nThe board may choose to rebuild/refurbish the fossil-fueled generator because it provides function and reliability at a lower cost than a solar production system with storage.\n\nSome may argue that continuing\n[content truncated]",
      "ethical_questions": [
        "Was the engineer's conduct regarding engineer a works for an organization that for years has operated a fossil-fueled co-generation facility primarily to supply thermal energy for process needs ethical?"
      ]
    }
  },
  {
    "case_number": "Case 01-7",
    "title": "I.1.",
    "year": 2001,
    "date": "April 05, 2025",
    "full_text": "Engineer B is a design engineer from Firm X and has only completed a 30% design. However, Engineer B has requested the project manager to assign someone to perform a higher 60% design review to justify release of a higher 60% design fee from the Client. She has also requested that the reviewer consider a completely new design concept. Two situations are presented below to clarify how an internal plan review would differ from a third-party peer review.\n\nSituation 1: Engineer A also works for consulting engineering Firm X and has been requested to perform a plan review of Engineer B’s in-house 60% design. Engineer A’s work normally involves providing a quality assurance/quality control (QA/QC) plan reviews on projects designed by other in-house engineers. Engineer A has been given general corporate design checklists for level of design completeness and an electrical QC form for signing off on level of completeness to provide to clients. Engineer A provides significant detail in design reviews, but does not exaggerate level of completeness and typically stops short of making review comments that would totally change the basis of design of such projects. The plan review role is to review the accuracy and content of both plans and specifications, and identify design elements that need additional analysis, revision, and improvement to fulfill the anticipated percent level of design. Frequently, designs that Engineer A has been given to review do not reach the level of completeness represented.\n\nSituation 2: Engineer C is an independent consulting engineer with Firm Y that has been retained to perform a peer review of Engineer B’s (of Firm X) 60% progress design. Engineer C has a consulting engineering firm and occasionally performs peer reviews for project owners and public agencies. Engineer C has been asked to sign a three-party agreement with Engineer B and Firm X that provides for consent but also addresses costs, liabilities, procedures, indemnification, and other relevant factors. A frequently used peer re\u0002view document for this is EJCDC E-581 which calls for an independent peer review of another engineer’s design work. Engineer C’s firm, Firm Y, signs a three-party agreement that follows procedures outlined in EJCDC Doc. No. E-581 and agrees to provide a 60% review of Engineer B’s design. If it is determined by Engineer C that the peer review is on a design that is not 60% , Engineer C is asked to stop work immediately and return design documents to Firm X.\n\nWas it ethical for Engineer B to knowingly submit a 30% design for a 60% design review?\n\n\t\tWould it be ethical for Engineer B to make a request for radically different design recommendations by (in-house) Engineer A including recommendations for total redesign?\n\n\t\tWhat were Engineer A’s ethical obligations for the plan review?\n\n\t\tWhat were Engineer C’s obligations for the peer review\n\nWas it ethical for Engineer B to knowingly submit a 30% design for a 60% design review?\n\nWould it be ethical for Engineer B to make a request for radically different design recommendations by (in-house) Engineer A including recommendations for total redesign?\n\nWhat were Engineer A’s ethical obligations for the plan review?\n\nWhat were Engineer C’s obligations for the peer review\n\nThe NSPE Board of Ethical Review has not considered similar cases where engineers performing plan reviews or peer reviews particularly if the requested design review is intended to get funding under questionable circumstances or to totally change or recommend radical changes to the designs of the original engineer. A licensed consulting engineer plans reviewer (such as Engineer A) or 3rd-party peer reviewer (such as Engineer C) needs to exercise some level of restraint in performing design reviews, as they may not have been given all project specifics and may not have a complete understanding of the scope of work. The review efforts are intended to ensure that the level of design is in fact a 60% submittal and to look for design errors, omissions, and then recommend improvements to the plans and specifications for that level of completeness. An entire redevelopment of Engineer B’s documents should not be recommended unless Engineer A and Engineer C believe that the project will not be successful.\n\nRelative to Situation 1, BER Case 01-7 relates to this discussion in that the ethics of a County initiating a new ordinance to give property owners the ability to hire private engineers and architects to perform plan reviews, as opposed to these reviews previously being performed by a building department, is relevant. The modus operandi for this ordinance was to get more timely action in the review process. PEs must be above reproach and avoid situations that would compromise their judgment and integrity. As long as the licensed PE providing plan review exercises full disclosure, and therefore has no conflict of interest as stated in NSPE Code of Ethics Section II.4.a. and possesses skill sets that are within their area of competence as stated in NSPE Code of Ethics Section I.2, there is no reason he or she cannot serve in this capacity and be a protector of the public interest.\n\nThe duties required of plans/specifications reviewer Engineer A are less formal and can typically be represented by handwritten or track-change comments on the specifications and handwritten or computer-generated drawing markups via drawing review software (e.g., Bluebeam®). Completed checklists and sign off on an Electrical QC Form for level of completeness rather than issuance of a formal report is common and satisfies the needs of an in-house consulting firm and project owner. However, it is important to note that Engineer A needs to provide substantive and meaningful comments on the design, but Engineer A is not hired to perform design.\n\nRelative to Situation 2, BER Case 18-10 describes a case wherein Engineer A is a P.E. and owner of ABC Engineering who is retained by a state agency to participate in an independent external peer review of a major state transportation project prepared by the agency. The peer review is limited in scope, but various clarifications and refinements to the plans and specifications are ultimately incorporated into a RFP soliciting proposals for design-build services to complete the major transportation project. The question arises whether it is ethical for Engineer A and his firm ABC Engineering to participate in a design-build joint venture and submit a proposal for the project. Therefore, this case deals with potential conflict of interest issues (noted in NSPE Code of Ethics Section II.4.a.) when a peer reviewer participates in a subsequent design-build joint venture and then submits a proposal. It is deemed not to be unethical as long as the state agency approves and the work complies with state laws and regulations.\n\nBER Case 96-8 relates to 3rd-party peer review confidentiality agreements. It is common practice that peer reviewers must sign confidentiality agreements when agreeing to an independent peer review. Confidentiality assures that the maximum amount of disclosure will occur and helps to build trust between the parties. In that case, as part of a peer review visit, Engineer A visits Engineer B’s firm. Following review of technical documentation in connection with a series of design projects involving Engineer B’s firm, Engineer A dis\u0002covers that Engineer B’s work may be in violation of state and local safety code requirements and therefore could endanger public health and safety. Engineer A has an obligation not to disclose confidential information concerning the business affairs and procedures of any present or former client. However, if Engineer A determines that the design of Engineer B creates imminent risk of harm to public health and safety and violates the Code of Ethics as stated in NSPE Code of Ethics Section I.1. and Section III.1.b., it is incumbent on Engineer A to discuss this concern with Engineer B to seek early resolution of the issue. If Engineer A and Engineer B are unable to resolve their differences, Engineer A must inform Engineer B that in his/her role as a P.E. the only alternative is to notify proper authorities.\n\nThe duties of Engineer C for commentary in Situation 2 are more formal and typically involve a very detailed report depicting all recommended changes to the documents. Because Engineer B requested the review, Engineer C does not need to be concerned about informing Engineer B before performing a peer review as required by NSPE Code of Ethics Section III.7.a.\n\n[EJCDC E-581 recommends creating a separate peer review consent form but does not publish one.] Indemnification and liability are relevant factors and must be addressed in a peer review consent form.\n\nIn conclusion, both forms of design review services are effective in achieving desired results when required by lenders, government agencies and project owners. However, a formal peer review is typically more expensive and more common on 100% rather than partially complete designs. Engineer A and Engineer C should specifically state that it is their understanding of the review process to comment only and not provide a radically different design by making recommendations overriding the original design scope of Engineer B. Neither was hired to perform design services. Although Engineer A may not have a full understanding of the project scope, Engineer C should be fully briefed in order to fulfill the expectations of a 3rd-party peer review.\n\nNeither Engineer A nor C should engage in the deceptive practice of making a 30% project appear to be 60% complete.\n\nI.1.\n\nHold paramount the safety, health, and welfare of the public.\n\nI.2.\n\nPerform services only in areas of their competence.\n\nI.5.\n\nAvoid deceptive acts.\n\nII.4.\n\nEngineers shall act for each employer or client as faithful agents or trustees.\n\nII.4.a.\n\nEngineers shall disclose all known or potential conflicts of interest that could influence or appear to influence their judgment or the quality of their services.\n\nIt is unethical for Engineer B to knowingly submit a 30% design for a 60% design review.\n\n\t\tAlthough it is not unethical at any design stage of a project for Engineer B to request Engineer A for radically different design recommendations leading to complete redesign, such recommendations are normally outside the scope of an in-house QA/ QC review. If Engineer B is looking for a sounding board or for additional ideas, Engineer B is free to approach any of the engineering employees for an informal discussion. However, if Engineer B has serious doubts about the efficacy of the proposed design, such concerns should be raised as soon as possible for a full review.\n\n\t\tEngineer A is ethically obligated to return the 30% plans submitted as 60% complete.\n\n\t\tLikewise, as a 3rd-party peer review, Engineer C’s obligation is to review documents for primarily technical content and not to review documents that are only 30% complete submitted as 60% complete.\n\nIt is unethical for Engineer B to knowingly submit a 30% design for a 60% design review.\n\nAlthough it is not unethical at any design stage of a project for Engineer B to request Engineer A for radically different design recommendations leading to complete redesign, such recommendations are normally outside the scope of an in-house QA/ QC review. If Engineer B is looking for a sounding board or for additional ideas, Engineer B is free to approach any of the engineering employees for an informal discussion. However, if Engineer B has serious doubts about the efficacy of the proposed design, such concerns should be raised as soon as possible for a full review.\n\nEngineer A is ethically obligated to return the 30% plans submitted as 60% complete.\n\nLikewise, as a 3rd-party peer review, Engineer C’s obligation is to review documents for primarily technical content and not to review documents that are only 30% complete submitted as 60% complete.",
    "url": "https://www.nspe.org/career-resources/ethics/internal-plan-reviews-vsthird-party-peer-reviews-duties",
    "pdf_url": null,
    "scraped_at": "2025-04-05T17:11:10.707850",
    "metadata": {
      "related_cases": [
        "Case 01-7",
        "Case 96-8",
        "Case 18-10"
      ],
      "codes_cited": [
        "Code II.4.a",
        "Code II.4",
        "Code I.2",
        "Code I.1",
        "Code I.5",
        "Code III.7.a",
        "Code III.1.b"
      ],
      "principles": [
        "public safety",
        "safety",
        "honesty",
        "welfare",
        "conflicts of interest",
        "confidentiality",
        "health",
        "public health",
        "disclosure",
        "competency"
      ],
      "outcome": "unethical",
      "operationalization_techniques": [
        "Principle Instantiation",
        "Case Instantiation",
        "Conflicting Principles Resolution"
      ],
      "board_analysis": "s. Because Engineer B requested the review, Engineer C does not need to be concerned about informing Engineer B before performing a peer review as required by NSPE Code of Ethics Section III.7.a.\n\n[EJCDC E-581 recommends creating a separate peer review consent form but does not publish one.] Indemnification and liability are relevant factors and must be addressed in a peer review consent form.\n\nIn conclusion, both forms of design review services are effective in achieving desired results when required by lenders, government agencies and project owners. However, a formal peer review is typically more expensive and more common on 100% rather than partially complete designs. Engineer A and Engineer C should specifically state that it is their understanding of the review process to comment only and not provide a radically different design by making recommendations overriding the original design scope of Engineer B. Neither was hired to perform design services. Although Engineer A may not h\n[content truncated]",
      "ethical_questions": [
        "Was it ethical for Engineer B to knowingly submit a 30% design for a 60% design review?",
        "Would it be ethical for Engineer B to make a request for radically different design recommendations by (in-house) Engineer A including recommendations for total redesign?",
        "What were Engineer A’s ethical obligations for the plan review?",
        "What were Engineer C’s obligations for the peer review\n\nWas it ethical for Engineer B to knowingly submit a 30% design for a 60% design review?",
        "Would it be ethical for Engineer B to make a request for radically different design recommendations by (in-house) Engineer A including recommendations for total redesign?",
        "What were Engineer A’s ethical obligations for the plan review?"
      ]
    }
  },
  {
    "case_number": "Case 91-2",
    "title": "II.1.",
    "year": 1991,
    "date": "April 05, 2025",
    "full_text": "Engineer D is the Engineer of Record (EOR) as part of a design-build team led by Contractor W. Under the terms of an Agency funding grant, the project is re\u0002quired to have an independent peer review of the design, the design approach, compatibility with the site, and a constructability assessment related to the design approach. Engineer D prepares the design and drawings and directly hires Engineer F to perform the peer review.\n\nWas it ethical for Engineer D to hire Engineer F to perform the required peer review?\n\nWas it ethical for Engineer D to hire Engineer F to perform the required peer review?\n\nThe contractual relationships and roles of the many parties illustrate how a conflict of interest can go unnoticed. In this case, an independent peer review of the design was required by the Agency and the peer reviewer was in a direct contractual relationship with the EOR. Two reputable engineers can and often do disagree and they can both be right. A key question the peer reviewer needs to answer is whether the EOR did it wrong or just a different, but still acceptable, way.\n\nIn BER Case 91-2, the Client hired Engineer B to perform a review of Engineer A’s work. The Client determined that there were errors/omissions in Engineer A’s work. Engineer B’s fee is dependent on the ultimate court judgement or settlement made with Engineer A in contemplation of a suit for breach of contract. The BER concluded that Engineer B is being placed in a position of identifying errors/omissions in Engineer A’s work in order to pressure Engineer A into a settlement which would result in a fee for Engineer B. The nature of the services and the related contingency arrangement suggest a strong possibility that the engineer’s judgement could be compromised or at the very least create the appearance of being compromised.\n\nPeer reviews are common on complicated engineering projects. The “independent” requirement in this case must withstand the scrutiny of a conflict of interest.\n\nWhat does it mean to perform an independent peer review of engineering work? NSPE Position Statement No. 10-178 (Peer Review Legislation) recommends that “…peer reviewer must not be an employee, coworker, partner or subconsultant of the professional engineer whose design is being peer reviewed.”\n\nIn order to avoid any perception of a conflict of interest, an independent peer reviewer needs to be contracted directly by and compensated by the project owner (Client) and not the EOR. In the case of Design-Build teams, the lead party could potentially hire both the EOR and the peer reviewer, as long as they are different firms. A peer review performed by another office of the EOR or a subconsultant to the EOR does not meet the requirement of being independent and squarely has a conflict of interest.\n\nIn the present case, the EOR hired the peer review firm, putting the peer review firm in a similarly conflicted position of potentially disagreeing the EOR and possibly not getting compensated if their conclusions result in significant changes to the EOR’s design. The peer review engineer must be free to provide objective, unbiased professional judgements to serve the best interests of their client and not compromise integrity in pursuit of a professional fee. Contractor W should have retained Engineer F (or other engineer of Contractor W’s choice) to assure the independence of Engineer F’s review.\n\nII.1.\n\nEngineers shall hold paramount the safety, health, and welfare of the public.\n\nII.1.a.\n\nIf engineers' judgment is overruled under circumstances that endanger life or property, they shall notify their employer or client and such other authority as may be appropriate.\n\nII.2.a.\n\nEngineers shall undertake assignments only when qualified by education or experience in the specific technical fields involved.\n\nII.4.\n\nEngineers shall act for each employer or client as faithful agents or trustees.\n\nII.4.a.\n\nEngineers shall disclose all known or potential conflicts of interest that could influence or appear to influence their judgment or the quality of their services.\n\nIII.1.b.\n\nEngineers shall advise their clients or employers when they believe a project will not be successful.\n\nOn its face, the peer review was not independent, as required by the agency. Therefore, it would not be ethical for Engineer D to hire and enter into a direct contractual relationship with Engineer F to perform the peer review.",
    "url": "https://www.nspe.org/career-resources/ethics/conflict-interest-designbuild-project",
    "pdf_url": null,
    "scraped_at": "2025-04-05T17:11:12.458246",
    "metadata": {
      "related_cases": [
        "Case 91-2"
      ],
      "codes_cited": [
        "Code II.4",
        "Code II.4.a",
        "Code II.2.a",
        "Code II.1",
        "Code II.1.a",
        "Code III.1.b"
      ],
      "principles": [
        "objectivity",
        "public safety",
        "safety",
        "honesty",
        "welfare",
        "conflicts of interest",
        "health",
        "disclosure",
        "competency"
      ],
      "outcome": "outcome not specified",
      "operationalization_techniques": [
        "Principle Instantiation",
        "Case Instantiation",
        "Conflicting Principles Resolution"
      ],
      "board_analysis": "e free to provide objective, unbiased professional judgements to serve the best interests of their client and not compromise integrity in pursuit of a professional fee. Contractor W should have retained Engineer F (or other engineer of Contractor W’s choice) to assure the independence of Engineer F’s review.\n\nII.1.\n\nEngineers shall hold paramount the safety, health, and welfare of the public.\n\nII.1.a.\n\nIf engineers' judgment is overruled under circumstances that endanger life or property, they shall notify their employer or client and such other authority as may be appropriate.\n\nII.2.a.\n\nEngineers shall undertake assignments only when qualified by education or experience in the specific technical fields involved.\n\nII.4.\n\nEngineers shall act for each employer or client as faithful agents or trustees.\n\nII.4.a.\n\nEngineers shall disclose all known or potential conflicts of interest that could influence or appear to influence their judgment or the quality of their services.\n\nIII.1.b.\n\nEngin\n[content truncated]",
      "ethical_questions": [
        "Was it ethical for Engineer D to hire Engineer F to perform the required peer review?",
        "Was it ethical for Engineer D to hire Engineer F to perform the required peer review?"
      ]
    }
  },
  {
    "case_number": "Case 76-6",
    "title": "II.5.b.",
    "year": 1976,
    "date": "April 05, 2025",
    "full_text": "A small city has been notified by the State’s environmental agency that its water system is not compliant with drinking water standards and the city must resolve its non-compliant issues. The city decides to hire an engineering firm for assistance and, subsequently, advertises a Request for Qualifications (RFQ) for engineering firms to respond. Services required include Preliminary Engineering to evaluate alternatives for solution of the non-compliance, and Design and Construction Engineering for the selected alternative. The RFQ requests specific information from the engineering firms that respond. Engineer A, in an effort to improve its chances of being selected by the city, offers to provide free Preliminary Engineering. The RFQ did not request any information regarding fees or engineering costs.\n\nWas the offer by Engineer A for free Preliminary Engineering ethical?\n\nWas the offer by Engineer A for free Preliminary Engineering ethical?\n\nThe competition for work among engineering firms in such circumstances is significant. Setting one firm apart from its competitors is difficult. Engineering firms must find increasingly creative ways to become successful.\n\nThe BER has reviewed many cases previously in this regard, but none that has had the specifics of this case. Most have addressed the issue of direct gifts to individuals rather than the offer here, which is the reduced fees associated with the project.\n\nIn BER Case 76-6, an engineering firm was negotiating for a contract in a foreign country in which it had not worked previously. They were advised by a high-ranking government official of that country that it is established practice for those awarded contracts to make personal gifts to the governmental officials who are authorized to award the contracts, and that such practice is legal in that country. They were further advised that the failure to make the gifts would result in no further work being awarded to the firm and to expect poor cooperation in performing the first contract. The firm was further told that other firms have adhered to the local practice in regard to such gifts. In this case, the BER determined that the code was clear and direct to the point. The gifts were a direct consideration for securing the work, and that the code must be read on the most basic point of honor and integrity. It was unethical for the engineering firm to accept the contract and make the gifts as described.\n\nIn BER Case 92-8, Engineer A was the principal of a large engineering firm that provides civil engineering services to state, county and local governments and agencies. The firm was planning to relocate one of its regional offices to a medium-sized city. The relocation would greatly benefit the city selected. Having the city employ the engineering services offered by the firm would have been an added incentive to the firm’s selection of the city. Engineer A verbally suggested to a certain city’s officials during the relocation negotiations with the city that he “hoped the city would consider employing the services of his firm in the future for part of its engineering services requirements.” City officials at the meeting did not respond specifically to Engineer A’s verbal suggestion. Ultimately, Engineer A’s firm agreed to relocate to that city. The BER determined in this case that there was no offer of any gift or other valuable consideration in order to secure work. There did not appear to be any “quid pro quo” involved under which an understanding or agreement to provide something of value in exchange for some other thing of value. While the BER was not entirely comfortable with the context in which the suggestion was made, they did not believe that the suggestion during the relocation negotiations rises to a level of impropriety or Code violation. Regardless, the utmost concern of the BER was the offering of valuable consideration to secure work, as it should be in the currently considered case.\n\nIn the evaluation of the case at hand, therefore, the determination must be made of whether or not the offer of free Preliminary Engineering should be considered a gift or valuable consideration to secure work. The offer certainly has the potential to sway the opinion of those involved in the selection process and thus influencing the award. An argument could be made that Engineer A is providing a favorable negotiation position for the city if awarded the work. However, the use of the words “free or no charge” produces a logical conclusion to the public perception that it is a gift. In the truest interpretation of the Code, there is no question that the offer meets this definition.\n\nAdditionally, it is important to note that the RFQ did not request information regarding fees or engineering costs. The inclusion of such information by Engineer A did not comply with the instructions. Section III.1.f. of the Code states that all persons shall be treated with fairness. This ethical requirement should extent to competitors as well. It is not fair to other engineering firms who fully complied with the requirements of the RFQ to compete with the firm that does not comply and includes competitive fee information which was not requested.\n\nII.5.b.\n\nEngineers shall not offer, give, solicit, or receive, either directly or indirectly, any contribution to influence the award of a contract by public authority, or which may be reasonably construed by the public as having the effect or intent of influencing the awarding of a contract. They shall not offer any gift or other valuable consideration in order to secure work. They shall not pay a commission, percentage, or brokerage fee in order to secure work, except to a bona fide employee or bona fide established commercial or marketing agencies retained by them.\n\nIII.1.f.\n\nEngineers shall treat all persons with dignity, respect, fairness and without discrimination.\n\nIII.8.a.\n\nEngineers shall conform with state registration laws in the practice of engineering.\n\nThe offer by Engineer A for free Preliminary Engineering should be considered a gift or valuable consideration in order to secure work and provided an unfair advantage over other firms. Therefore, the offer was unethical. Furthermore, if this matter occurs in a state in which Qualification-Based Selection (QBS) is required, the action of Engineer A is both unethical and potentially illegal.",
    "url": "https://www.nspe.org/career-resources/ethics/offer-free-or-reduced-fee-services",
    "pdf_url": null,
    "scraped_at": "2025-04-05T17:11:14.199009",
    "metadata": {
      "related_cases": [
        "Case 76-6",
        "Case 92-8"
      ],
      "codes_cited": [
        "Code III.8.a",
        "Code II.5.b",
        "Code III.1.f"
      ],
      "principles": [
        "honesty",
        "welfare",
        "competency"
      ],
      "outcome": "unethical",
      "operationalization_techniques": [
        "Principle Instantiation",
        "Case Instantiation",
        "Conflicting Principles Resolution"
      ],
      "board_analysis": "or no charge” produces a logical conclusion to the public perception that it is a gift. In the truest interpretation of the Code, there is no question that the offer meets this definition.\n\nAdditionally, it is important to note that the RFQ did not request information regarding fees or engineering costs. The inclusion of such information by Engineer A did not comply with the instructions. Section III.1.f. of the Code states that all persons shall be treated with fairness. This ethical requirement should extent to competitors as well. It is not fair to other engineering firms who fully complied with the requirements of the RFQ to compete with the firm that does not comply and includes competitive fee information which was not requested.\n\nII.5.b.\n\nEngineers shall not offer, give, solicit, or receive, either directly or indirectly, any contribution to influence the award of a contract by public authority, or which may be reasonably construed by the public as having the effect or intent of\n[content truncated]",
      "ethical_questions": [
        "Was the offer by Engineer A for free Preliminary Engineering ethical?",
        "Was the offer by Engineer A for free Preliminary Engineering ethical?"
      ]
    }
  },
  {
    "case_number": "Case 18-9",
    "title": "I.1.",
    "year": 2018,
    "date": "April 05, 2025",
    "full_text": "Engineer A is a consulting engineer representing Client B, a developer who is proposing to develop a health care facility that requires a significant upgrade to the property’s access road that crosses a tidal saltmarsh. Engineer A’s scope includes design and local permitting of the roadway, including an upgrade of the tidal crossing from a small culvert to a small bridge, increasing its hydraulic capacity. Local development regulations require designing for a 25-year fresh-water storm, and assume that future weather conditions will be consistent with updated historical data. The local development regulations and national design codes and standards have not yet been updated to reflect changing conditions and weather patterns, including effects of sea level rise and changes in precipitation intensities and recurrence intervals effected by on-going climate change. It is Engineer A’s judgment, based on hydraulic evaluation procedures presented at a recent transportation agency conference, that the proposed project may result in some upstream homes becoming uninhabitable a decade or more earlier than would otherwise be the case. Engineer A proposes a complex and costly hydrologic and hydraulic analysis by a specialized subconsultant to predict the extent to which sea level rise and the increased hydraulic capacity of the tidal crossing will result in flood damage to a neighborhood of twenty upstream homes during future high tides and storm surges, anticipating this to be a difficult question to answer in the project’s public hearings. Client B directs Engineer A to proceed without the costly analysis unless and until such an analysis is requested by the applicable regulatory authorities.\n\nDoes Engineer A have an ethical obligation to address or evaluate the impacts of a project on public health, safety, and welfare with respect to climate change induced conditions that have not yet occurred?\n\n\t\tIn this set of circumstances, what are Engineer A’s reasonable courses of action with respect to engineering ethics?\n\nDoes Engineer A have an ethical obligation to address or evaluate the impacts of a project on public health, safety, and welfare with respect to climate change induced conditions that have not yet occurred?\n\nIn this set of circumstances, what are Engineer A’s reasonable courses of action with respect to engineering ethics?\n\nProfessional engineers have a primary ethical obligation to hold paramount the protection of public health, safety, and welfare. That obligation is not bounded by what is required by law, or by regulations, but rather is stated broadly. That obligation leads to not uncommon “gray areas” in practice requiring judgment as to what issues potentially impacting public health, safety, and welfare merit more detailed evaluation and what issues do not. Such judgments increasingly necessitate engineers to have sufficient understanding of related areas of engineering practice and science to determine when more specialized evaluation is needed to assure protection of public health, safety, and welfare. Considering the effects of climate change in engineering planning and design adds substantial complexity to engineering decision-making as engineers consider “going beyond” existing requirements to provide long-term protection of public health, safety, and welfare.\n\nFor more than a century, engineers have assumed that future climate and weather conditions will be consistent with historical climate and weather data. In recent decades, as climate and weather data are updated, the historical dataset changes as climate and weather patterns continue to change. This necessitates that climate and weather patterns be addressed not as fixed by historical patterns but rather recognized as a “moving target.”\n\nIn BER Case 07.6, Engineer A was a principal in an environmental engineering firm and had been requested by a developer client to prepare an analysis of a piece of property adjacent to a wetlands area for potential development as a residential condominium. During the firm’s analysis, one of the engineering firm’s biologists reported to Engineer A that, in his opinion, the condominium project could threaten a bird species that inhabited the adjacent protected wetlands area. The bird species was not an “endangered species,” but it was considered a “threatened species” by federal and state environmental regulators. The BER determined that it was unethical for Engineer A to not include the information about the threat to the bird species in a written report that would be submitted to a public authority that was considering the developer’s proposal. Engineer A should have included the information in the written report and advised the client of its inclusion. The BER noted that engineers have an obligation to be objective and truthful in professional reports, statements, or testimony and include all relevant and pertinent information in such reports, and that it would be reasonable to assume that the public authority approving the development would be interested in this information.\n\nIn BER Case 18-9, Engineer A worked for a developer to perform hydrodynamic modeling and coastal risk assessment regarding a proposed residential development. Based on newly identified historic weather data, Engineer A advocated that the project be designed for the then-projected 100-year storm surge elevation due to public safety risks even at lower projections. The Owner refused to agree that such protection was required or appropriate. The BER concluded that Engineer A should continue to attempt to convince the owner of the potential for damage to future residents and the public, and, failing agreement on Engineer A’s proposed design standard, Engineer A should withdraw from the project.\n\nTurning to the current case, Engineer A does have an ethical obligation to address the impacts of the project on public health, safety, and welfare regardless of whether or not that is required by applicable law. The BER believes that Engineer A has an obligation to consider climate and weather changes in the future with respect to potential impacts on public health, safety, and welfare, where such impacts are reasonably likely and significant.\n\nEngineer A need not necessarily be a modelling expert. However, Engineer A needs to have sufficient understanding of hydrology, hydraulics, and coastal modeling to form a reasonable judgment that there is sufficient potential for flooding of other properties to merit a detailed, complex evaluation of future conditions. Based on the facts in this case, it is clear that Engineer A has such an understanding of the broad project issues.\n\nThe outcome of this case might have been different had Engineer A been comfortable with predicting that significant public health, safety, and welfare impacts were unlikely, in which case Engineer A might have ethically been able to proceed while noting both in writing and in public statements that more detailed analysis would be required to confirm that judgment.\n\nHowever, with the facts as presented, Engineer A should engage Client B in discussions about the need for the detailed evaluation and disclosure of the potential impacts on the public and alternatives for the project to mitigate those impacts, and the potential risk to Client B of not evaluating the potential impacts. If Client B remains unconvinced, Engineer A should propose to Client B that engineer a provides the potential concern that may necessitate more detailed evaluation in an engineering report for consideration by regulatory agencies and the public. Failing agreement by Client B to t either of these courses of action the BER believes that Engineer A should withdraw from the project.\n\nI.1.\n\nHold paramount the safety, health, and welfare of the public.\n\nI.4.\n\nAct for each employer or client as faithful agents or trustees.\n\nII.1.a.\n\nIf engineers' judgment is overruled under circumstances that endanger life or property, they shall notify their employer or client and such other authority as may be appropriate.\n\nII.2.a.\n\nEngineers shall undertake assignments only when qualified by education or experience in the specific technical fields involved.\n\nII.3.a.\n\nEngineers shall be objective and truthful in professional reports, statements, or testimony. They shall include all relevant and pertinent information in such reports, statements, or testimony, which should bear the date indicating when it was current.\n\nII.3.b.\n\nEngineers may express publicly technical opinions that are founded upon knowledge of the facts and competence in the subject matter.\n\nIII.1.b.\n\nEngineers shall advise their clients or employers when they believe a project will not be successful.\n\nIII.2.d.\n\nEngineers are encouraged to adhere to the principles of sustainable development1 in order to protect the environment for future generations.\n\tFootnote 1 \"Sustainable development\" is the challenge of meeting human needs for natural resources, industrial products, energy, food, transportation, shelter, and effective waste management while conserving and protecting environmental quality and the natural resource base essential for future development.\n\nEngineer A has an obligation to consider potential impacts on public health, safety, and welfare, regardless of whether that is required by applicable law, including changing weather patterns and climate.\n\n\t\tIf Engineer A is reasonably certain that the project will result in adverse impacts to public health, safety, and welfare, and if the Client B denies the requisite evaluation, Engineer A should include the concern regarding potential adverse public health, safety, and welfare impacts in an engineering report for consideration by regulatory agencies and the public.\n\nEngineer A has an obligation to consider potential impacts on public health, safety, and welfare, regardless of whether that is required by applicable law, including changing weather patterns and climate.\n\nIf Engineer A is reasonably certain that the project will result in adverse impacts to public health, safety, and welfare, and if the Client B denies the requisite evaluation, Engineer A should include the concern regarding potential adverse public health, safety, and welfare impacts in an engineering report for consideration by regulatory agencies and the public.",
    "url": "https://www.nspe.org/career-resources/ethics/public-health-safety-welfare-climate-change-induced-conditions",
    "pdf_url": null,
    "scraped_at": "2025-04-05T17:11:14.515677",
    "metadata": {
      "related_cases": [
        "Case 18-9"
      ],
      "codes_cited": [
        "Code II.3.b",
        "Code II.3.a",
        "Code I.1",
        "Code II.2.a",
        "Code I.4",
        "Code II.1.a",
        "Code III.1.b",
        "Code III.2.d"
      ],
      "principles": [
        "objectivity",
        "public safety",
        "safety",
        "honesty",
        "welfare",
        "health",
        "public health",
        "disclosure",
        "competency"
      ],
      "outcome": "unethical",
      "operationalization_techniques": [
        "Principle Instantiation",
        "Case Instantiation",
        "Conflicting Principles Resolution"
      ],
      "board_analysis": "s for the project to mitigate those impacts, and the potential risk to Client B of not evaluating the potential impacts. If Client B remains unconvinced, Engineer A should propose to Client B that engineer a provides the potential concern that may necessitate more detailed evaluation in an engineering report for consideration by regulatory agencies and the public. Failing agreement by Client B to t either of these courses of action the BER believes that Engineer A should withdraw from the project.\n\nI.1.\n\nHold paramount the safety, health, and welfare of the public.\n\nI.4.\n\nAct for each employer or client as faithful agents or trustees.\n\nII.1.a.\n\nIf engineers' judgment is overruled under circumstances that endanger life or property, they shall notify their employer or client and such other authority as may be appropriate.\n\nII.2.a.\n\nEngineers shall undertake assignments only when qualified by education or experience in the specific technical fields involved.\n\nII.3.a.\n\nEngineers shall be o\n[content truncated]",
      "ethical_questions": [
        "Does Engineer A have an ethical obligation to address or evaluate the impacts of a project on public health, safety, and welfare with respect to climate change induced conditions that have not yet occurred?",
        "Does Engineer A have an ethical obligation to address or evaluate the impacts of a project on public health, safety, and welfare with respect to climate change induced conditions that have not yet occurred?"
      ]
    }
  },
  {
    "case_number": "Case 64-7",
    "title": "II.2.a.",
    "year": 1964,
    "date": "April 05, 2025",
    "full_text": "Engineer M works as a building manager for a public entity and is aware that a new piece of equipment being installed in the facility has a requirement for a design release (a document filed with the state building commissioner’s office). Engineer M has no formal role in approving contracts or accepting equipment for the employing public entity . The design release requirements include provisions for a signature from a licensed professional on the application.\n\nFirm A designs and assembles the equipment, and Engineer M has monitored the progress of the equipment design and is familiar with who completed the various portions of the work. The design includes electrical and mechanical systems and also requires structural analysis; compliance with applicable provisions of the state building code is required for this equipment. As the time for final approval of the project to install the equipment approaches, Engineer M is shown a copy of a design release Firm A obtained from the state for the equipment.\n\nEngineer B is listed as the design professional of record on the state release. A review of the website for Engineer B’s firm shows their specialty is electrical work, and Engineer M was unaware of Engineer B’s involvement with any stage of the project until the design release was prepared.\n\nShould Engineer B have signed (certified) the application for design release for this equipment?\n\n\t\tWhat should Engineer M do?\n\nShould Engineer B have signed (certified) the application for design release for this equipment?\n\nWhat should Engineer M do?\n\nThe issue of an engineer’s role in a project and acceptance of responsible charge is a subject that the NSPE Board of Ethical Review (BER) has visited numerous times over the last five decades. As technology evolves and new engineering fields progress, our Code of Ethics also evolves, as does the definition of responsible charge. 1\n\nThe BER has visited the issue of sealing plans and responsible charge as far back as 1964. In BER Case 64-7, the policy of a state health department office was to use the District Sanitary Engineer’s seal and name on all plans and engineering documents when the assistant sanitary engineer performed the actual engineering review. The policy went so far as to specify, “that when the district sanitary engineer is absent the assistant sanitary engineer shall review the plans and applications for permits and, after approval, sign the name of the district sanitary engineer, even though the district sanitary engineer has not seen or reviewed the documents.”\n\nThe Board found that it was not unusual for an engineer to sign his name and title to engineering documents that were prepared or reviewed by his subordinates if he is familiar with the work and checked the work involved. Said the Board, “We see no objection, however, in the interests of clarity and continuity of authority, for the approval to indicate by stamp or printing the name of the district sanitary engineer, provided his name is followed by the name and signature of the assistant sanitary engineer. This will indicate that the approval is under the general authority of the district sanitary engineer and that the assistant sanitary engineer is acting within the scope of a delegation of authority to pass professional judgment on his own responsibility.”\n\nIn Case 64-7, the BER further made the distinction that, “the facts are that the assistant sanitary engineer on occasion reviews the engineering documents on his own responsibility and without the supervision or verification of the district sanitary engineer. In that case it is obvious that the assistant sanitary engineer takes sole responsibility for the decision to approve the plans or authorize the issuance of a permit. On that basis he alone should sign the engineering documents.”\n\nThe BER also evaluated responsible charge in Case 19-11. In this instance, Engineer A signed and sealed plans provided by the manufacturer with changes to the panel as well as an interface, designed by Engineer A, connecting it to existing speakers and alarm triggers. The Board concluded, “The facts are as follows: Engineer A did not have ‘responsible charge’ (direct control or personal supervision) over the work of [alarm manufacturer], an independent contractor; was not involved in the initial design of [alarm manufacturers], manufactured alarm and public address system; and did not have any authority or control over any changes made by [alarm manufacturer], to its drawings.”\n\nThe Board further added, “A far better course of action would be for Engineer A to seal only the interface drawings for the client. Also, if necessary, Engineer A should work with [alarm manufacturer], to have [alarm manufacturer], have another professional engineer sign and seal its work so that the work had been completed in a proper professional manner, consistent with State X laws and regulations.”\n\nUpon reading the facts of the present case, the equipment design is multidisciplinary and arguably complex, and the first impression (or prima facie evidence) implies that some wrongdoing in the form of rubberstamping has occurred. But Engineer M’s concern about rubberstamping reflects only a limited internet search and the firm’s website. It is acknowledged that equipment manufacturers don’t always employ engineers who are licensed in all 50 states, and some firms partner with engineers who have familiarized themselves sufficiently and worked on the equipment to claim responsible charge for the work. Simply because Engineer M was not personally working with this particular engineer (Engineer B) on this specific piece of equipment does not mean that Engineer B is not sufficiently familiar with the particular piece of equipment to be deemed in responsible charge. On the other hand, Engineer M has monitored the progress of the equipment design and she is familiar with who completed the various portions of the work. So, at a minimum, reasonable questions about design responsibility remain unanswered.\n\n1 One current definition of responsible charge, NSPE Position Statement No. 10-1778 (revised September 2019), states that “the professional engineer in responsible charge is actively engaged in the engineering process, from conception to completion. Engineering decisions must be personally made by the professional engineer or by others over which the PE provides supervisory direction and control authority. Reviewing drawings or documents after preparation without involvement in the design and development process does not satisfy the definition of responsible charge.”\n\nII.2.a.\n\nEngineers shall undertake assignments only when qualified by education or experience in the specific technical fields involved.\n\nII.2.b.\n\nEngineers shall not affix their signatures to any plans or documents dealing with subject matter in which they lack competence, nor to any plan or document not prepared under their direction and control.\n\nII.2.c.\n\nEngineers may accept assignments and assume responsibility for coordination of an entire project and sign and seal the engineering documents for the entire project, provided that each technical segment is signed and sealed only by the qualified engineers who prepared the segment.\n\nBased on the facts in the case, the BER does not have enough knowledge of Engineer B’s relationship with Firm A to support a conclusion as to Engineer B’s role in accepting responsible charge. Some state engineering boards recognize that engineers may have a role in a project and that they may sign and seal the documents that have been “critically examined and evaluated.”\n\n\t\tHealth, safety, and welfare considerations for this public entity project are such that Engineer M has reason for concern regarding the apparent acceptance of responsible charge by Engineer B. Engineer M should contact Engineer B and Firm A regarding Engineer B’s role in the project. Depending on the outcome, further steps may be legally and ethically necessary, including making a complaint to the licensing board.\n\nBased on the facts in the case, the BER does not have enough knowledge of Engineer B’s relationship with Firm A to support a conclusion as to Engineer B’s role in accepting responsible charge. Some state engineering boards recognize that engineers may have a role in a project and that they may sign and seal the documents that have been “critically examined and evaluated.”\n\nHealth, safety, and welfare considerations for this public entity project are such that Engineer M has reason for concern regarding the apparent acceptance of responsible charge by Engineer B. Engineer M should contact Engineer B and Firm A regarding Engineer B’s role in the project. Depending on the outcome, further steps may be legally and ethically necessary, including making a complaint to the licensing board.",
    "url": "https://www.nspe.org/career-resources/ethics/equipment-design-certification-plan-stamping",
    "pdf_url": null,
    "scraped_at": "2025-04-05T17:11:16.265674",
    "metadata": {
      "related_cases": [
        "Case 19-11",
        "Case 64-7"
      ],
      "codes_cited": [
        "Code II.2.c",
        "Code II.2.b",
        "Code II.2.a"
      ],
      "principles": [
        "public safety",
        "professional judgment",
        "safety",
        "welfare",
        "health",
        "competency"
      ],
      "outcome": "outcome not specified",
      "operationalization_techniques": [
        "Principle Instantiation",
        "Case Instantiation",
        "Conflicting Principles Resolution"
      ],
      "board_analysis": "onsible charge is actively engaged in the engineering process, from conception to completion. Engineering decisions must be personally made by the professional engineer or by others over which the PE provides supervisory direction and control authority. Reviewing drawings or documents after preparation without involvement in the design and development process does not satisfy the definition of responsible charge.”\n\nII.2.a.\n\nEngineers shall undertake assignments only when qualified by education or experience in the specific technical fields involved.\n\nII.2.b.\n\nEngineers shall not affix their signatures to any plans or documents dealing with subject matter in which they lack competence, nor to any plan or document not prepared under their direction and control.\n\nII.2.c.\n\nEngineers may accept assignments and assume responsibility for coordination of an entire project and sign and seal the engineering documents for the entire project, provided that each technical segment is signed and seal\n[content truncated]",
      "ethical_questions": [
        "Was the engineer's conduct regarding engineer m works as a building manager for a public entity and is aware that a new piece of equipment being installed in the facility has a requirement for a design release (a document filed with the state building commissioner’s office) ethical?"
      ]
    }
  },
  {
    "case_number": "Case 60-9",
    "title": "I.4.",
    "year": 1960,
    "date": "April 05, 2025",
    "full_text": "Engineer A works for an insurance company, and part of his work involves visits to remote mining sites to assess compliance with best practices as outlined by the company as well as compliance with codes, standards, and state and federal regulations. At a remote site visit to Mine M, Engineer A begins the day with a meeting with facility management to review prior visits, documentation of safety records, and other applicable information. Management at the remote site brought their safety compliance specialists to the site to assist with the visit and to respond quickly to Engineer A’s findings. As Engineer A prepares to begin inspection of the mine, he realizes he forgot to bring the necessary PPE—he does not have his safety boots. Mine M staff offer him a new pair of safety boots; they routinely make boots available to visitors to the mine who may not have the necessary PPE. Engineer A’s company has a policy that forbids accepting gifts valued at more than $100, and because he has recently purchased new safety boots, Engineer A knows the boots Mine M is offering are valued at more than $100. If he returns to his motel to get his own boots, he will be unable to complete the inspection, and the visit would have to be rescheduled because the mine owner’s safety specialists are not able to be on site the next day.\n\nWhat should Engineer A do?\n\nSince 1958, the NSPE Board of Ethical Review has considered at least 11 cases where engineers either offer or receive gifts of various types. A starting point for many of these cases is Case 60-9, in which three situations were analyzed. For the purposes of our case, the first situation is most relevant. A consulting engineer made it a practice to take certain staff engineers of a state agency to lunch or dinner several times a year and made it a practice to distribute Christmas gifts to staff engineers. In today’s dollars, the lunches are valued at $45, and the holiday gifts are about $90.\n\nIn this case from 1960, the Board noted that “the question of when a gift is intended to or becomes an inducement to influence one’s impartial decision, as distinguished from an expression of friendship or a social custom, has remained a perplexing one over the years.” They noted the size of the gift is an important factor along with established customs such a “picking up the tab” for business lunches. In 1960, because they felt it was impossible to understand the gifting intentions of the donor or donors, the Board stated “we must apply a criterion which reasonable men might reasonably infer from the circumstances; that the giving or acceptance of the benefit be a matter of ‘good taste,’ and such that among reasonable men it might not be of a nature which raises suspicions of favoritism.” They concluded that offering and accepting free lunches, dinners, and gifts of small value does not exceed the bounds of ethical behavior.\n\nBER Case 05-6 is similar in that Engineer A is a State Department of Transportation (SDOT) employee who works with consulting engineers and contractors. At the completion of successful projects, the contractors and engineers have offered to Engineer A items including tickets to box seats at major league sporting events along with invitations to receptions, dinners, and golf outings with other project participants. The Board applied Case 60-9 as a guideline and concluded that making or accepting the offers described above did not constitute an ethical violation. They again pointed to cultural acceptance within the general business community of these situations, provided they were not extravagant or excessive (e.g., an expense-paid trip to the Super Bowl). The Board was careful to point out that although these situations may not constitute a violation of the NSPE Code of Ethics, Engineer A as well as the engineering firms and contractors may be in violation of SDOT rules and regulations.\n\nFinally, BER Case 12-6 involves a situation where Engineer A and his firm, IJK Engineering arranged with a national water association to purchase, for a fixed fee, an unlimited number of daily passes to the water association’s trade show. A normal daily pass for the trade show is valued at $150. IJK Engineering distributes passes to clients and potential clients and encourages them to make additional copies to give to other engineers in accordance with the arrangements made with the water works association. The Board noted that some engineers take a “hard-line view that any gift, even the giving or taking of a de minimis gift of little value is unacceptable.” They also reviewed the cases above and decided that Engineer A and IJK Engineering acted ethically in distributing passes. Further, it was ethical for recipient engineers to accept the passes. IJK Engineering engaged in what is generally accepted marketing activity to encourage access to an industry trade program and to “aid in the dispersion of information and knowledge about water issues in order to create general business good will.”\n\nIn the case at hand, the boots Engineer A is offered are not “extraordinary or excessive”; Mine M makes boots available to visitors generally. The “hard-line” approach referred to in Case 12-6 can cite Code Sections II.4.b., II.4.c., and III.5.b. as provisions that prevent Engineer A from accepting and using the boots. Further, Engineer A’s company has a policy that prohibits accepting gifts valued at more than $100, and Engineer A has good reason to believe the value of the boots is more than this amount.\n\nEngineer A also has an obligation to act for his employer and client as a faithful agent or trustee. His firm and the client have taken pains to assemble people and information at a remote site to facilitate his inspection; these efforts may be wasted if the inspection is not completed that day.\n\nMany resources for ethical engineering decision-making identify steps for breaking down the thought process.1 Although Engineer A likely does not have the time to formally follow all these steps, Engineer A can look at the big picture and identify that both employer and client have expended considerable resources to complete a timely inspection—both are penalized if the inspection does not move forward. Engineer A can also identify alternate approaches to the solve the problem. While company policy prohibits employees from accepting gifts, Engineer A may be able to simply use the boots during the visit and return them or to pay for them. Options for action include professionally and respectfully declining the offer of boots and postponing the inspection, or accepting the boots and informing the employer.\n\nTwo other items are of note in this discussion. The BER, in Case 60-9 referred to “good taste” in the process of making decisions regarding gifts. Certainly “good taste” has changed with time, and it is important to acknowledge that change. An acceptable lunch in 1960 may be viewed differently today. Finally, this discussion made no reference to state law governing the practice of engineering.\n\nI.4.\n\nAct for each employer or client as faithful agents or trustees.\n\nI.6.\n\nConduct themselves honorably, responsibly, ethically, and lawfully so as to enhance the honor, reputation, and usefulness of the profession.\n\nII.4.b.\n\nEngineers shall not accept compensation, financial or otherwise, from more than one party for services on the same project, or for services pertaining to the same project, unless the circumstances are fully disclosed and agreed to by all interested parties.\n\nII.4.c.\n\nEngineers shall not solicit or accept financial or other valuable consideration, directly or indirectly, from outside agents in connection with the work for which they are responsible.\n\nIII.5.a.\n\nEngineers shall not accept financial or other considerations, including free engineering designs, from material or equipment suppliers for specifying their product.\n\nIt would be ethical for Engineer A to use the safety boots during his inspection of the mine. When the inspection visit is complete, Engineer A may either return the safety boots or pay for them. Engineer A should report the incident and circumstances to the employer.",
    "url": "https://www.nspe.org/career-resources/ethics/gifts-mining-safety-boots",
    "pdf_url": null,
    "scraped_at": "2025-04-05T17:11:17.953428",
    "metadata": {
      "related_cases": [
        "Case 60-9",
        "Case 12-6",
        "Case 05-6"
      ],
      "codes_cited": [
        "Code I.6",
        "Code II.4.c",
        "Code II.4.b",
        "Code III.5.b",
        "Code III.5.a",
        "Code I.4"
      ],
      "principles": [
        "objectivity",
        "public safety",
        "safety",
        "welfare",
        "disclosure"
      ],
      "outcome": "unethical",
      "operationalization_techniques": [
        "Principle Instantiation",
        "Case Instantiation",
        "Conflicting Principles Resolution"
      ],
      "board_analysis": "site to facilitate his inspection; these efforts may be wasted if the inspection is not completed that day.\n\nMany resources for ethical engineering decision-making identify steps for breaking down the thought process.1 Although Engineer A likely does not have the time to formally follow all these steps, Engineer A can look at the big picture and identify that both employer and client have expended considerable resources to complete a timely inspection—both are penalized if the inspection does not move forward. Engineer A can also identify alternate approaches to the solve the problem. While company policy prohibits employees from accepting gifts, Engineer A may be able to simply use the boots during the visit and return them or to pay for them. Options for action include professionally and respectfully declining the offer of boots and postponing the inspection, or accepting the boots and informing the employer.\n\nTwo other items are of note in this discussion. The BER, in Case 60-9 refe\n[content truncated]",
      "ethical_questions": [
        "Was the engineer's conduct regarding engineer a works for an insurance company, and part of his work involves visits to remote mining sites to assess compliance with best practices as outlined by the company as well as compliance with codes, standards, and state and federal regulations ethical?"
      ]
    }
  },
  {
    "case_number": "Case 00-5",
    "title": "II.1.",
    "year": 2000,
    "date": "April 05, 2025",
    "full_text": "Engineer A is a professional engineer who serves as the superintendent and chief engineer for the Metropolitan Water Commission (MWC). In order to reduce municipal expenditures and lower water rates, the MWC has been considering changing its water supply source from purchasing water from remote reservoirs from another regional authority to using the local river as the MWC’s source. Engineer B, a consulting engineer retained by the MWC charged with evaluating water treatment needs for the change in water source, provided a report to Engineer A recommending extensive capital investments and a three-year timeline for further evaluation of water quality, design, and construction of improvements. The improvements are needed prior to the change in water source to ensure that sufficient corrosion control is provided so that old service pipes in the MWC service area don’t leach lead at levels in excess of drinking water standards. Both Engineer A and Engineer B met with the MWC at a meeting sparsely attended by the public and recommended that the change in water source be substantially delayed until improvements could be completed. Despite those recommendations, the MWC voted to proceed simultaneously with the accelerated evaluation and design of needed water treatment improvements and the change in water source.\n\nWhat are the ethical obligations of Engineer A and Engineer B in this circumstance?\n\n\t\tWhat should Engineer A and Engineer B do?\n\nWhat are the ethical obligations of Engineer A and Engineer B in this circumstance?\n\nWhat should Engineer A and Engineer B do?\n\nThe role of the professional engineer in protecting the public health, safety, and welfare is fundamental to the practice of engineering and is the overriding charge in the NSPE Code of Ethics. This fundamental canon has been considered many times in past cases.\n\nIn a case that has been cited many times, BER Case No. 00-5 centered on the reopening of a dangerous, closed bridge by a nonengineer public works director. The NSPE Board of Ethical Review stressed the importance of holding the public safety paramount. More recently, in BER Case No. 19-10 Engineer A was hired by Client B to provide a building investigation after a fire. Engineer A determined that the building was unstable. Additionally, Engineer A determined that recent structural changes to the building, which was issued a certificate of occupancy by a county building official, might have caused new structural problems. In its conclusion, the Board of Ethical Review wrote, “Engineer A had an obligation to continue to pursue a resolution of the matter by working with Client B and in contacting in writing the supervisor of the county official, the fire marshal, or any other agency with jurisdiction, advising them of the structural deficiencies.”\n\nPrevious cases have also addressed the duty to report when safety concerns exist. In BER Case No. 89-7, Engineer A was retained to investigate the structural components of an apartment building. While the building was structurally sound, Engineer A was informed that there were deficiencies in electrical and mechanical systems that violated applicable codes and standards. The agreement between the client and Engineer A indicated that the structural report was to remain confidential. Engineer A did not report the electrical and mechanical deficiencies to the appropriate authorities. In this case, the NSPE Board of Ethical Review determined that “it was unethical for Engineer A not to report the safety violations to the appropriate public authorities,” stating “we believe Engineer A could have taken other steps to address the situation, not the least of which was his paramount professional obligation to notify the appropriate authority if his professional judgment is overruled under circumstances where the safety of the public is endangered.”\n\nAs stated in the previous cases, the need to hold paramount the safety, health, and welfare of the public is well established. The remaining referenced Code sections provide a step-by-step path forward in this case for Engineer A and Engineer B with Section II.1. in mind. It is important to note that Engineers A and B have presented the findings and recommendations jointly and, as such, their actions should be in concert, although not identical.\n\nThe engineering judgments of Engineer A and Engineer B were overruled by the MWC. If Engineers A and B believe life or property is endangered, Section II.1.a. provides that not only shall the employer or client be notified, but also all other appropriate authorities. It appears that the state regulatory agency has been contacted; however, there should be a formal presentation of the facts, findings, and recommendations. This action may also address Section II.1.c. As Engineers A and B are required to hold paramount the safety, health, and welfare of the public, and as this duty is a fundamental canon of the NSPE Code of Ethics, the consent of the MWC is not required.\n\nAdditionally, if project success is defined as “the public will not be endangered at all,” then Engineers A and B should advise their client that they believe the project will not be successful. Again, as with the state regulatory agency, this advisement should proceed in a formal manner.\n\nThe formal presentations satisfy Engineer A’s and Engineer B’s duty to report. However, in the event that these formal presentations fail to sway the MWC to change its plans, given the gravity of the danger to public health and safety, Engineers A and B have an obligation to further pursue the matter.\n\nII.1.\n\nEngineers shall hold paramount the safety, health, and welfare of the public.\n\nII.1.a.\n\nIf engineers' judgment is overruled under circumstances that endanger life or property, they shall notify their employer or client and such other authority as may be appropriate.\n\nII.1.c.\n\nEngineers shall not reveal facts, data, or information without the prior consent of the client or employer except as authorized or required by law or this Code.\n\nIII.1.b.\n\nEngineers shall advise their clients or employers when they believe a project will not be successful.\n\nIn fulfillment of their ethical obligations under the Code, Engineers A and B should formally communicate their concerns to the MWC, including that they believe the project will not be successful.\n\n\t\tBoth Engineers A and B have ethical obligations to notify the MWC and other appropriate authorities that prematurely changing the water source puts the public health and safety at risk. Furthermore, Engineers A and B have independent obligations to formally and in writing report their concerns to the state regulatory agency. While they may provide a joint and cooperative report, each has an independent obligation. Neither the consent nor opposition of the client is a factor in their fulfillment of this obligation.\n\nIn fulfillment of their ethical obligations under the Code, Engineers A and B should formally communicate their concerns to the MWC, including that they believe the project will not be successful.\n\nBoth Engineers A and B have ethical obligations to notify the MWC and other appropriate authorities that prematurely changing the water source puts the public health and safety at risk. Furthermore, Engineers A and B have independent obligations to formally and in writing report their concerns to the state regulatory agency. While they may provide a joint and cooperative report, each has an independent obligation. Neither the consent nor opposition of the client is a factor in their fulfillment of this obligation.",
    "url": "https://www.nspe.org/career-resources/ethics/public-health-safety-welfare-drinking-water-quality",
    "pdf_url": null,
    "scraped_at": "2025-04-05T17:11:19.651243",
    "metadata": {
      "related_cases": [
        "Case 00-5",
        "Case 19-10",
        "Case 89-7"
      ],
      "codes_cited": [
        "Code II.1.a",
        "Code III.1.b",
        "Code II.1",
        "Code II.1.c"
      ],
      "principles": [
        "public safety",
        "professional judgment",
        "safety",
        "welfare",
        "confidentiality",
        "professional responsibility",
        "health",
        "public health",
        "disclosure"
      ],
      "outcome": "unethical",
      "operationalization_techniques": [
        "Principle Instantiation",
        "Case Instantiation",
        "Conflicting Principles Resolution"
      ],
      "board_analysis": "satisfy Engineer A’s and Engineer B’s duty to report. However, in the event that these formal presentations fail to sway the MWC to change its plans, given the gravity of the danger to public health and safety, Engineers A and B have an obligation to further pursue the matter.\n\nII.1.\n\nEngineers shall hold paramount the safety, health, and welfare of the public.\n\nII.1.a.\n\nIf engineers' judgment is overruled under circumstances that endanger life or property, they shall notify their employer or client and such other authority as may be appropriate.\n\nII.1.c.\n\nEngineers shall not reveal facts, data, or information without the prior consent of the client or employer except as authorized or required by law or this Code.\n\nIII.1.b.\n\nEngineers shall advise their clients or employers when they believe a project will not be successful.\n\nIn fulfillment of their ethical obligations under the Code, Engineers A and B should formally communicate their concerns to the MWC, including that they believe t\n[content truncated]",
      "ethical_questions": [
        "What are the ethical obligations of Engineer A and Engineer B in this circumstance?",
        "What are the ethical obligations of Engineer A and Engineer B in this circumstance?"
      ]
    }
  },
  {
    "case_number": "Case 75-7",
    "title": "II.3.",
    "year": 1975,
    "date": "April 05, 2025",
    "full_text": "The Board of Licensure for Professional Engineers (“the PE Board”) in State X consists of six professional engineers and a public member. The governor of State X has recently appointed two new board members, Engineer A and Engineer B, to fill two expiring terms. Engineer A otherwise is a member of the board of directors of a membership engineering organization in that state. Engineer B serves as a committee chair of a national engineering organization. At the first meeting of the newly constituted PE Board, the public member asks whether these outside professional activities constitute a conflict of interest with respect to PE Board service. Engineer A responds that (1) although her state organization has been advocating for the improvement of the state’s continuing professional development requirements to the PE Board and the legislature, (2) she has not been making those presentations, but (3) that the advocacy has been discussed at meetings of the state organization’s board of directors. Engineer B responds that he is the chair of an engineering education committee of the national engineering organization, with a role, in part, to recommend changes to his engineering discipline’s engineering education accreditation criteria, for subsequent review and approval by ABET. The PE Board begins to discuss these professional involvements.\n\nDoes Engineer A have a conflict of interest with respect to PE Board service?\n\n\t\tDoes Engineer B have a conflict of interest with respect to PE Board service?\n\nDoes Engineer A have a conflict of interest with respect to PE Board service?\n\nDoes Engineer B have a conflict of interest with respect to PE Board service?\n\nProfessional engineers often find themselves involved with and representing multiple organizational interests in their professional activities, and this can give rise to organizational conflicts of interest. Conflicts of interest are among the most prevalent ethical concerns facing engineering practitioners. Over the years, the Board of Ethical Review has considered numerous cases involving engineers who have interests in conflict with the interests of clients, employees, or other engineers. At one time, the NSPE Code of Ethics specifically prohibited engineers from becoming involved in cases or situations in which a conflict of interest was present. This was based on the view that professional engineers must at all times be above reproach and avoid any situation that could be perceived as compromising their professional judgment and integrity as independent professionals.\n\nOver time, the NSPE Code and the Board of Ethical Review have moderated to the point of recognizing that certain types of conflicts of interest are difficult, if not impossible, to avoid and that the more realistic approach for individual engineers faced with this dilemma is to fully disclose the nature and extent of the conflict to the appropriate parties involved or impacted by the conflict. This is based on the view that the parties most affected by the conflict and who have the most at stake (e.g., clients, employers, other engineering firms, etc.) are in the best position to determine whether their interests will be compromised by the conflict. While sometimes perceived conflicts of interest are resolved by the parties as a result of full disclosure, in other instances the conflicts are deeper and require the engineer to disassociate from a specific project.\n\nPrevious Board of Ethical Review cases provide some background for considering this case. In BER Case No. 18-2, an engineer was a board member of an engineering technical society and was actively encouraging the society to enter into an agreement with Jones Publishing, a technical journal publisher, to annually publish technical articles and content generated by the society’s members. During meetings of the engineering technical society’s board of directors, the engineer expressed strong resistance to exploring other publishing options to determine what terms and conditions other technical journal publishers might offer to the society. Under a separate private, undisclosed side agreement with Jones Publishing, the engineer was to receive a visible and prestigious position as chairman of the editorial board for another journal published by Jones Publishing if the engineering technical society agreed to enter into the agreement with the company.\n\nIn this case, the BER stated the engineer had a trust relationship in his role as a board member of the engineering technical society and, therefore, must provide full disclosure regarding the side agreement with Jones Publishing to become chairman of the editorial board prior to the engineering society’s formal consideration and voting on the matter. The BER believes that conflicts of interest do not necessarily involve only financial considerations, and organizational conflicts can also be significant. In the BER’s view, the engineer also should have recused himself from his role as a board member acting on this issue for the engineering technical society or, if appropriate, resigned as a board member of the engineering technical society.\n\nA second example is BER Case No. 70-6. Here, as a member of a state legislature, Engineer A is on a committee that initially makes appropriations to local communities for certain public works projects. He is also a partner in an engineering firm in the state. Following an appropriation to local communities in the state for projects designed to combat air pollution as recommended by the legislative committee of which Engineer A is a member, the firm of which Engineer A is a member submits its qualifications for a project to be financed by an appropriation from the legislature. At the meeting of the town council in the town in which the firm of Engineer A is located, objection is voiced to the selection of the firm in which Engineer A is a partner because of his influential position in securing the appropriation.\n\nIn finding that the firm in which Engineer A is a partner may ethically perform engineering services financed by an appropriation secured in part by the position of Engineer A in the legislature, the Board noted that actual awards to the selected engineering firms were to be made by the governing bodies of the local communities. But Engineer A was not a member of the town council, and the facts do not indicate Engineer A used his political office as a means to enhance the opportunities for his firm to benefit from the legislative action.\n\nA third example is BER Case No. 75-7. In this case, John Doe, a civil engineer in private practice, is engaged principally in topographical survey work and the design of water and sewer facilities. He is an appointed member of a commission that controls and determines the issuance of water and sewer connection permits to private owners and developers. The commission’s authority is of such a nature that its decisions have a decisive impact on land development projects and the construction of facilities of all kinds by private owners. While serving on the commission, Doe performed extensive topographic survey work and designed the water and sewer systems for a new private facility that had earlier received approval for necessary water and sewer connections from the commission while he was a member of the commission. In response to public criticism for an alleged conflict of interest on his part, Doe noted that he had abstained from the discussion and vote on the permit application.\n\nBased on the fact that Doe was aware of a potential conflict of interest and he abstained from the discussion and vote, and that it was not established that Doe had influenced the decision on the permit, the Board concluded it was ethical for Doe to perform the engineering and topographic survey work for a private client while serving on the commission when the water and sewer permits were issued. However, the Board did publish a dissenting view that advocated that Doe’s involvement was simply too close and he should resign from the commission.\n\nTurning to the facts in this case, the BER believes that Engineer A should not be part of any discussion where she is advocating for the improvement of the state’s continuing professional development requirements to the PE Board and legislature. In this manner, her situation most closely parallels that of Case No. 75-7.\n\nIn many states, the legislature establishes the law for continuing education requirements and the PE Board enforces that law and establishes the rules. PE Board members typically take an oath to uphold the US and State Constitutions, and to abide by the law established by the state legislature and the rules and regulations adopted by the PE Board. Members of the board of directors of an engineering professional organization typically take an oath to represent the interests of member professionals. If the member professional organization is advocating engineering issues before the legislature or the PE Board, a PE Board member who also serves on the board of the member organization would face a direct conflict. Even absent such direct advocacy, membership on both boards may still present the appearance of a conflict of interest to some members of the public. Membership in engineering professional organizations presents no such conflicts of interest, as engagement in engineering and professional issues is of benefit to PE Board members.\n\nThe BER believes that Engineer A has a conflict of interest and that she should resign as a member of the board of directors of her engineering organization if she desires to serve on her state PE board. In the words of Case 75-7, her involvement “is simply too close.”\n\nThe BER believes that Engineer B’s situation is completely different. Engineer B is the chair of an engineering committee of a national engineering organization, where he recommends changes to his engineering discipline’s engineering education accreditation criteria for ABET. Thus, the situation of Engineer B more closely approximates that described in Case No. 70-6. The BER does not believe that this is a conflict of interest because individual state PE boards have no jurisdiction over ABET’s engineering education criteria. All engineering disciplines have a society that is responsible for establishing discipline-specific program criteria. State licensing board members have nothing to do with ABET’s discipline-specific criteria. Therefore, the BER does not believe that Engineer B has a conflict of interest.\n\nII.3.\n\nEngineers shall issue public statements only in an objective and truthful manner.\n\nII.3.c.\n\nEngineers shall issue no statements, criticisms, or arguments on technical matters that are inspired or paid for by interested parties, unless they have prefaced their comments by explicitly identifying the interested parties on whose behalf they are speaking, and by revealing the existence of any interest the engineers may have in the matters.\n\nII.4.a.\n\nEngineers shall disclose all known or potential conflicts of interest that could influence or appear to influence their judgment or the quality of their services.\n\nII.4.d.\n\nEngineers in public service as members, advisors, or employees of a governmental or quasi-governmental body or department shall not participate in decisions with respect to services solicited or provided by them or their organizations in private or public engineering practice.\n\nII.4.e.\n\nEngineers shall not solicit or accept a contract from a governmental body on which a principal or officer of their organization serves as a member.\n\nIII.2.a.\n\nEngineers are encouraged to participate in civic affairs; career guidance for youths; and work for the advancement of the safety, health, and well-being of their community.\n\nIII.2.e.\n\nEngineers shall continue their professional development throughout their careers and should keep current in their specialty fields by engaging in professional practice, participating in continuing education courses, reading in the technical literature, and attending professional meetings and seminars.\n\nIII.5.\n\nEngineers shall not be influenced in their professional duties by conflicting interests.\n\nEngineer A has a conflict of interest. While public service does not preclude Engineer A from being a member of the state engineering organization, the BER recommends that Engineer A should resign her position as a member of the board of directors of her engineering organization if she desires to serve on her state PE board.\n\n\t\tEngineer B does not have a conflict of interest according to the NSPE Code of Ethics.\n\nEngineer A has a conflict of interest. While public service does not preclude Engineer A from being a member of the state engineering organization, the BER recommends that Engineer A should resign her position as a member of the board of directors of her engineering organization if she desires to serve on her state PE board.\n\nEngineer B does not have a conflict of interest according to the NSPE Code of Ethics.\n\nDISSENTING OPINION (AS TO ENGINEER A ONLY)\n\tOne description of a conflict of interest is a situation in which an individual has competing interests or loyalties. Martin and Schinzinger, in their text, Ethics in Engineering1, state: We can refine our definition of conflict of interest when two conditions are met:\n\nThe professional is in a relationship or role that requires exercising good judgment on behalf of the interests of an employer or client.\n\n\t\tThe professional has some additional or side interest that could threaten good judgment in serving the interests of the employer or client—either the good judgment of that professional or the judgment of a typical professional in that situation.\n\nThe professional is in a relationship or role that requires exercising good judgment on behalf of the interests of an employer or client.\n\nThe professional has some additional or side interest that could threaten good judgment in serving the interests of the employer or client—either the good judgment of that professional or the judgment of a typical professional in that situation.\n\nIn the case of Engineer A, service on both boards requires exercising good judgment; the first condition for a conflict of interest is met. When serving on the PE Board, the discussion of this case established that the ultimate client is the public. Similarly, a fundamental canon of the NSPE Code of Ethics states that in the performance of their professional duties, engineers shall hold paramount the public health, safety, and welfare. Engineer A’s service on both boards is in the interest of the public and judgment will be exercised on the public’s behalf.\n\nFurther, NSPE’s Code of Ethics indicates that an engineer’s professional obligations include striving to serve the public interest; listed activities include service in civic affairs and continued professional development throughout one’s career. These obligations do not fall solely to board members of professional engineering organizations—they apply to all engineers. Advocacy for development and maintenance of professional competence is not an additional or side interest that threatens Engineer A’s good judgment; it is an integral part of Engineer A’s obligation as an engineer. The second condition in Martin and Schinzinger’s definition is not met.\n\nIn case 75-7, the BER stated “Some very thin and difficult lines must be drawn in applying that principle lest we inadvertently hold that an engineer involved in work generally subject to public agency action may never serve on public bodies which even remotely relate to his general field of practice.”\n\nDissenting Opinion Conclusion (as to Engineer A only):\n\tEngineering A must disclose status as a board member of a membership engineering organization; however, participation on both boards does not present a conflict of interest during regular PE Board activities . In the event the PE Board considers a rule that the engineering organization is advocating, recusal from the vote is the appropriate action for Engineer A.\n\n1 Martin, Mike W., Schinzinger, Roland, Ethics in Engineering, 4th Edition (McGraw-Hill, 2005), p. 159.",
    "url": "https://www.nspe.org/career-resources/ethics/conflict-interest-pes-serving-state-licensure-boards",
    "pdf_url": null,
    "scraped_at": "2025-04-05T17:11:21.358810",
    "metadata": {
      "related_cases": [
        "Case 70-6",
        "Case 18-2",
        "Case 75-7"
      ],
      "codes_cited": [
        "Code II.4.a",
        "Code II.3",
        "Code III.2.a",
        "Code II.3.c",
        "Code II.4.d",
        "Code III.5",
        "Code II.4.e",
        "Code III.2.e"
      ],
      "principles": [
        "objectivity",
        "public safety",
        "professional judgment",
        "safety",
        "honesty",
        "welfare",
        "conflicts of interest",
        "professional responsibility",
        "health",
        "public health",
        "disclosure",
        "competency"
      ],
      "outcome": "ethical",
      "operationalization_techniques": [
        "Principle Instantiation",
        "Case Instantiation",
        "Conflicting Principles Resolution"
      ],
      "board_analysis": "ith respect to services solicited or provided by them or their organizations in private or public engineering practice.\n\nII.4.e.\n\nEngineers shall not solicit or accept a contract from a governmental body on which a principal or officer of their organization serves as a member.\n\nIII.2.a.\n\nEngineers are encouraged to participate in civic affairs; career guidance for youths; and work for the advancement of the safety, health, and well-being of their community.\n\nIII.2.e.\n\nEngineers shall continue their professional development throughout their careers and should keep current in their specialty fields by engaging in professional practice, participating in continuing education courses, reading in the technical literature, and attending professional meetings and seminars.\n\nIII.5.\n\nEngineers shall not be influenced in their professional duties by conflicting interests.\n\nEngineer A has a conflict of interest. While public service does not preclude Engineer A from being a member of the state eng\n[content truncated]",
      "ethical_questions": [
        "Was the engineer's conduct regarding the board of licensure for professional engineers (“the pe board”) in state x consists of six professional engineers and a public member ethical?"
      ]
    }
  }
]