{
  "title": "I.1.",
  "description": "Engineer A works for an organization that for years has operated a fossil-fueled co-generation facility primarily to supply thermal energy for process needs. The facility has the capability to produce electric energy when thermal energy needs are satisfied, in fact, there are times when a significant portion of the organization’s electric energy is supplied by the co-generation facility. The generator is approaching the end of its useful life and will require a substantial investment to remain operational.\n\nRecently, stakeholders have expressed interest in reducing the organization’s carbon footprint, and these stakeholders suggest that the facility eliminate the generator and replace it with solar panels. After careful study of the facility electric load profile and the capability of the proposed solar energy system, Engineer A is satisfied that under normal conditions, the system of solar panels can supply electric energy equivalent to that provided by the existing generator. Capital constraints prevent the organization from installing a system of batteries to store energy for use at night or in bad weather, but the cost of installing the solar panels is essentially the same as the cost to rebuild the gen\u0002erator.\n\nWhen discussing the analysis of the electric load profile with a representative of the local electric utility, Engineer A learns that the utility resource planners reviewed their current generation mix and believe that during extreme weather events, they may be forced to institute rolling outages to keep system generating facilities on-line.\n\nEngineer A is preparing a report that will be presented to the board to consider the new solar project, and is convinced that the solar project, when considered in isolation, is viable and will satisfy those stakeholders interested in reducing the organization’s carbon footprint. Engineer A also realizes that a move to solar production without storage may stress the local utility generation mix even more, increasing the likelihood of rolling blackouts.\n\nShould Engineer A include information about the utility generation mix and rolling blackouts in the report to the board?\n\n\t\tShould Engineer A include information about cost of battery storage and the potential consequences of not having battery storage?\n\nShould Engineer A include information about the utility generation mix and rolling blackouts in the report to the board?\n\nShould Engineer A include information about cost of battery storage and the potential consequences of not having battery storage?\n\nAs a registered professional, Engineer A is obliged to include relevant and pertinent information in a report to the board. A report that does not contain information about the reliability of the utility source will not help them make an informed decision.\n\nAn ethical corollary to the organization’s decision to replace an on-demand, fossil-fueled generator with solar production without storage is worthy of discussion. With the current co-generation facility and a like-in-kind replacement, a presumably large electric load served by the utility can either stand alone or be operated to greatly reduce the electric load on a power system that will be stressed during extreme weather events.\n\nIf the solar production without storage option moves forward, the organization will increase its green footprint and will support a laudable goal of increasing environmentally friendly energy production. But this option may also increase the likelihood of future rolling blackouts. It is not difficult to imagine, for example, the stress placed upon elderly or confined individuals as well as those with medical conditions if they are left without a comfortable environment during an extreme weather event such as California and Texas recently experienced - and which led to rolling blackouts. What guidance can Engineer A rely upon to address a potential conflict between competing public goods?\n\nBER Case 98-5 describes how Engineer Adam serves as director of a building department in a major city. Engineer Adam has been concerned that as a result of a series of budget cutbacks and more rigid code enforcement requirements, the city has been unable to provide a sufficient number of qualified individuals to perform adequate and timely building inspections. Each code official member of Engineer Adam’s staff is often required to make as many as 60 code inspections per day. Engineer Adam believes there is no way even the most conscientious code official can make 60 adequate, much less thorough, inspections in one day, particularly under the newer, more rigid code requirements for the city. These new code requirements greatly enhance and protect the public’s health and safety. The code officials are caught between the responsibility to be thorough in their inspections and the city’s desire to hold down costs and generate revenue from inspection fees. Engineer Adam is required to sign off on all final inspection reports. Engineer Adam meets with the chairman of the local city council to discuss his concerns. The chairman indicates that he is quite sympathetic to Engineer Adam’s concerns and would be willing to issue an order to permit the hiring of additional code officials for the building department. At the same time, the chairman notes that the city is seeking to encourage more businesses to relocate into the city in order to provide more jobs and a strengthened tax base. In this connection, the chairman seeks Engineer Adam’s concurrence on a city ordinance that would permit certain specified buildings under construction to be “grandfathered” under the older existing enforcement requirements and not the newer, more rigid requirements now in effect.\n\nIn finding that it was not ethical for Engineer Adam to concur with the chairman’s proposal – a politically-motivated ‘Faustian bargain’ to hire additional building code officials – the BER affirmed that engineers “must hold the public health and safety paramount.” Engineer Adam “had a responsibility to insist, however strongly and vociferously, that public officials and decision-makers take steps and corrective steps if necessary to see that this obligation is fulfilled.” The BER further noted “righting a wrong with another wrong” does grave damage to the public health and safety, and that long-term public welfare (a valid building code enforcement process) cannot be undermined for short-term gain (grandfathering specified buildings in the name of increased jobs and tax revenues).\n\nRecent BER Case 20-4 addressed a public board (a municipal water commission) choosing to change the source of their potable water system to reduce public expenditures despite the recommendations of two engineers that further study was needed to ensure public safety. The BER found that the engineers have an obligation to formally communicate their concerns to the water commission. The BER also found that given the gravity of the potential danger to public health and safety, the engineers have an obligation to formally report their concerns to the state regulatory agency.\n\nBER Case 16-5 is also instructive; it deals with an engineer working on a team developing a driverless/ autonomous vehicle operating system. The development team was tasked with considering outcomes to choose in the event of an unavoidable vehicle crash – does the system choose the option that reduces the harm to vehicle occupants only, or should the system operate in a way that will minimize the harm that is done to anyone involved in the accident? The conclusions in BER Case 16-5 suggest the engineer fully and actively participate as a member of the engineering risk management team and express clearly and unambiguously concerns regarding safety of the operating system. The BER also suggested that, if necessary, the engineer recommend further study before the operating system is utilized.\n\nThis discussion has so far not addressed the obligation of Engineer A in this case to act as a faithful agent or trustee for the employer. Given the facts presented in this case, the solar generation system without storage will provide energy generation equivalent to the existing fossil-fueled generator at a similar cost; the system also reduces the organization’s carbon footprint. At first glance, this finding in conjunction with the earlier conclusion that system reliability data be included in the report to board may seem to satisfy Engineer A’s obligations. Note that “equivalent” as used to this point in the discussion has not addressed reliability. The proposed solar generation system without storage may produce the same energy that the existing fossil-fueled generator does, but it will not be as reliable. Further, a system without energy storage decreases the reliability of the entire local electric power system. Installing a system without storage may result in rolling blackouts and facility interruptions and thus not be a success. Therefore, Engineer A has an obligation to present this information in a report to the board.\n\nThe board may choose to rebuild/refurbish the fossil-fueled generator because it provides function and reliability at a lower cost than a solar production system with storage.\n\nSome may argue that continuing to operate a fossil-fueled generator is inconsistent with public health, safety, and welfare, while others will point to the increased reliability of the fossil-fueled generator as a demonstration of greater concern for public welfare. The ethical objective is an informed policy and project decision-making process.\n\nI.1.\n\nHold paramount the safety, health, and welfare of the public.\n\nI.6.\n\nConduct themselves honorably, responsibly, ethically, and lawfully so as to enhance the honor, reputation, and usefulness of the profession.\n\nII.1.c.\n\nEngineers shall not reveal facts, data, or information without the prior consent of the client or employer except as authorized or required by law or this Code.\n\nII.3.a.\n\nEngineers shall be objective and truthful in professional reports, statements, or testimony. They shall include all relevant and pertinent information in such reports, statements, or testimony, which should bear the date indicating when it was current.\n\nII.3.b.\n\nEngineers may express publicly technical opinions that are founded upon knowledge of the facts and competence in the subject matter.\n\nII.4.\n\nEngineers shall act for each employer or client as faithful agents or trustees.\n\nIII.1.b.\n\nEngineers shall advise their clients or employers when they believe a project will not be successful.\n\nIII.2.d.\n\nEngineers are encouraged to adhere to the principles of sustainable development1 in order to protect the environment for future generations.\n\tFootnote 1 \"Sustainable development\" is the challenge of meeting human needs for natural resources, industrial products, energy, food, transportation, shelter, and effective waste management while conserving and protecting environmental quality and the natural resource base essential for future development.\n\nEngineer A has an ethical obligation to include information about the utility generation mix and potential rolling blackouts in a report to the organization’s board.\n\n\t\tEngineer A’s report should also include information about cost of battery storage and the potential consequences of not having battery storage on system reliability relative to public safety, health, and welfare.\n\nEngineer A has an ethical obligation to include information about the utility generation mix and potential rolling blackouts in a report to the organization’s board.\n\nEngineer A’s report should also include information about cost of battery storage and the potential consequences of not having battery storage on system reliability relative to public safety, health, and welfare.",
  "source": "https://www.nspe.org/career-resources/ethics/public-safety-health-welfare-avoiding-rolling-blackouts",
  "rdf_triples": {
    "triples": [
      {
        "subject": "Case:Case_Case 98_5_I_1",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "Case:Case_Case 98_5_I_1",
        "predicate": "rdf:type",
        "object": "proeth:EthicalDilemma"
      },
      {
        "subject": "Case:Case_Case 98_5_I_1",
        "predicate": "rdfs:label",
        "object": "I.1.",
        "is_literal": true
      },
      {
        "subject": "Case:Case_Case 98_5_I_1",
        "predicate": "rdfs:comment",
        "object": "Engineer A works for an organization that for years has operated a fossil-fueled co-generation facility primarily to supply thermal energy for process needs. The facility has the capability to produce electric energy when thermal energy needs are satisfied, in fact, there are times when a significant portion of the organization’s electric energy is supplied by the co-generation facility. The generator is approaching the end of its useful life and will require a substantial investment to remain operational.\n\nRecently, stakeholders have expressed interest in reducing the organization’s carbon footprint, and these stakeholders suggest that the facility eliminate the generator and replace it with solar panels. After careful study of the facility electric load profile and the capability of the proposed solar energy system, Engineer A is satisfied that under normal conditions, the system of solar panels can supply electric energy equivalent to that provided by the existing generator. Capital constraints prevent the organization from installing a system of batteries to store energy for use at night or in bad weather, but the cost of installing the solar panels is essentially the same as the cost to rebuild the gen\u0002erator.\n\nWhen discussing the analysis of the electric load profile with a representative of the local electric utility, Engineer A learns that the utility resource planners reviewed their current generation mix and believe that during extreme weather events, they may be forced to institute rolling outages to keep system generating facilities on-line.\n\nEngineer A is preparing a report that will be presented to the board to consider the new solar project, and is convinced that the solar project, when considered in isolation, is viable and will satisfy those stakeholders interested in reducing the organization’s carbon footprint. Engineer A also realizes that a move to solar production without storage may stress the local utility generation mix even more, increasing the likelihood of rolling blackouts.\n\nShould Engineer A include information about the utility generation mix and rolling blackouts in the report to the board?\n\n\t\tShould Engineer A include information about cost of battery storage and the potential consequences of not having battery storage?\n\nShould Engineer A include information about the utility generation mix and rolling blackouts in the report to the board?\n\nShould Engineer A include information about cost of battery storage and the potential consequences of not having battery storage?\n\nAs a registered professional, Engineer A is obliged to include relevant and pertinent information in a report to the board. A report that does not contain information about the reliability of the utility source will not help them make an informed decision.\n\nAn ethical corollary to the organization’s decision to replace an on-demand, fossil-fueled generator with solar production without storage is worthy of discussion. With the current co-generation facility and a like-in-kind replacement, a presumably large electric load served by the utility can either stand alone or be operated to greatly reduce the electric load on a power system that will be stressed during extreme weather events.\n\nIf the solar production without storage option moves forward, the organization will increase its green footprint and will support a laudable goal of increasing environmentally friendly energy production. But this option may also increase the likelihood of future rolling blackouts. It is not difficult to imagine, for example, the stress placed upon elderly or confined individuals as well as those with medical conditions if they are left without a comfortable environment during an extreme weather event such as California and Texas recently experienced - and which led to rolling blackouts. What guidance can Engineer A rely upon to address a potential conflict between competing public goods?\n\nBER Case 98-5 describes how Engineer Adam serves as director of a building department in a major city. Engineer Adam has been concerned that as a result of a series of budget cutbacks and more rigid code enforcement requirements, the city has been unable to provide a sufficient number of qualified individuals to perform adequate and timely building inspections. Each code official member of Engineer Adam’s staff is often required to make as many as 60 code inspections per day. Engineer Adam believes there is no way even the most conscientious code official can make 60 adequate, much less thorough, inspections in one day, particularly under the newer, more rigid code requirements for the city. These new code requirements greatly enhance and protect the public’s health and safety. The code officials are caught between the responsibility to be thorough in their inspections and the city’s desire to hold down costs and generate revenue from inspection fees. Engineer Adam is required to sign off on all final inspection reports. Engineer Adam meets with the chairman of the local city council to discuss his concerns. The chairman indicates that he is quite sympathetic to Engineer Adam’s concerns and would be willing to issue an order to permit the hiring of additional code officials for the building department. At the same time, the chairman notes that the city is seeking to encourage more businesses to relocate into the city in order to provide more jobs and a strengthened tax base. In this connection, the chairman seeks Engineer Adam’s concurrence on a city ordinance that would permit certain specified buildings under construction to be “grandfathered” under the older existing enforcement requirements and not the newer, more rigid requirements now in effect.\n\nIn finding that it was not ethical for Engineer Adam to concur with the chairman’s proposal – a politically-motivated ‘Faustian bargain’ to hire additional building code officials – the BER affirmed that engineers “must hold the public health and safety paramount.” Engineer Adam “had a responsibility to insist, however strongly and vociferously, that public officials and decision-makers take steps and corrective steps if necessary to see that this obligation is fulfilled.” The BER further noted “righting a wrong with another wrong” does grave damage to the public health and safety, and that long-term public welfare (a valid building code enforcement process) cannot be undermined for short-term gain (grandfathering specified buildings in the name of increased jobs and tax revenues).\n\nRecent BER Case 20-4 addressed a public board (a municipal water commission) choosing to change the source of their potable water system to reduce public expenditures despite the recommendations of two engineers that further study was needed to ensure public safety. The BER found that the engineers have an obligation to formally communicate their concerns to the water commission. The BER also found that given the gravity of the potential danger to public health and safety, the engineers have an obligation to formally report their concerns to the state regulatory agency.\n\nBER Case 16-5 is also instructive; it deals with an engineer working on a team developing a driverless/ autonomous vehicle operating system. The development team was tasked with considering outcomes to choose in the event of an unavoidable vehicle crash – does the system choose the option that reduces the harm to vehicle occupants only, or should the system operate in a way that will minimize the harm that is done to anyone involved in the accident? The conclusions in BER Case 16-5 suggest the engineer fully and actively participate as a member of the engineering risk management team and express clearly and unambiguously concerns regarding safety of the operating system. The BER also suggested that, if necessary, the engineer recommend further study before the operating system is utilized.\n\nThis discussion has so far not addressed the obligation of Engineer A in this case to act as a faithful agent or trustee for the employer. Given the facts presented in this case, the solar generation system without storage will provide energy generation equivalent to the existing fossil-fueled generator at a similar cost; the system also reduces the organization’s carbon footprint. At first glance, this finding in conjunction with the earlier conclusion that system reliability data be included in the report to board may seem to satisfy Engineer A’s obligations. Note that “equivalent” as used to this point in the discussion has not addressed reliability. The proposed solar generation system without storage may produce the same energy that the existing fossil-fueled generator does, but it will not be as reliable. Further, a system without energy storage decreases the reliability of the entire local electric power system. Installing a system without storage may result in rolling blackouts and facility interruptions and thus not be a success. Therefore, Engineer A has an obligation to present this information in a report to the board.\n\nThe board may choose to rebuild/refurbish the fossil-fueled generator because it provides function and reliability at a lower cost than a solar production system with storage.\n\nSome may argue that continuing to operate a fossil-fueled generator is inconsistent with public health, safety, and welfare, while others will point to the increased reliability of the fossil-fueled generator as a demonstration of greater concern for public welfare. The ethical objective is an informed policy and project decision-making process.\n\nI.1.\n\nHold paramount the safety, health, and welfare of the public.\n\nI.6.\n\nConduct themselves honorably, responsibly, ethically, and lawfully so as to enhance the honor, reputation, and usefulness of the profession.\n\nII.1.c.\n\nEngineers shall not reveal facts, data, or information without the prior consent of the client or employer except as authorized or required by law or this Code.\n\nII.3.a.\n\nEngineers shall be objective and truthful in professional reports, statements, or testimony. They shall include all relevant and pertinent information in such reports, statements, or testimony, which should bear the date indicating when it was current.\n\nII.3.b.\n\nEngineers may express publicly technical opinions that are founded upon knowledge of the facts and competence in the subject matter.\n\nII.4.\n\nEngineers shall act for each employer or client as faithful agents or trustees.\n\nIII.1.b.\n\nEngineers shall advise their clients or employers when they believe a project will not be successful.\n\nIII.2.d.\n\nEngineers are encouraged to adhere to the principles of sustainable development1 in order to protect the environment for future generations.\n\tFootnote 1 \"Sustainable development\" is the challenge of meeting human needs for natural resources, industrial products, energy, food, transportation, shelter, and effective waste management while conserving and protecting environmental quality and the natural resource base essential for future development.\n\nEngineer A has an ethical obligation to include information about the utility generation mix and potential rolling blackouts in a report to the organization’s board.\n\n\t\tEngineer A’s report should also include information about cost of battery storage and the potential consequences of not having battery storage on system reliability relative to public safety, health, and welfare.\n\nEngineer A has an ethical obligation to include information about the utility generation mix and potential rolling blackouts in a report to the organization’s board.\n\nEngineer A’s report should also include information about cost of battery storage and the potential consequences of not having battery storage on system reliability relative to public safety, health, and welfare.",
        "is_literal": true
      },
      {
        "subject": "Case:Case_Case 98_5_I_1",
        "predicate": "NSPE:caseNumber",
        "object": "Case 98-5",
        "is_literal": true
      },
      {
        "subject": "Case:Case_Case 98_5_I_1",
        "predicate": "NSPE:caseYear",
        "object": "1998",
        "is_literal": true
      },
      {
        "subject": "Case:Case_Case 98_5_I_1",
        "predicate": "NSPE:sourceUrl",
        "object": "https://www.nspe.org/career-resources/ethics/public-safety-health-welfare-avoiding-rolling-blackouts",
        "is_literal": true
      },
      {
        "subject": "ENG_ETHICS:ObjectivityPrincipleInstance_Case 98_5",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "ENG_ETHICS:ObjectivityPrincipleInstance_Case 98_5",
        "predicate": "rdf:type",
        "object": "ENG_ETHICS:ObjectivityPrinciple"
      },
      {
        "subject": "Case:Case_Case 98_5_I_1",
        "predicate": "eng:involvesPrinciple",
        "object": "ENG_ETHICS:ObjectivityPrincipleInstance_Case 98_5"
      },
      {
        "subject": "ENG_ETHICS:PublicSafetyPrincipleInstance_Case 98_5",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "ENG_ETHICS:PublicSafetyPrincipleInstance_Case 98_5",
        "predicate": "rdf:type",
        "object": "ENG_ETHICS:PublicSafetyPrinciple"
      },
      {
        "subject": "Case:Case_Case 98_5_I_1",
        "predicate": "eng:involvesPrinciple",
        "object": "ENG_ETHICS:PublicSafetyPrincipleInstance_Case 98_5"
      },
      {
        "subject": "NSPE:safetyPrincipleInstance_Case 98_5",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "NSPE:safetyPrincipleInstance_Case 98_5",
        "predicate": "rdf:type",
        "object": "NSPE:safetyPrinciple"
      },
      {
        "subject": "Case:Case_Case 98_5_I_1",
        "predicate": "eng:involvesPrinciple",
        "object": "NSPE:safetyPrincipleInstance_Case 98_5"
      },
      {
        "subject": "ENG_ETHICS:HonestyPrincipleInstance_Case 98_5",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "ENG_ETHICS:HonestyPrincipleInstance_Case 98_5",
        "predicate": "rdf:type",
        "object": "ENG_ETHICS:HonestyPrinciple"
      },
      {
        "subject": "Case:Case_Case 98_5_I_1",
        "predicate": "eng:involvesPrinciple",
        "object": "ENG_ETHICS:HonestyPrincipleInstance_Case 98_5"
      },
      {
        "subject": "NSPE:welfarePrincipleInstance_Case 98_5",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "NSPE:welfarePrincipleInstance_Case 98_5",
        "predicate": "rdf:type",
        "object": "NSPE:welfarePrinciple"
      },
      {
        "subject": "Case:Case_Case 98_5_I_1",
        "predicate": "eng:involvesPrinciple",
        "object": "NSPE:welfarePrincipleInstance_Case 98_5"
      },
      {
        "subject": "NSPE:healthPrincipleInstance_Case 98_5",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "NSPE:healthPrincipleInstance_Case 98_5",
        "predicate": "rdf:type",
        "object": "NSPE:healthPrinciple"
      },
      {
        "subject": "Case:Case_Case 98_5_I_1",
        "predicate": "eng:involvesPrinciple",
        "object": "NSPE:healthPrincipleInstance_Case 98_5"
      },
      {
        "subject": "NSPE:public_healthPrincipleInstance_Case 98_5",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "NSPE:public_healthPrincipleInstance_Case 98_5",
        "predicate": "rdf:type",
        "object": "NSPE:public_healthPrinciple"
      },
      {
        "subject": "Case:Case_Case 98_5_I_1",
        "predicate": "eng:involvesPrinciple",
        "object": "NSPE:public_healthPrincipleInstance_Case 98_5"
      },
      {
        "subject": "ENG_ETHICS:HonestyPrincipleInstance_Case 98_5",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "ENG_ETHICS:HonestyPrincipleInstance_Case 98_5",
        "predicate": "rdf:type",
        "object": "ENG_ETHICS:HonestyPrinciple"
      },
      {
        "subject": "Case:Case_Case 98_5_I_1",
        "predicate": "eng:involvesPrinciple",
        "object": "ENG_ETHICS:HonestyPrincipleInstance_Case 98_5"
      },
      {
        "subject": "ENG_ETHICS:CompetencyPrincipleInstance_Case 98_5",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "ENG_ETHICS:CompetencyPrincipleInstance_Case 98_5",
        "predicate": "rdf:type",
        "object": "ENG_ETHICS:CompetencyPrinciple"
      },
      {
        "subject": "Case:Case_Case 98_5_I_1",
        "predicate": "eng:involvesPrinciple",
        "object": "ENG_ETHICS:CompetencyPrincipleInstance_Case 98_5"
      },
      {
        "subject": "Case:Case_Case 98_5_I_1",
        "predicate": "rel:references",
        "object": "NSPE:Code_II_3_b"
      },
      {
        "subject": "Case:Case_Case 98_5_I_1",
        "predicate": "rel:references",
        "object": "NSPE:NSPECodeII4"
      },
      {
        "subject": "Case:Case_Case 98_5_I_1",
        "predicate": "rel:references",
        "object": "NSPE:Code_I_6"
      },
      {
        "subject": "Case:Case_Case 98_5_I_1",
        "predicate": "rel:references",
        "object": "NSPE:NSPECodeII3a"
      },
      {
        "subject": "Case:Case_Case 98_5_I_1",
        "predicate": "rel:references",
        "object": "NSPE:NSPECodeI1"
      },
      {
        "subject": "Case:Case_Case 98_5_I_1",
        "predicate": "rel:references",
        "object": "NSPE:NSPECodeII1c"
      },
      {
        "subject": "Case:Case_Case 98_5_I_1",
        "predicate": "rel:references",
        "object": "NSPE:NSPECodeIII1b"
      },
      {
        "subject": "Case:Case_Case 98_5_I_1",
        "predicate": "rel:references",
        "object": "NSPE:Code_III_2_d"
      },
      {
        "subject": "Case:Case_Case 98_5_I_1",
        "predicate": "rdf:type",
        "object": "ENG_ETHICS:WhistleblowingDecision"
      },
      {
        "subject": "Engineer_A_Case 98_5",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "Engineer_A_Case 98_5",
        "predicate": "rdf:type",
        "object": "ar:Character"
      },
      {
        "subject": "Engineer_A_Case 98_5",
        "predicate": "rdfs:label",
        "object": "Engineer A",
        "is_literal": true
      },
      {
        "subject": "eng:EngineeringRoleInstance_Engineer_A_Case 98_5",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "eng:EngineeringRoleInstance_Engineer_A_Case 98_5",
        "predicate": "rdf:type",
        "object": "eng:EngineeringRole"
      },
      {
        "subject": "Engineer_A_Case 98_5",
        "predicate": "ar:hasRole",
        "object": "eng:EngineeringRoleInstance_Engineer_A_Case 98_5"
      },
      {
        "subject": "Case:Case_Case 98_5_I_1",
        "predicate": "rel:involves",
        "object": "Engineer_A_Case 98_5"
      },
      {
        "subject": "Decision_Case 98_5",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "Decision_Case 98_5",
        "predicate": "rdf:type",
        "object": "eng:EthicalDecision"
      },
      {
        "subject": "Decision_Case 98_5",
        "predicate": "rdfs:label",
        "object": "NSPE Board Decision for Case Case 98-5",
        "is_literal": true
      },
      {
        "subject": "Decision_Case 98_5",
        "predicate": "NSPE:outcome",
        "object": "Unethical",
        "is_literal": true
      },
      {
        "subject": "Case:Case_Case 98_5_I_1",
        "predicate": "rel:hasDecision",
        "object": "Decision_Case 98_5"
      },
      {
        "subject": "Case:Case_Case 98_5_I_1",
        "predicate": "NSPE:boardAnalysis",
        "object": "ization’s carbon footprint. At first glance, this finding in conjunction with the earlier conclusion that system reliability data be included in the report to board may seem to satisfy Engineer A’s obligations. Note that “equivalent” as used to this point in the discussion has not addressed reliability. The proposed solar generation system without storage may produce the same energy that the existing fossil-fueled generator does, but it will not be as reliable. Further, a system without energy storage decreases the reliability of the entire local electric power system. Installing a system without storage may result in rolling blackouts and facility interruptions and thus not be a success. Therefore, Engineer A has an obligation to present this information in a report to the board.\n\nThe board may choose to rebuild/refurbish the fossil-fueled generator because it provides function and reliability at a lower cost than a solar production system with storage.\n\nSome may argue that continuing\n[content truncated]",
        "is_literal": true
      },
      {
        "subject": "Case:Case_Case 98_5_I_1",
        "predicate": "rel:relatedTo",
        "object": "Case:Case_Case 20_4"
      },
      {
        "subject": "Case:Case_Case 98_5_I_1",
        "predicate": "rel:relatedTo",
        "object": "Case:Case_Case 16_5"
      },
      {
        "subject": "Case:Case_Case 98_5_I_1",
        "predicate": "rel:relatedTo",
        "object": "Case:Case_Case 98_5"
      }
    ],
    "namespaces": {
      "Case": "http://proethica.org/case/",
      "NSPE": "http://proethica.org/nspe/",
      "ENG_ETHICS": "http://proethica.org/ontology/engineering-ethics#",
      "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#",
      "rdfs": "http://www.w3.org/2000/01/rdf-schema#",
      "owl": "http://www.w3.org/2002/07/owl#",
      "bfo": "http://purl.obolibrary.org/obo/",
      "proeth": "http://proethica.org/ontology/intermediate#",
      "dc": "http://purl.org/dc/elements/1.1/",
      "ar": "http://proethica.org/ontology/agent-role#",
      "eng": "http://proethica.org/ontology/engineering-ethics#",
      "nspe": "http://proethica.org/nspe/",
      "rel": "http://proethica.org/relation/"
    }
  },
  "metadata": {
    "related_cases": [
      "Case 20-4",
      "Case 16-5",
      "Case 98-5"
    ],
    "codes_cited": [
      "Code II.3.b",
      "Code II.4",
      "Code I.6",
      "Code II.3.a",
      "Code I.1",
      "Code II.1.c",
      "Code III.1.b",
      "Code III.2.d"
    ],
    "principles": [
      "objectivity",
      "public safety",
      "safety",
      "honesty",
      "welfare",
      "health",
      "public health",
      "disclosure",
      "competency"
    ],
    "outcome": "unethical",
    "operationalization_techniques": [
      "Principle Instantiation",
      "Case Instantiation",
      "Conflicting Principles Resolution"
    ],
    "board_analysis": "ization’s carbon footprint. At first glance, this finding in conjunction with the earlier conclusion that system reliability data be included in the report to board may seem to satisfy Engineer A’s obligations. Note that “equivalent” as used to this point in the discussion has not addressed reliability. The proposed solar generation system without storage may produce the same energy that the existing fossil-fueled generator does, but it will not be as reliable. Further, a system without energy storage decreases the reliability of the entire local electric power system. Installing a system without storage may result in rolling blackouts and facility interruptions and thus not be a success. Therefore, Engineer A has an obligation to present this information in a report to the board.\n\nThe board may choose to rebuild/refurbish the fossil-fueled generator because it provides function and reliability at a lower cost than a solar production system with storage.\n\nSome may argue that continuing\n[content truncated]",
    "ethical_questions": [
      "Was the engineer's conduct regarding engineer a works for an organization that for years has operated a fossil-fueled co-generation facility primarily to supply thermal energy for process needs ethical?"
    ]
  }
}