{
  "title": "I.2.",
  "description": "County A was expecting a significant amount of rural roadway construction in the upcoming construction season. County A did not have enough engineering staff to handle the design effort required for the expected workload. Therefore, the County decided to advertise for consulting services to accomplish the needed design. It had been a policy of the County to utilize local design services whenever possible in these cases. Subsequently, the advertisement was published only locally.All local engineering firms responded to the advertisement. There was enough design work available that each of the local firms could receive one or more design projects. One local engineering firm owner, Engineer B (an experienced water and wastewater engineer) was experiencing a downturn in committed work which would have affected the bottom line of the firm and could have resulted in layoffs of its staff. While not experienced in rural roadway design, Engineer B gave assurances to the County that they could perform the services adequately. They also lobbied the County Commission in their favor. Engineer B received an award from the County for a single roadway design project. Engineer B completed the design project, the County bid the project and then proceeded into construction. The County, in this case, decided to utilize their own staff for construction period services. During the construction phase, problems and issues began occurring immediately. A significant number of field revisions were necessary and estimated quantities of work had been miscalculated, resulting in excessive time and effort for the County to resolve. The County grew increasingly frustrated with the quality of work provided by Engineer B. Through the efforts of the County staff, the project was able to remain within its budget.\n\nDuring a meeting with the County as these problems occurred, Engineer B did admit that the problems encountered were outside the firm’s understanding of proper design. If understood by Engineer B, the issues could have been avoided.\n\nWas it ethical for Engineer B to accept the rural roadway design contract under these circumstances?\n\nThe Code of Ethics specifically states Engineers shall not affix their signature to any plans dealing with subject matter in which they lack competence. The Board of Ethical Review has reviewed this requirement in past cases.\n\nIn BER Case 02-5, the Board studied a situation in which a structural engineer, competent in severe weather structural engineering, designed a building that had a structural failure from a severe weather condition. This failure could have been avoided if the engineer had incorporated design parameters suggested in recent technical literature with which the engineer was not familiar. The Board concluded that it was not unethical for the engineer to fail to follow the most recent design parameters for structural design in severe weather areas published in the most recent technical literature, because those recently proposed design parameters had not yet become standards. In BER Case 02-5, the engineer was considered competent in all other respects, it was just that the engineer was not familiar with the recently proposed design parameters. In the present case, the question is whether Engineer B is competent.\n\nIn BER Case 98-8, a professional engineer in civil engineering was asked to certify certain arms storage rooms and racks for the Army. This engineer had no significant training or knowledge in that area, although the engineer was considered a qualified engineer. The Board concluded that, because the engineer lacked competence in the specific area, it would not be ethical for the engineer to certify the arms storage rooms and arms storage racks. That case is analogous to the present case. In both instances, while competent in some areas, the engineer in question may not have been competent in the specific areas of practice in question, in which case, the engineer acted unethically.\n\nBER Case 94-8 provided an extreme example of incompetence. In that case, a professional engineer with a degree and background in chemical engineering was asked to provide a foundation design for an industrial facility. The Board determined that it would be unethical for the engineer to perform the design of the structural footings as part of the facility.\n\nThe Code of Ethics provides guidance when evaluating competence. II.2.a. states that “Engineers shall undertake assignments only when qualified by education or experience in the specific technical fields involved.” However, does education or experience alone provide one with competence? Education provides scientific and technical knowledge which are a necessary foundation for professional competence, but it is also the experiences of working within the technical fields that build competence.\n\nII.2.a., alone does not settle the ethical questions of this case since it allows for the undertaking of assignments when engineers are qualified by education “or” experience.  II.2.b. indicates further that Engineers shall not affix their signatures to any plans or documents dealing with subject matter in which they lack competence. In this case, it is clear that Engineer B, as a water and wastewater engineer without identified significant roadway design skills, did not possess the competence to perform the rural highway design services. The problems that occurred during construction would have been avoided if the design met standards.\n\nFinally, I.6 indicates that engineers shall conduct themselves in a way so to enhance the honor, reputation, and usefulness of the profession. Engineer B did not meet this standard when bidding and accepting a contract involving work for which the firm did not have adequate competence.\n\nI.2.\n\nPerform services only in areas of their competence.\n\nI.6.\n\nConduct themselves honorably, responsibly, ethically, and lawfully so as to enhance the honor, reputation, and usefulness of the profession.\n\nII.1.b.\n\nEngineers shall approve only those engineering documents that are in conformity with applicable standards.\n\nII.2.\n\nEngineers shall perform services only in the areas of their competence.\n\nII.5.a.\n\nEngineers shall not falsify their qualifications or permit misrepresentation of their or their associates' qualifications. They shall not misrepresent or exaggerate their responsibility in or for the subject matter of prior assignments. Brochures or other presentations incident to the solicitation of employment shall not misrepresent pertinent facts concerning employers, employees, associates, joint venturers, or past accomplishments.\n\nIt was unethical for Engineer B to accept the rural roadway design contract under these circumstances.\n\nThis case addresses the ethical obligation to practice within one’s area of competence. This obligation is critically important in engineering practice, requiring engineers to know what they know and know what they don’t know. It requires diligence to differentiate between what they know and can do competently and what is beyond their capabilities. However, most engineers, after an engineering education and initial experience, don’t do the same type of design projects, in the same way, year after year until it’s time to retire. For most, it is a career-long progression of stretching one’s capabilities with different types of projects, very similar or not, learning and applying new technologies and practices, and, in some cases, solving engineering problems by going back to first principles of mathematics and science. That type of career evolution is what we are educated to do, what our long term career development progressively teaches us, and what makes most engineering careers fascinating. So, the challenge is to appropriately stretch our capabilities, while ensuring appropriate protection of public health, safety and welfare.\n\nCase 23-1 presents a “water and wastewater engineer” offering to perform design services for a rural roadway design project. The facts presented are sparse, as is common in these cases. Many or most “water and wastewater engineers” regularly design urban roadway reconstruction on utility projects, and historically many have baccalaureate degrees in civil engineering. Rural roadway design presents similar engineering issues compared to urban utility/roadway projects, although some design details vary and specification formats (i.e. DOT specifications) and methods of measurement and payment are often different. In this case, the engineer may have decided to undertake the project for the wrong reasons, perhaps solely because workload was slow, and the county may have made a poor decision in not seeking additional design firms from a wider geographical area. But does this rise to unethical behavior based on the facts presented?  Had the facts of the case indicated more information on the qualifications of the water and wastewater engineer, perhaps one who was solely experienced in water and wastewater treatment design, or if the construction project had experienced problems with constructability or avoidable change orders due to design inexperience that increased project cost, then a conclusion that this was unethical behavior would be warranted.   However, in this case, design and construction issues appear to have been successfully resolved in the field without impact.\n\nWith the case as presented, the reader might interpret that the case is concluding that it is unethical for an engineer experienced in urban utility projects to design rural roadway reconstruction.  Such a narrow interpretation would have a chilling effect on the development of engineering careers if “staying in one’s lane” were commonly interpreted so narrowly. In the view of this dissenting opinion and on the basis of the limited facts presented, this was not, on the face of it, unethical behavior.",
  "source": "https://www.nspe.org/career-resources/ethics/competence-design-services",
  "rdf_triples": {
    "triples": [
      {
        "subject": "Case:Case_Case 02_5_I_2",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "Case:Case_Case 02_5_I_2",
        "predicate": "rdf:type",
        "object": "proeth:EthicalDilemma"
      },
      {
        "subject": "Case:Case_Case 02_5_I_2",
        "predicate": "rdfs:label",
        "object": "I.2.",
        "is_literal": true
      },
      {
        "subject": "Case:Case_Case 02_5_I_2",
        "predicate": "rdfs:comment",
        "object": "County A was expecting a significant amount of rural roadway construction in the upcoming construction season. County A did not have enough engineering staff to handle the design effort required for the expected workload. Therefore, the County decided to advertise for consulting services to accomplish the needed design. It had been a policy of the County to utilize local design services whenever possible in these cases. Subsequently, the advertisement was published only locally.All local engineering firms responded to the advertisement. There was enough design work available that each of the local firms could receive one or more design projects. One local engineering firm owner, Engineer B (an experienced water and wastewater engineer) was experiencing a downturn in committed work which would have affected the bottom line of the firm and could have resulted in layoffs of its staff. While not experienced in rural roadway design, Engineer B gave assurances to the County that they could perform the services adequately. They also lobbied the County Commission in their favor. Engineer B received an award from the County for a single roadway design project. Engineer B completed the design project, the County bid the project and then proceeded into construction. The County, in this case, decided to utilize their own staff for construction period services. During the construction phase, problems and issues began occurring immediately. A significant number of field revisions were necessary and estimated quantities of work had been miscalculated, resulting in excessive time and effort for the County to resolve. The County grew increasingly frustrated with the quality of work provided by Engineer B. Through the efforts of the County staff, the project was able to remain within its budget.\n\nDuring a meeting with the County as these problems occurred, Engineer B did admit that the problems encountered were outside the firm’s understanding of proper design. If understood by Engineer B, the issues could have been avoided.\n\nWas it ethical for Engineer B to accept the rural roadway design contract under these circumstances?\n\nThe Code of Ethics specifically states Engineers shall not affix their signature to any plans dealing with subject matter in which they lack competence. The Board of Ethical Review has reviewed this requirement in past cases.\n\nIn BER Case 02-5, the Board studied a situation in which a structural engineer, competent in severe weather structural engineering, designed a building that had a structural failure from a severe weather condition. This failure could have been avoided if the engineer had incorporated design parameters suggested in recent technical literature with which the engineer was not familiar. The Board concluded that it was not unethical for the engineer to fail to follow the most recent design parameters for structural design in severe weather areas published in the most recent technical literature, because those recently proposed design parameters had not yet become standards. In BER Case 02-5, the engineer was considered competent in all other respects, it was just that the engineer was not familiar with the recently proposed design parameters. In the present case, the question is whether Engineer B is competent.\n\nIn BER Case 98-8, a professional engineer in civil engineering was asked to certify certain arms storage rooms and racks for the Army. This engineer had no significant training or knowledge in that area, although the engineer was considered a qualified engineer. The Board concluded that, because the engineer lacked competence in the specific area, it would not be ethical for the engineer to certify the arms storage rooms and arms storage racks. That case is analogous to the present case. In both instances, while competent in some areas, the engineer in question may not have been competent in the specific areas of practice in question, in which case, the engineer acted unethically.\n\nBER Case 94-8 provided an extreme example of incompetence. In that case, a professional engineer with a degree and background in chemical engineering was asked to provide a foundation design for an industrial facility. The Board determined that it would be unethical for the engineer to perform the design of the structural footings as part of the facility.\n\nThe Code of Ethics provides guidance when evaluating competence. II.2.a. states that “Engineers shall undertake assignments only when qualified by education or experience in the specific technical fields involved.” However, does education or experience alone provide one with competence? Education provides scientific and technical knowledge which are a necessary foundation for professional competence, but it is also the experiences of working within the technical fields that build competence.\n\nII.2.a., alone does not settle the ethical questions of this case since it allows for the undertaking of assignments when engineers are qualified by education “or” experience.  II.2.b. indicates further that Engineers shall not affix their signatures to any plans or documents dealing with subject matter in which they lack competence. In this case, it is clear that Engineer B, as a water and wastewater engineer without identified significant roadway design skills, did not possess the competence to perform the rural highway design services. The problems that occurred during construction would have been avoided if the design met standards.\n\nFinally, I.6 indicates that engineers shall conduct themselves in a way so to enhance the honor, reputation, and usefulness of the profession. Engineer B did not meet this standard when bidding and accepting a contract involving work for which the firm did not have adequate competence.\n\nI.2.\n\nPerform services only in areas of their competence.\n\nI.6.\n\nConduct themselves honorably, responsibly, ethically, and lawfully so as to enhance the honor, reputation, and usefulness of the profession.\n\nII.1.b.\n\nEngineers shall approve only those engineering documents that are in conformity with applicable standards.\n\nII.2.\n\nEngineers shall perform services only in the areas of their competence.\n\nII.5.a.\n\nEngineers shall not falsify their qualifications or permit misrepresentation of their or their associates' qualifications. They shall not misrepresent or exaggerate their responsibility in or for the subject matter of prior assignments. Brochures or other presentations incident to the solicitation of employment shall not misrepresent pertinent facts concerning employers, employees, associates, joint venturers, or past accomplishments.\n\nIt was unethical for Engineer B to accept the rural roadway design contract under these circumstances.\n\nThis case addresses the ethical obligation to practice within one’s area of competence. This obligation is critically important in engineering practice, requiring engineers to know what they know and know what they don’t know. It requires diligence to differentiate between what they know and can do competently and what is beyond their capabilities. However, most engineers, after an engineering education and initial experience, don’t do the same type of design projects, in the same way, year after year until it’s time to retire. For most, it is a career-long progression of stretching one’s capabilities with different types of projects, very similar or not, learning and applying new technologies and practices, and, in some cases, solving engineering problems by going back to first principles of mathematics and science. That type of career evolution is what we are educated to do, what our long term career development progressively teaches us, and what makes most engineering careers fascinating. So, the challenge is to appropriately stretch our capabilities, while ensuring appropriate protection of public health, safety and welfare.\n\nCase 23-1 presents a “water and wastewater engineer” offering to perform design services for a rural roadway design project. The facts presented are sparse, as is common in these cases. Many or most “water and wastewater engineers” regularly design urban roadway reconstruction on utility projects, and historically many have baccalaureate degrees in civil engineering. Rural roadway design presents similar engineering issues compared to urban utility/roadway projects, although some design details vary and specification formats (i.e. DOT specifications) and methods of measurement and payment are often different. In this case, the engineer may have decided to undertake the project for the wrong reasons, perhaps solely because workload was slow, and the county may have made a poor decision in not seeking additional design firms from a wider geographical area. But does this rise to unethical behavior based on the facts presented?  Had the facts of the case indicated more information on the qualifications of the water and wastewater engineer, perhaps one who was solely experienced in water and wastewater treatment design, or if the construction project had experienced problems with constructability or avoidable change orders due to design inexperience that increased project cost, then a conclusion that this was unethical behavior would be warranted.   However, in this case, design and construction issues appear to have been successfully resolved in the field without impact.\n\nWith the case as presented, the reader might interpret that the case is concluding that it is unethical for an engineer experienced in urban utility projects to design rural roadway reconstruction.  Such a narrow interpretation would have a chilling effect on the development of engineering careers if “staying in one’s lane” were commonly interpreted so narrowly. In the view of this dissenting opinion and on the basis of the limited facts presented, this was not, on the face of it, unethical behavior.",
        "is_literal": true
      },
      {
        "subject": "Case:Case_Case 02_5_I_2",
        "predicate": "NSPE:caseNumber",
        "object": "Case 02-5",
        "is_literal": true
      },
      {
        "subject": "Case:Case_Case 02_5_I_2",
        "predicate": "NSPE:caseYear",
        "object": "2002",
        "is_literal": true
      },
      {
        "subject": "Case:Case_Case 02_5_I_2",
        "predicate": "NSPE:sourceUrl",
        "object": "https://www.nspe.org/career-resources/ethics/competence-design-services",
        "is_literal": true
      },
      {
        "subject": "ENG_ETHICS:PublicSafetyPrincipleInstance_Case 02_5",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "ENG_ETHICS:PublicSafetyPrincipleInstance_Case 02_5",
        "predicate": "rdf:type",
        "object": "ENG_ETHICS:PublicSafetyPrinciple"
      },
      {
        "subject": "Case:Case_Case 02_5_I_2",
        "predicate": "eng:involvesPrinciple",
        "object": "ENG_ETHICS:PublicSafetyPrincipleInstance_Case 02_5"
      },
      {
        "subject": "NSPE:safetyPrincipleInstance_Case 02_5",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "NSPE:safetyPrincipleInstance_Case 02_5",
        "predicate": "rdf:type",
        "object": "NSPE:safetyPrinciple"
      },
      {
        "subject": "Case:Case_Case 02_5_I_2",
        "predicate": "eng:involvesPrinciple",
        "object": "NSPE:safetyPrincipleInstance_Case 02_5"
      },
      {
        "subject": "NSPE:welfarePrincipleInstance_Case 02_5",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "NSPE:welfarePrincipleInstance_Case 02_5",
        "predicate": "rdf:type",
        "object": "NSPE:welfarePrinciple"
      },
      {
        "subject": "Case:Case_Case 02_5_I_2",
        "predicate": "eng:involvesPrinciple",
        "object": "NSPE:welfarePrincipleInstance_Case 02_5"
      },
      {
        "subject": "NSPE:healthPrincipleInstance_Case 02_5",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "NSPE:healthPrincipleInstance_Case 02_5",
        "predicate": "rdf:type",
        "object": "NSPE:healthPrinciple"
      },
      {
        "subject": "Case:Case_Case 02_5_I_2",
        "predicate": "eng:involvesPrinciple",
        "object": "NSPE:healthPrincipleInstance_Case 02_5"
      },
      {
        "subject": "NSPE:public_healthPrincipleInstance_Case 02_5",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "NSPE:public_healthPrincipleInstance_Case 02_5",
        "predicate": "rdf:type",
        "object": "NSPE:public_healthPrinciple"
      },
      {
        "subject": "Case:Case_Case 02_5_I_2",
        "predicate": "eng:involvesPrinciple",
        "object": "NSPE:public_healthPrincipleInstance_Case 02_5"
      },
      {
        "subject": "ENG_ETHICS:CompetencyPrincipleInstance_Case 02_5",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "ENG_ETHICS:CompetencyPrincipleInstance_Case 02_5",
        "predicate": "rdf:type",
        "object": "ENG_ETHICS:CompetencyPrinciple"
      },
      {
        "subject": "Case:Case_Case 02_5_I_2",
        "predicate": "eng:involvesPrinciple",
        "object": "ENG_ETHICS:CompetencyPrincipleInstance_Case 02_5"
      },
      {
        "subject": "Case:Case_Case 02_5_I_2",
        "predicate": "rel:references",
        "object": "NSPE:NSPECodeII2"
      },
      {
        "subject": "Case:Case_Case 02_5_I_2",
        "predicate": "rel:references",
        "object": "NSPE:Code_I_2"
      },
      {
        "subject": "Case:Case_Case 02_5_I_2",
        "predicate": "rel:references",
        "object": "NSPE:Code_I_6"
      },
      {
        "subject": "Case:Case_Case 02_5_I_2",
        "predicate": "rel:references",
        "object": "NSPE:NSPECodeII1b"
      },
      {
        "subject": "Case:Case_Case 02_5_I_2",
        "predicate": "rel:references",
        "object": "NSPE:Code_II_2_a"
      },
      {
        "subject": "Case:Case_Case 02_5_I_2",
        "predicate": "rel:references",
        "object": "NSPE:Code_II_2_b"
      },
      {
        "subject": "Case:Case_Case 02_5_I_2",
        "predicate": "rel:references",
        "object": "NSPE:Code_II_5_a"
      },
      {
        "subject": "Case:Case_Case 02_5_I_2",
        "predicate": "rdf:type",
        "object": "ENG_ETHICS:WhistleblowingDecision"
      },
      {
        "subject": "Engineer_B_Case 02_5",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "Engineer_B_Case 02_5",
        "predicate": "rdf:type",
        "object": "ar:Character"
      },
      {
        "subject": "Engineer_B_Case 02_5",
        "predicate": "rdfs:label",
        "object": "Engineer B",
        "is_literal": true
      },
      {
        "subject": "eng:EngineeringRoleInstance_Engineer_B_Case 02_5",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "eng:EngineeringRoleInstance_Engineer_B_Case 02_5",
        "predicate": "rdf:type",
        "object": "eng:EngineeringRole"
      },
      {
        "subject": "Engineer_B_Case 02_5",
        "predicate": "ar:hasRole",
        "object": "eng:EngineeringRoleInstance_Engineer_B_Case 02_5"
      },
      {
        "subject": "Case:Case_Case 02_5_I_2",
        "predicate": "rel:involves",
        "object": "Engineer_B_Case 02_5"
      },
      {
        "subject": "Decision_Case 02_5",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "Decision_Case 02_5",
        "predicate": "rdf:type",
        "object": "eng:EthicalDecision"
      },
      {
        "subject": "Decision_Case 02_5",
        "predicate": "rdfs:label",
        "object": "NSPE Board Decision for Case Case 02-5",
        "is_literal": true
      },
      {
        "subject": "Decision_Case 02_5",
        "predicate": "NSPE:outcome",
        "object": "Unethical",
        "is_literal": true
      },
      {
        "subject": "Case:Case_Case 02_5_I_2",
        "predicate": "rel:hasDecision",
        "object": "Decision_Case 02_5"
      },
      {
        "subject": "Case:Case_Case 02_5_I_2",
        "predicate": "NSPE:boardAnalysis",
        "object": "hat they know and know what they don’t know. It requires diligence to differentiate between what they know and can do competently and what is beyond their capabilities. However, most engineers, after an engineering education and initial experience, don’t do the same type of design projects, in the same way, year after year until it’s time to retire. For most, it is a career-long progression of stretching one’s capabilities with different types of projects, very similar or not, learning and applying new technologies and practices, and, in some cases, solving engineering problems by going back to first principles of mathematics and science. That type of career evolution is what we are educated to do, what our long term career development progressively teaches us, and what makes most engineering careers fascinating. So, the challenge is to appropriately stretch our capabilities, while ensuring appropriate protection of public health, safety and welfare.\n\nCase 23-1 presents a “water and wa\n[content truncated]",
        "is_literal": true
      },
      {
        "subject": "Case:Case_Case 02_5_I_2",
        "predicate": "rel:relatedTo",
        "object": "Case:Case_Case 98_8"
      },
      {
        "subject": "Case:Case_Case 02_5_I_2",
        "predicate": "rel:relatedTo",
        "object": "Case:Case_Case 02_5"
      },
      {
        "subject": "Case:Case_Case 02_5_I_2",
        "predicate": "rel:relatedTo",
        "object": "Case:Case_Case 23_1"
      },
      {
        "subject": "Case:Case_Case 02_5_I_2",
        "predicate": "rel:relatedTo",
        "object": "Case:Case_Case 94_8"
      }
    ],
    "namespaces": {
      "Case": "http://proethica.org/case/",
      "NSPE": "http://proethica.org/nspe/",
      "ENG_ETHICS": "http://proethica.org/ontology/engineering-ethics#",
      "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#",
      "rdfs": "http://www.w3.org/2000/01/rdf-schema#",
      "owl": "http://www.w3.org/2002/07/owl#",
      "bfo": "http://purl.obolibrary.org/obo/",
      "proeth": "http://proethica.org/ontology/intermediate#",
      "dc": "http://purl.org/dc/elements/1.1/",
      "ar": "http://proethica.org/ontology/agent-role#",
      "eng": "http://proethica.org/ontology/engineering-ethics#",
      "nspe": "http://proethica.org/nspe/",
      "rel": "http://proethica.org/relation/"
    }
  },
  "metadata": {
    "related_cases": [
      "Case 98-8",
      "Case 02-5",
      "Case 23-1",
      "Case 94-8"
    ],
    "codes_cited": [
      "Code II.2",
      "Code I.2",
      "Code I.6",
      "Code II.1.b",
      "Code II.2.a",
      "Code II.2.b",
      "Code II.5.a"
    ],
    "principles": [
      "public safety",
      "safety",
      "welfare",
      "health",
      "public health",
      "competency"
    ],
    "outcome": "unethical",
    "operationalization_techniques": [
      "Principle Instantiation",
      "Case Instantiation",
      "Conflicting Principles Resolution"
    ],
    "board_analysis": "hat they know and know what they don’t know. It requires diligence to differentiate between what they know and can do competently and what is beyond their capabilities. However, most engineers, after an engineering education and initial experience, don’t do the same type of design projects, in the same way, year after year until it’s time to retire. For most, it is a career-long progression of stretching one’s capabilities with different types of projects, very similar or not, learning and applying new technologies and practices, and, in some cases, solving engineering problems by going back to first principles of mathematics and science. That type of career evolution is what we are educated to do, what our long term career development progressively teaches us, and what makes most engineering careers fascinating. So, the challenge is to appropriately stretch our capabilities, while ensuring appropriate protection of public health, safety and welfare.\n\nCase 23-1 presents a “water and wa\n[content truncated]",
    "ethical_questions": [
      "Was it ethical for Engineer B to accept the rural roadway design contract under these circumstances?",
      "But does this rise to unethical behavior based on the facts presented?"
    ]
  }
}