{
  "title": "II.3.",
  "description": "The Board of Licensure for Professional Engineers (“the PE Board”) in State X consists of six professional engineers and a public member. The governor of State X has recently appointed two new board members, Engineer A and Engineer B, to fill two expiring terms. Engineer A otherwise is a member of the board of directors of a membership engineering organization in that state. Engineer B serves as a committee chair of a national engineering organization. At the first meeting of the newly constituted PE Board, the public member asks whether these outside professional activities constitute a conflict of interest with respect to PE Board service. Engineer A responds that (1) although her state organization has been advocating for the improvement of the state’s continuing professional development requirements to the PE Board and the legislature, (2) she has not been making those presentations, but (3) that the advocacy has been discussed at meetings of the state organization’s board of directors. Engineer B responds that he is the chair of an engineering education committee of the national engineering organization, with a role, in part, to recommend changes to his engineering discipline’s engineering education accreditation criteria, for subsequent review and approval by ABET. The PE Board begins to discuss these professional involvements.\n\nDoes Engineer A have a conflict of interest with respect to PE Board service?\n\n\t\tDoes Engineer B have a conflict of interest with respect to PE Board service?\n\nDoes Engineer A have a conflict of interest with respect to PE Board service?\n\nDoes Engineer B have a conflict of interest with respect to PE Board service?\n\nProfessional engineers often find themselves involved with and representing multiple organizational interests in their professional activities, and this can give rise to organizational conflicts of interest. Conflicts of interest are among the most prevalent ethical concerns facing engineering practitioners. Over the years, the Board of Ethical Review has considered numerous cases involving engineers who have interests in conflict with the interests of clients, employees, or other engineers. At one time, the NSPE Code of Ethics specifically prohibited engineers from becoming involved in cases or situations in which a conflict of interest was present. This was based on the view that professional engineers must at all times be above reproach and avoid any situation that could be perceived as compromising their professional judgment and integrity as independent professionals.\n\nOver time, the NSPE Code and the Board of Ethical Review have moderated to the point of recognizing that certain types of conflicts of interest are difficult, if not impossible, to avoid and that the more realistic approach for individual engineers faced with this dilemma is to fully disclose the nature and extent of the conflict to the appropriate parties involved or impacted by the conflict. This is based on the view that the parties most affected by the conflict and who have the most at stake (e.g., clients, employers, other engineering firms, etc.) are in the best position to determine whether their interests will be compromised by the conflict. While sometimes perceived conflicts of interest are resolved by the parties as a result of full disclosure, in other instances the conflicts are deeper and require the engineer to disassociate from a specific project.\n\nPrevious Board of Ethical Review cases provide some background for considering this case. In BER Case No. 18-2, an engineer was a board member of an engineering technical society and was actively encouraging the society to enter into an agreement with Jones Publishing, a technical journal publisher, to annually publish technical articles and content generated by the society’s members. During meetings of the engineering technical society’s board of directors, the engineer expressed strong resistance to exploring other publishing options to determine what terms and conditions other technical journal publishers might offer to the society. Under a separate private, undisclosed side agreement with Jones Publishing, the engineer was to receive a visible and prestigious position as chairman of the editorial board for another journal published by Jones Publishing if the engineering technical society agreed to enter into the agreement with the company.\n\nIn this case, the BER stated the engineer had a trust relationship in his role as a board member of the engineering technical society and, therefore, must provide full disclosure regarding the side agreement with Jones Publishing to become chairman of the editorial board prior to the engineering society’s formal consideration and voting on the matter. The BER believes that conflicts of interest do not necessarily involve only financial considerations, and organizational conflicts can also be significant. In the BER’s view, the engineer also should have recused himself from his role as a board member acting on this issue for the engineering technical society or, if appropriate, resigned as a board member of the engineering technical society.\n\nA second example is BER Case No. 70-6. Here, as a member of a state legislature, Engineer A is on a committee that initially makes appropriations to local communities for certain public works projects. He is also a partner in an engineering firm in the state. Following an appropriation to local communities in the state for projects designed to combat air pollution as recommended by the legislative committee of which Engineer A is a member, the firm of which Engineer A is a member submits its qualifications for a project to be financed by an appropriation from the legislature. At the meeting of the town council in the town in which the firm of Engineer A is located, objection is voiced to the selection of the firm in which Engineer A is a partner because of his influential position in securing the appropriation.\n\nIn finding that the firm in which Engineer A is a partner may ethically perform engineering services financed by an appropriation secured in part by the position of Engineer A in the legislature, the Board noted that actual awards to the selected engineering firms were to be made by the governing bodies of the local communities. But Engineer A was not a member of the town council, and the facts do not indicate Engineer A used his political office as a means to enhance the opportunities for his firm to benefit from the legislative action.\n\nA third example is BER Case No. 75-7. In this case, John Doe, a civil engineer in private practice, is engaged principally in topographical survey work and the design of water and sewer facilities. He is an appointed member of a commission that controls and determines the issuance of water and sewer connection permits to private owners and developers. The commission’s authority is of such a nature that its decisions have a decisive impact on land development projects and the construction of facilities of all kinds by private owners. While serving on the commission, Doe performed extensive topographic survey work and designed the water and sewer systems for a new private facility that had earlier received approval for necessary water and sewer connections from the commission while he was a member of the commission. In response to public criticism for an alleged conflict of interest on his part, Doe noted that he had abstained from the discussion and vote on the permit application.\n\nBased on the fact that Doe was aware of a potential conflict of interest and he abstained from the discussion and vote, and that it was not established that Doe had influenced the decision on the permit, the Board concluded it was ethical for Doe to perform the engineering and topographic survey work for a private client while serving on the commission when the water and sewer permits were issued. However, the Board did publish a dissenting view that advocated that Doe’s involvement was simply too close and he should resign from the commission.\n\nTurning to the facts in this case, the BER believes that Engineer A should not be part of any discussion where she is advocating for the improvement of the state’s continuing professional development requirements to the PE Board and legislature. In this manner, her situation most closely parallels that of Case No. 75-7.\n\nIn many states, the legislature establishes the law for continuing education requirements and the PE Board enforces that law and establishes the rules. PE Board members typically take an oath to uphold the US and State Constitutions, and to abide by the law established by the state legislature and the rules and regulations adopted by the PE Board. Members of the board of directors of an engineering professional organization typically take an oath to represent the interests of member professionals. If the member professional organization is advocating engineering issues before the legislature or the PE Board, a PE Board member who also serves on the board of the member organization would face a direct conflict. Even absent such direct advocacy, membership on both boards may still present the appearance of a conflict of interest to some members of the public. Membership in engineering professional organizations presents no such conflicts of interest, as engagement in engineering and professional issues is of benefit to PE Board members.\n\nThe BER believes that Engineer A has a conflict of interest and that she should resign as a member of the board of directors of her engineering organization if she desires to serve on her state PE board. In the words of Case 75-7, her involvement “is simply too close.”\n\nThe BER believes that Engineer B’s situation is completely different. Engineer B is the chair of an engineering committee of a national engineering organization, where he recommends changes to his engineering discipline’s engineering education accreditation criteria for ABET. Thus, the situation of Engineer B more closely approximates that described in Case No. 70-6. The BER does not believe that this is a conflict of interest because individual state PE boards have no jurisdiction over ABET’s engineering education criteria. All engineering disciplines have a society that is responsible for establishing discipline-specific program criteria. State licensing board members have nothing to do with ABET’s discipline-specific criteria. Therefore, the BER does not believe that Engineer B has a conflict of interest.\n\nII.3.\n\nEngineers shall issue public statements only in an objective and truthful manner.\n\nII.3.c.\n\nEngineers shall issue no statements, criticisms, or arguments on technical matters that are inspired or paid for by interested parties, unless they have prefaced their comments by explicitly identifying the interested parties on whose behalf they are speaking, and by revealing the existence of any interest the engineers may have in the matters.\n\nII.4.a.\n\nEngineers shall disclose all known or potential conflicts of interest that could influence or appear to influence their judgment or the quality of their services.\n\nII.4.d.\n\nEngineers in public service as members, advisors, or employees of a governmental or quasi-governmental body or department shall not participate in decisions with respect to services solicited or provided by them or their organizations in private or public engineering practice.\n\nII.4.e.\n\nEngineers shall not solicit or accept a contract from a governmental body on which a principal or officer of their organization serves as a member.\n\nIII.2.a.\n\nEngineers are encouraged to participate in civic affairs; career guidance for youths; and work for the advancement of the safety, health, and well-being of their community.\n\nIII.2.e.\n\nEngineers shall continue their professional development throughout their careers and should keep current in their specialty fields by engaging in professional practice, participating in continuing education courses, reading in the technical literature, and attending professional meetings and seminars.\n\nIII.5.\n\nEngineers shall not be influenced in their professional duties by conflicting interests.\n\nEngineer A has a conflict of interest. While public service does not preclude Engineer A from being a member of the state engineering organization, the BER recommends that Engineer A should resign her position as a member of the board of directors of her engineering organization if she desires to serve on her state PE board.\n\n\t\tEngineer B does not have a conflict of interest according to the NSPE Code of Ethics.\n\nEngineer A has a conflict of interest. While public service does not preclude Engineer A from being a member of the state engineering organization, the BER recommends that Engineer A should resign her position as a member of the board of directors of her engineering organization if she desires to serve on her state PE board.\n\nEngineer B does not have a conflict of interest according to the NSPE Code of Ethics.\n\nDISSENTING OPINION (AS TO ENGINEER A ONLY)\n\tOne description of a conflict of interest is a situation in which an individual has competing interests or loyalties. Martin and Schinzinger, in their text, Ethics in Engineering1, state: We can refine our definition of conflict of interest when two conditions are met:\n\nThe professional is in a relationship or role that requires exercising good judgment on behalf of the interests of an employer or client.\n\n\t\tThe professional has some additional or side interest that could threaten good judgment in serving the interests of the employer or client—either the good judgment of that professional or the judgment of a typical professional in that situation.\n\nThe professional is in a relationship or role that requires exercising good judgment on behalf of the interests of an employer or client.\n\nThe professional has some additional or side interest that could threaten good judgment in serving the interests of the employer or client—either the good judgment of that professional or the judgment of a typical professional in that situation.\n\nIn the case of Engineer A, service on both boards requires exercising good judgment; the first condition for a conflict of interest is met. When serving on the PE Board, the discussion of this case established that the ultimate client is the public. Similarly, a fundamental canon of the NSPE Code of Ethics states that in the performance of their professional duties, engineers shall hold paramount the public health, safety, and welfare. Engineer A’s service on both boards is in the interest of the public and judgment will be exercised on the public’s behalf.\n\nFurther, NSPE’s Code of Ethics indicates that an engineer’s professional obligations include striving to serve the public interest; listed activities include service in civic affairs and continued professional development throughout one’s career. These obligations do not fall solely to board members of professional engineering organizations—they apply to all engineers. Advocacy for development and maintenance of professional competence is not an additional or side interest that threatens Engineer A’s good judgment; it is an integral part of Engineer A’s obligation as an engineer. The second condition in Martin and Schinzinger’s definition is not met.\n\nIn case 75-7, the BER stated “Some very thin and difficult lines must be drawn in applying that principle lest we inadvertently hold that an engineer involved in work generally subject to public agency action may never serve on public bodies which even remotely relate to his general field of practice.”\n\nDissenting Opinion Conclusion (as to Engineer A only):\n\tEngineering A must disclose status as a board member of a membership engineering organization; however, participation on both boards does not present a conflict of interest during regular PE Board activities . In the event the PE Board considers a rule that the engineering organization is advocating, recusal from the vote is the appropriate action for Engineer A.\n\n1 Martin, Mike W., Schinzinger, Roland, Ethics in Engineering, 4th Edition (McGraw-Hill, 2005), p. 159.",
  "source": "https://www.nspe.org/career-resources/ethics/conflict-interest-pes-serving-state-licensure-boards",
  "rdf_triples": {
    "triples": [
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "rdf:type",
        "object": "proeth:EthicalDilemma"
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "rdfs:label",
        "object": "II.3.",
        "is_literal": true
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "rdfs:comment",
        "object": "The Board of Licensure for Professional Engineers (“the PE Board”) in State X consists of six professional engineers and a public member. The governor of State X has recently appointed two new board members, Engineer A and Engineer B, to fill two expiring terms. Engineer A otherwise is a member of the board of directors of a membership engineering organization in that state. Engineer B serves as a committee chair of a national engineering organization. At the first meeting of the newly constituted PE Board, the public member asks whether these outside professional activities constitute a conflict of interest with respect to PE Board service. Engineer A responds that (1) although her state organization has been advocating for the improvement of the state’s continuing professional development requirements to the PE Board and the legislature, (2) she has not been making those presentations, but (3) that the advocacy has been discussed at meetings of the state organization’s board of directors. Engineer B responds that he is the chair of an engineering education committee of the national engineering organization, with a role, in part, to recommend changes to his engineering discipline’s engineering education accreditation criteria, for subsequent review and approval by ABET. The PE Board begins to discuss these professional involvements.\n\nDoes Engineer A have a conflict of interest with respect to PE Board service?\n\n\t\tDoes Engineer B have a conflict of interest with respect to PE Board service?\n\nDoes Engineer A have a conflict of interest with respect to PE Board service?\n\nDoes Engineer B have a conflict of interest with respect to PE Board service?\n\nProfessional engineers often find themselves involved with and representing multiple organizational interests in their professional activities, and this can give rise to organizational conflicts of interest. Conflicts of interest are among the most prevalent ethical concerns facing engineering practitioners. Over the years, the Board of Ethical Review has considered numerous cases involving engineers who have interests in conflict with the interests of clients, employees, or other engineers. At one time, the NSPE Code of Ethics specifically prohibited engineers from becoming involved in cases or situations in which a conflict of interest was present. This was based on the view that professional engineers must at all times be above reproach and avoid any situation that could be perceived as compromising their professional judgment and integrity as independent professionals.\n\nOver time, the NSPE Code and the Board of Ethical Review have moderated to the point of recognizing that certain types of conflicts of interest are difficult, if not impossible, to avoid and that the more realistic approach for individual engineers faced with this dilemma is to fully disclose the nature and extent of the conflict to the appropriate parties involved or impacted by the conflict. This is based on the view that the parties most affected by the conflict and who have the most at stake (e.g., clients, employers, other engineering firms, etc.) are in the best position to determine whether their interests will be compromised by the conflict. While sometimes perceived conflicts of interest are resolved by the parties as a result of full disclosure, in other instances the conflicts are deeper and require the engineer to disassociate from a specific project.\n\nPrevious Board of Ethical Review cases provide some background for considering this case. In BER Case No. 18-2, an engineer was a board member of an engineering technical society and was actively encouraging the society to enter into an agreement with Jones Publishing, a technical journal publisher, to annually publish technical articles and content generated by the society’s members. During meetings of the engineering technical society’s board of directors, the engineer expressed strong resistance to exploring other publishing options to determine what terms and conditions other technical journal publishers might offer to the society. Under a separate private, undisclosed side agreement with Jones Publishing, the engineer was to receive a visible and prestigious position as chairman of the editorial board for another journal published by Jones Publishing if the engineering technical society agreed to enter into the agreement with the company.\n\nIn this case, the BER stated the engineer had a trust relationship in his role as a board member of the engineering technical society and, therefore, must provide full disclosure regarding the side agreement with Jones Publishing to become chairman of the editorial board prior to the engineering society’s formal consideration and voting on the matter. The BER believes that conflicts of interest do not necessarily involve only financial considerations, and organizational conflicts can also be significant. In the BER’s view, the engineer also should have recused himself from his role as a board member acting on this issue for the engineering technical society or, if appropriate, resigned as a board member of the engineering technical society.\n\nA second example is BER Case No. 70-6. Here, as a member of a state legislature, Engineer A is on a committee that initially makes appropriations to local communities for certain public works projects. He is also a partner in an engineering firm in the state. Following an appropriation to local communities in the state for projects designed to combat air pollution as recommended by the legislative committee of which Engineer A is a member, the firm of which Engineer A is a member submits its qualifications for a project to be financed by an appropriation from the legislature. At the meeting of the town council in the town in which the firm of Engineer A is located, objection is voiced to the selection of the firm in which Engineer A is a partner because of his influential position in securing the appropriation.\n\nIn finding that the firm in which Engineer A is a partner may ethically perform engineering services financed by an appropriation secured in part by the position of Engineer A in the legislature, the Board noted that actual awards to the selected engineering firms were to be made by the governing bodies of the local communities. But Engineer A was not a member of the town council, and the facts do not indicate Engineer A used his political office as a means to enhance the opportunities for his firm to benefit from the legislative action.\n\nA third example is BER Case No. 75-7. In this case, John Doe, a civil engineer in private practice, is engaged principally in topographical survey work and the design of water and sewer facilities. He is an appointed member of a commission that controls and determines the issuance of water and sewer connection permits to private owners and developers. The commission’s authority is of such a nature that its decisions have a decisive impact on land development projects and the construction of facilities of all kinds by private owners. While serving on the commission, Doe performed extensive topographic survey work and designed the water and sewer systems for a new private facility that had earlier received approval for necessary water and sewer connections from the commission while he was a member of the commission. In response to public criticism for an alleged conflict of interest on his part, Doe noted that he had abstained from the discussion and vote on the permit application.\n\nBased on the fact that Doe was aware of a potential conflict of interest and he abstained from the discussion and vote, and that it was not established that Doe had influenced the decision on the permit, the Board concluded it was ethical for Doe to perform the engineering and topographic survey work for a private client while serving on the commission when the water and sewer permits were issued. However, the Board did publish a dissenting view that advocated that Doe’s involvement was simply too close and he should resign from the commission.\n\nTurning to the facts in this case, the BER believes that Engineer A should not be part of any discussion where she is advocating for the improvement of the state’s continuing professional development requirements to the PE Board and legislature. In this manner, her situation most closely parallels that of Case No. 75-7.\n\nIn many states, the legislature establishes the law for continuing education requirements and the PE Board enforces that law and establishes the rules. PE Board members typically take an oath to uphold the US and State Constitutions, and to abide by the law established by the state legislature and the rules and regulations adopted by the PE Board. Members of the board of directors of an engineering professional organization typically take an oath to represent the interests of member professionals. If the member professional organization is advocating engineering issues before the legislature or the PE Board, a PE Board member who also serves on the board of the member organization would face a direct conflict. Even absent such direct advocacy, membership on both boards may still present the appearance of a conflict of interest to some members of the public. Membership in engineering professional organizations presents no such conflicts of interest, as engagement in engineering and professional issues is of benefit to PE Board members.\n\nThe BER believes that Engineer A has a conflict of interest and that she should resign as a member of the board of directors of her engineering organization if she desires to serve on her state PE board. In the words of Case 75-7, her involvement “is simply too close.”\n\nThe BER believes that Engineer B’s situation is completely different. Engineer B is the chair of an engineering committee of a national engineering organization, where he recommends changes to his engineering discipline’s engineering education accreditation criteria for ABET. Thus, the situation of Engineer B more closely approximates that described in Case No. 70-6. The BER does not believe that this is a conflict of interest because individual state PE boards have no jurisdiction over ABET’s engineering education criteria. All engineering disciplines have a society that is responsible for establishing discipline-specific program criteria. State licensing board members have nothing to do with ABET’s discipline-specific criteria. Therefore, the BER does not believe that Engineer B has a conflict of interest.\n\nII.3.\n\nEngineers shall issue public statements only in an objective and truthful manner.\n\nII.3.c.\n\nEngineers shall issue no statements, criticisms, or arguments on technical matters that are inspired or paid for by interested parties, unless they have prefaced their comments by explicitly identifying the interested parties on whose behalf they are speaking, and by revealing the existence of any interest the engineers may have in the matters.\n\nII.4.a.\n\nEngineers shall disclose all known or potential conflicts of interest that could influence or appear to influence their judgment or the quality of their services.\n\nII.4.d.\n\nEngineers in public service as members, advisors, or employees of a governmental or quasi-governmental body or department shall not participate in decisions with respect to services solicited or provided by them or their organizations in private or public engineering practice.\n\nII.4.e.\n\nEngineers shall not solicit or accept a contract from a governmental body on which a principal or officer of their organization serves as a member.\n\nIII.2.a.\n\nEngineers are encouraged to participate in civic affairs; career guidance for youths; and work for the advancement of the safety, health, and well-being of their community.\n\nIII.2.e.\n\nEngineers shall continue their professional development throughout their careers and should keep current in their specialty fields by engaging in professional practice, participating in continuing education courses, reading in the technical literature, and attending professional meetings and seminars.\n\nIII.5.\n\nEngineers shall not be influenced in their professional duties by conflicting interests.\n\nEngineer A has a conflict of interest. While public service does not preclude Engineer A from being a member of the state engineering organization, the BER recommends that Engineer A should resign her position as a member of the board of directors of her engineering organization if she desires to serve on her state PE board.\n\n\t\tEngineer B does not have a conflict of interest according to the NSPE Code of Ethics.\n\nEngineer A has a conflict of interest. While public service does not preclude Engineer A from being a member of the state engineering organization, the BER recommends that Engineer A should resign her position as a member of the board of directors of her engineering organization if she desires to serve on her state PE board.\n\nEngineer B does not have a conflict of interest according to the NSPE Code of Ethics.\n\nDISSENTING OPINION (AS TO ENGINEER A ONLY)\n\tOne description of a conflict of interest is a situation in which an individual has competing interests or loyalties. Martin and Schinzinger, in their text, Ethics in Engineering1, state: We can refine our definition of conflict of interest when two conditions are met:\n\nThe professional is in a relationship or role that requires exercising good judgment on behalf of the interests of an employer or client.\n\n\t\tThe professional has some additional or side interest that could threaten good judgment in serving the interests of the employer or client—either the good judgment of that professional or the judgment of a typical professional in that situation.\n\nThe professional is in a relationship or role that requires exercising good judgment on behalf of the interests of an employer or client.\n\nThe professional has some additional or side interest that could threaten good judgment in serving the interests of the employer or client—either the good judgment of that professional or the judgment of a typical professional in that situation.\n\nIn the case of Engineer A, service on both boards requires exercising good judgment; the first condition for a conflict of interest is met. When serving on the PE Board, the discussion of this case established that the ultimate client is the public. Similarly, a fundamental canon of the NSPE Code of Ethics states that in the performance of their professional duties, engineers shall hold paramount the public health, safety, and welfare. Engineer A’s service on both boards is in the interest of the public and judgment will be exercised on the public’s behalf.\n\nFurther, NSPE’s Code of Ethics indicates that an engineer’s professional obligations include striving to serve the public interest; listed activities include service in civic affairs and continued professional development throughout one’s career. These obligations do not fall solely to board members of professional engineering organizations—they apply to all engineers. Advocacy for development and maintenance of professional competence is not an additional or side interest that threatens Engineer A’s good judgment; it is an integral part of Engineer A’s obligation as an engineer. The second condition in Martin and Schinzinger’s definition is not met.\n\nIn case 75-7, the BER stated “Some very thin and difficult lines must be drawn in applying that principle lest we inadvertently hold that an engineer involved in work generally subject to public agency action may never serve on public bodies which even remotely relate to his general field of practice.”\n\nDissenting Opinion Conclusion (as to Engineer A only):\n\tEngineering A must disclose status as a board member of a membership engineering organization; however, participation on both boards does not present a conflict of interest during regular PE Board activities . In the event the PE Board considers a rule that the engineering organization is advocating, recusal from the vote is the appropriate action for Engineer A.\n\n1 Martin, Mike W., Schinzinger, Roland, Ethics in Engineering, 4th Edition (McGraw-Hill, 2005), p. 159.",
        "is_literal": true
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "NSPE:caseNumber",
        "object": "Case 75-7",
        "is_literal": true
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "NSPE:caseYear",
        "object": "1975",
        "is_literal": true
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "NSPE:sourceUrl",
        "object": "https://www.nspe.org/career-resources/ethics/conflict-interest-pes-serving-state-licensure-boards",
        "is_literal": true
      },
      {
        "subject": "ENG_ETHICS:ObjectivityPrincipleInstance_Case 75_7",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "ENG_ETHICS:ObjectivityPrincipleInstance_Case 75_7",
        "predicate": "rdf:type",
        "object": "ENG_ETHICS:ObjectivityPrinciple"
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "eng:involvesPrinciple",
        "object": "ENG_ETHICS:ObjectivityPrincipleInstance_Case 75_7"
      },
      {
        "subject": "ENG_ETHICS:PublicSafetyPrincipleInstance_Case 75_7",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "ENG_ETHICS:PublicSafetyPrincipleInstance_Case 75_7",
        "predicate": "rdf:type",
        "object": "ENG_ETHICS:PublicSafetyPrinciple"
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "eng:involvesPrinciple",
        "object": "ENG_ETHICS:PublicSafetyPrincipleInstance_Case 75_7"
      },
      {
        "subject": "ENG_ETHICS:CompetencyPrincipleInstance_Case 75_7",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "ENG_ETHICS:CompetencyPrincipleInstance_Case 75_7",
        "predicate": "rdf:type",
        "object": "ENG_ETHICS:CompetencyPrinciple"
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "eng:involvesPrinciple",
        "object": "ENG_ETHICS:CompetencyPrincipleInstance_Case 75_7"
      },
      {
        "subject": "NSPE:safetyPrincipleInstance_Case 75_7",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "NSPE:safetyPrincipleInstance_Case 75_7",
        "predicate": "rdf:type",
        "object": "NSPE:safetyPrinciple"
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "eng:involvesPrinciple",
        "object": "NSPE:safetyPrincipleInstance_Case 75_7"
      },
      {
        "subject": "ENG_ETHICS:HonestyPrincipleInstance_Case 75_7",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "ENG_ETHICS:HonestyPrincipleInstance_Case 75_7",
        "predicate": "rdf:type",
        "object": "ENG_ETHICS:HonestyPrinciple"
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "eng:involvesPrinciple",
        "object": "ENG_ETHICS:HonestyPrincipleInstance_Case 75_7"
      },
      {
        "subject": "NSPE:welfarePrincipleInstance_Case 75_7",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "NSPE:welfarePrincipleInstance_Case 75_7",
        "predicate": "rdf:type",
        "object": "NSPE:welfarePrinciple"
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "eng:involvesPrinciple",
        "object": "NSPE:welfarePrincipleInstance_Case 75_7"
      },
      {
        "subject": "ENG_ETHICS:ConflictOfInterestAvoidanceObligationInstance_Case 75_7",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "ENG_ETHICS:ConflictOfInterestAvoidanceObligationInstance_Case 75_7",
        "predicate": "rdf:type",
        "object": "ENG_ETHICS:ConflictOfInterestAvoidanceObligation"
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "eng:involvesPrinciple",
        "object": "ENG_ETHICS:ConflictOfInterestAvoidanceObligationInstance_Case 75_7"
      },
      {
        "subject": "ENG_ETHICS:ProfessionalResponsibilityInstance_Case 75_7",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "ENG_ETHICS:ProfessionalResponsibilityInstance_Case 75_7",
        "predicate": "rdf:type",
        "object": "ENG_ETHICS:ProfessionalResponsibility"
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "eng:involvesPrinciple",
        "object": "ENG_ETHICS:ProfessionalResponsibilityInstance_Case 75_7"
      },
      {
        "subject": "NSPE:healthPrincipleInstance_Case 75_7",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "NSPE:healthPrincipleInstance_Case 75_7",
        "predicate": "rdf:type",
        "object": "NSPE:healthPrinciple"
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "eng:involvesPrinciple",
        "object": "NSPE:healthPrincipleInstance_Case 75_7"
      },
      {
        "subject": "NSPE:public_healthPrincipleInstance_Case 75_7",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "NSPE:public_healthPrincipleInstance_Case 75_7",
        "predicate": "rdf:type",
        "object": "NSPE:public_healthPrinciple"
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "eng:involvesPrinciple",
        "object": "NSPE:public_healthPrincipleInstance_Case 75_7"
      },
      {
        "subject": "ENG_ETHICS:HonestyPrincipleInstance_Case 75_7",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "ENG_ETHICS:HonestyPrincipleInstance_Case 75_7",
        "predicate": "rdf:type",
        "object": "ENG_ETHICS:HonestyPrinciple"
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "eng:involvesPrinciple",
        "object": "ENG_ETHICS:HonestyPrincipleInstance_Case 75_7"
      },
      {
        "subject": "ENG_ETHICS:CompetencyPrincipleInstance_Case 75_7",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "ENG_ETHICS:CompetencyPrincipleInstance_Case 75_7",
        "predicate": "rdf:type",
        "object": "ENG_ETHICS:CompetencyPrinciple"
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "eng:involvesPrinciple",
        "object": "ENG_ETHICS:CompetencyPrincipleInstance_Case 75_7"
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "rel:references",
        "object": "NSPE:NSPECodeII4a"
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "rel:references",
        "object": "NSPE:Code_II_3"
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "rel:references",
        "object": "NSPE:Code_III_2_a"
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "rel:references",
        "object": "NSPE:Code_II_3_c"
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "rel:references",
        "object": "NSPE:NSPECodeII4d"
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "rel:references",
        "object": "NSPE:Code_III_5"
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "rel:references",
        "object": "NSPE:Code_II_4_e"
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "rel:references",
        "object": "NSPE:Code_III_2_e"
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "rdf:type",
        "object": "ENG_ETHICS:CompetencyVsClientWishesDilemma"
      },
      {
        "subject": "Engineer_A_Case 75_7",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "Engineer_A_Case 75_7",
        "predicate": "rdf:type",
        "object": "ar:Character"
      },
      {
        "subject": "Engineer_A_Case 75_7",
        "predicate": "rdfs:label",
        "object": "Engineer A",
        "is_literal": true
      },
      {
        "subject": "eng:EngineeringRoleInstance_Engineer_A_Case 75_7",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "eng:EngineeringRoleInstance_Engineer_A_Case 75_7",
        "predicate": "rdf:type",
        "object": "eng:EngineeringRole"
      },
      {
        "subject": "Engineer_A_Case 75_7",
        "predicate": "ar:hasRole",
        "object": "eng:EngineeringRoleInstance_Engineer_A_Case 75_7"
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "rel:involves",
        "object": "Engineer_A_Case 75_7"
      },
      {
        "subject": "Engineer_B_Case 75_7",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "Engineer_B_Case 75_7",
        "predicate": "rdf:type",
        "object": "ar:Character"
      },
      {
        "subject": "Engineer_B_Case 75_7",
        "predicate": "rdfs:label",
        "object": "Engineer B",
        "is_literal": true
      },
      {
        "subject": "eng:EngineeringRoleInstance_Engineer_B_Case 75_7",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "eng:EngineeringRoleInstance_Engineer_B_Case 75_7",
        "predicate": "rdf:type",
        "object": "eng:EngineeringRole"
      },
      {
        "subject": "Engineer_B_Case 75_7",
        "predicate": "ar:hasRole",
        "object": "eng:EngineeringRoleInstance_Engineer_B_Case 75_7"
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "rel:involves",
        "object": "Engineer_B_Case 75_7"
      },
      {
        "subject": "Decision_Case 75_7",
        "predicate": "rdf:type",
        "object": "owl:NamedIndividual"
      },
      {
        "subject": "Decision_Case 75_7",
        "predicate": "rdf:type",
        "object": "eng:EthicalDecision"
      },
      {
        "subject": "Decision_Case 75_7",
        "predicate": "rdfs:label",
        "object": "NSPE Board Decision for Case Case 75-7",
        "is_literal": true
      },
      {
        "subject": "Decision_Case 75_7",
        "predicate": "NSPE:outcome",
        "object": "Ethical",
        "is_literal": true
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "rel:hasDecision",
        "object": "Decision_Case 75_7"
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "NSPE:boardAnalysis",
        "object": "ith respect to services solicited or provided by them or their organizations in private or public engineering practice.\n\nII.4.e.\n\nEngineers shall not solicit or accept a contract from a governmental body on which a principal or officer of their organization serves as a member.\n\nIII.2.a.\n\nEngineers are encouraged to participate in civic affairs; career guidance for youths; and work for the advancement of the safety, health, and well-being of their community.\n\nIII.2.e.\n\nEngineers shall continue their professional development throughout their careers and should keep current in their specialty fields by engaging in professional practice, participating in continuing education courses, reading in the technical literature, and attending professional meetings and seminars.\n\nIII.5.\n\nEngineers shall not be influenced in their professional duties by conflicting interests.\n\nEngineer A has a conflict of interest. While public service does not preclude Engineer A from being a member of the state eng\n[content truncated]",
        "is_literal": true
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "rel:relatedTo",
        "object": "Case:Case_Case 70_6"
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "rel:relatedTo",
        "object": "Case:Case_Case 18_2"
      },
      {
        "subject": "Case:Case_Case 75_7_II_3",
        "predicate": "rel:relatedTo",
        "object": "Case:Case_Case 75_7"
      }
    ],
    "namespaces": {
      "Case": "http://proethica.org/case/",
      "NSPE": "http://proethica.org/nspe/",
      "ENG_ETHICS": "http://proethica.org/ontology/engineering-ethics#",
      "rdf": "http://www.w3.org/1999/02/22-rdf-syntax-ns#",
      "rdfs": "http://www.w3.org/2000/01/rdf-schema#",
      "owl": "http://www.w3.org/2002/07/owl#",
      "bfo": "http://purl.obolibrary.org/obo/",
      "proeth": "http://proethica.org/ontology/intermediate#",
      "dc": "http://purl.org/dc/elements/1.1/",
      "ar": "http://proethica.org/ontology/agent-role#",
      "eng": "http://proethica.org/ontology/engineering-ethics#",
      "nspe": "http://proethica.org/nspe/",
      "rel": "http://proethica.org/relation/"
    }
  },
  "metadata": {
    "related_cases": [
      "Case 70-6",
      "Case 18-2",
      "Case 75-7"
    ],
    "codes_cited": [
      "Code II.4.a",
      "Code II.3",
      "Code III.2.a",
      "Code II.3.c",
      "Code II.4.d",
      "Code III.5",
      "Code II.4.e",
      "Code III.2.e"
    ],
    "principles": [
      "objectivity",
      "public safety",
      "professional judgment",
      "safety",
      "honesty",
      "welfare",
      "conflicts of interest",
      "professional responsibility",
      "health",
      "public health",
      "disclosure",
      "competency"
    ],
    "outcome": "ethical",
    "operationalization_techniques": [
      "Principle Instantiation",
      "Case Instantiation",
      "Conflicting Principles Resolution"
    ],
    "board_analysis": "ith respect to services solicited or provided by them or their organizations in private or public engineering practice.\n\nII.4.e.\n\nEngineers shall not solicit or accept a contract from a governmental body on which a principal or officer of their organization serves as a member.\n\nIII.2.a.\n\nEngineers are encouraged to participate in civic affairs; career guidance for youths; and work for the advancement of the safety, health, and well-being of their community.\n\nIII.2.e.\n\nEngineers shall continue their professional development throughout their careers and should keep current in their specialty fields by engaging in professional practice, participating in continuing education courses, reading in the technical literature, and attending professional meetings and seminars.\n\nIII.5.\n\nEngineers shall not be influenced in their professional duties by conflicting interests.\n\nEngineer A has a conflict of interest. While public service does not preclude Engineer A from being a member of the state eng\n[content truncated]",
    "ethical_questions": [
      "Was the engineer's conduct regarding the board of licensure for professional engineers (“the pe board”) in state x consists of six professional engineers and a public member ethical?"
    ]
  }
}